{"title":"Smokey Robinson - Tears Of A Clown (Live-Beat Club) (2nafish)","uid":5278852,"size":106250244,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:000795924f037ef27079001946320c07696565ea&amp;dn=Smokey+Robinson+-+Tears+Of+A+Clown+%28Live-Beat+Club%29+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1263477610,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;The Tears of a Clown&quot; is a 1967 song by Smokey Robinson &amp; the Miracles for the Tamla (Motown) label, originally released on the 1967 album Make It Happen. The song was re-released in the United Kingdom as a single in September 1970, where it became a number-one hit on the UK singles chart. Subsequently, Motown released &quot;The Tears of a Clown&quot; as a single in the United States as well, where it quickly became a number-one hit on the Billboard Hot 100 and R&amp;B Singles Chart. This song is an international multi-million seller and a 2002 Grammy Hall of Fame inductee. The single's success caused Miracles lead singer/producer/songwriter Smokey Robinson, who had announced plans to leave the act, to stay with the group until 1972.\n\nThis newfound popularity prompted Motown to release the song as a single in the United States, where it became a number-one hit on both the pop and R&amp;B charts within two months of its release. Despite the fact that The Miracles had been one of Motown's premier acts in the early and mid-1960s and its first successful group act, &quot;The Tears of a Clown&quot; was their first and only #1 hit while Smokey Robinson was lead singer. (The Miracles hit number one again several years later with the smash hit &quot;Love Machine&quot;, but by that time Smokey had long since left the group, replaced by Billy Griffin. Shop Around had hit #1 pop on the Cash Box Pop Chart, but only # 2 on Billboard's).\n\nThe 45 single was issued with two different b-sides. The first pressing had an alternate version of the 1967 Miracles Top 20 hit single &quot;The Love I Saw in You Was Just a Mirage&quot; included on the flip side of &quot;The Tears of a Clown&quot;, while the second included a new Miracles song, &quot;Promise Me&quot;. Motown released a Tears of a Clown LP in 1970 as well, which was essentially a re-packaging of the Miracles' 1967 Make It Happen LP.\n\nTwo years later, Smokey Robinson decided to follow through with his plans to leave the Miracles and retire. Smokey Robinson &amp; the Miracles embarked on a six-month farewell tour, which culminated in a July 16, 1972 performance in Washington, DC, where Robinson introduced the Miracles' new lead singer, Billy Griffin. Interestingly,The Tears of a Clown charted again in England six years later, in 1976, becoming a Top 40 hit, peaking at # 34.\n\nToday, &quot;The Tears of a Clown&quot; continues to be a popular radio request.\n\nMake It Happen is a 1967 album by Smokey Robinson &amp; the Miracles. It featured ballads such as the singles &quot;The Love I Saw In You Was Just A Mirage&quot; and &quot;More Love&quot;, as well as the up-tempo &quot;The Tears of a Clown&quot; co-written by Stevie Wonder and his producer Hank Cosby.\n\nThree years after the album's release, &quot;The Tears of a Clown&quot; was issued as a single, and charted at number-one on both the Billboard Hot 100 and the UK Singles Chart. As a result, Make It Happen was reissued as The Tears of a Clown in 1970.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:000795924f037ef27079001946320c07696565ea","amp;dn":"Smokey+Robinson+-+Tears+Of+A+Clown+%28Live-Beat+Club%29+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"000795924f037ef27079001946320c07696565ea","infoHashBuffer":{"type":"Buffer","data":[0,7,149,146,79,3,126,242,112,121,0,25,70,50,12,7,105,101,101,234]},"announce":[],"urlList":[]}}