{"title":"Cook-Bank Structure of USSR(banking system in state capitalism)(","uid":5399896,"size":44068,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:005ad40e1aeceb24ec1f79b8b23bc3c8ec9d043d&amp;dn=Cook-Bank+Structure+of+USSR%28banking+system+in+state+capitalism%29%28&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"red_gonzo","files":1,"time":1267381131,"description":"This is Peter Cook's informative booklet The Bank Structure of the U.S.S.R. (1991) which describes a conventional and necessarily solvent banking system under a regime of absolute state capitalism that existed in Soviet Union. Marxian ideology has nothing to do with it as the principles, methods, techniques and even terms are all from the book of capitalism. For example: central bank, gold reserves, note issue, cash balances, working capital, long and short-term credit for industry and agriculture, savings, surplus, profit and loss. Almost you might think you were reading an elementary text on banking in a system of free private enterprise banking; and in fact the only technical difference is that here the state is everything. It owns the bank, all the cash balances, all the reserves, all the working capital. Industry belongs to the state-bank. All profits go to the state-bank. When there is borrowing and lending at interest, it is the state borrowing from itself and lending to itself. The author further makes a comparison of the Soviet &quot;labor&quot; monetizing money system, to that of the U.S. commercial banks &quot;assets and taxes&quot; monetizing money and banking system. Not generally recognized, that in the United States, the Federal Reserve supplies the national government with money (directly and indirectly) by monetizing (at high interest cost) government debt (bonds) and its taxing powers. Therefore, the socio-economic benefits, that the U.S. Government can afford to extend to the people, are limited by its taxing capability. When the taxing powers of government are exhausted, and when there are no more assets of the productive society left to be monetized - the history of ancient Greece, Rome, France of 1776, Russia of 1917 will repeat itself. Not because the people, as often recited, forgot history - but because the people had been denied the knowledge and understanding, that within &quot;the private bankers' Asset and Taxes Monetizing business&quot; resides the &quot;seed&quot; of its own and its debt-enslaved peoples financial and economic destruction. 15 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:005ad40e1aeceb24ec1f79b8b23bc3c8ec9d043d","amp;dn":"Cook-Bank+Structure+of+USSR%28banking+system+in+state+capitalism%29%28","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"005ad40e1aeceb24ec1f79b8b23bc3c8ec9d043d","infoHashBuffer":{"type":"Buffer","data":[0,90,212,14,26,236,235,36,236,31,121,184,178,59,195,200,236,157,4,61]},"announce":[],"urlList":[]}}