{"title":"Enchanted.WS.2007.NTSC.DVD5","uid":5231651,"size":4124633088,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:006d0952428b0f94fc36216ced112f9bc35d9b58&amp;dn=Enchanted.WS.2007.NTSC.DVD5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sheridan2258","files":10,"time":1261353323,"description":"With a fine cast and fun in-jokes, Disney's ENCHANTED is sure to cast a spell over both children and adults. It begins with a 2-D animation sequence reminiscent of the company's beloved past. Surrounded by dozens of cute animals, Giselle (voiced and later played by Amy Adams) sings about her desire to find her one true love. Meanwhile, a handsome prince (James Marsden) overhears her, and they meet and fall in love. In many Disney movies, this is where the story ends, but ENCHANTED is just starting out on its journey. The prince's wicked stepmother (Susan Sarandon) can't stand to lose her throne, so she pushes Giselle down a well, and the beauty ends up in the real world. Gone is the animated fantasy, and a live-action Giselle lands in the middle of Times Square in New York City. Her optimism and perkiness put her at odds with the New Yorkers she encounters, but she gets help from a cynical divorce lawyer (Patrick Dempsey) as she waits for her prince to rescue her. Fans of Disney classics from SLEEPING BEAUTY to BEAUTY AND THE BEAST will be glad to see their favorite films referenced in ENCHANTED. Jodi Benson (the voice of Ariel in THE LITTLE MERMAID) makes a brief appearance, and the evil queen threatens to kill Giselle with a poisoned apple ÃƒÂ  la SNOW WHITE. Though it reminds the audience of past favorites, ENCHANTED boasts its own script that is at once intelligent and heartwarming. But the true highlight of the film is the acting by the fairy tale couple. Marsden (HAIRSPRAY) couldn't be funnier as the charming prince, while Adams (an Oscar nominee for 2005's JUNEBUG) gives dimension to the heroine. As a result, ENCHANTED is a film that deserves to sit on a shelf with Disney's classics.","torrent":{"xt":"urn:btih:006d0952428b0f94fc36216ced112f9bc35d9b58","amp;dn":"Enchanted.WS.2007.NTSC.DVD5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"006d0952428b0f94fc36216ced112f9bc35d9b58","infoHashBuffer":{"type":"Buffer","data":[0,109,9,82,66,139,15,148,252,54,33,108,237,17,47,155,195,93,155,88]},"announce":[],"urlList":[]}}