{"title":"B.B. King-Into The Night(from the movie Into The Night)(2nafish)","uid":5386339,"size":156360708,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:0153a2331c54aa5a84e6a547bbcbc9b991d961f3&amp;dn=B.B.+King-Into+The+Night%28from+the+movie+Into+The+Night%29%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"2nafish","files":-1,"time":1266906879,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nB.B. King - Into The Night (featured in the movie Into The Night) (2nafish)\n\n\nNote: This video is a &quot;Movies &amp; Music&quot; video so it has 2 logos.\n\n\n\nB.B. King &quot;Into the Night&quot; is a 1985 documentary film directed by Jeff Okun and co - directed by John Landis for the Universal and it was produced by Leslie Belzberg, John Landis and George Folsey Jr.\n\nLandis made three music parts of this film, which are - in fact - music videos of B.B. King's songs: Lucille, Into the Night (specially composed by Ira Newborn for movie Into the Night ) and also for the song In the Midnight Hour. Videos for Lucille and In the Midnight Hour are similar and shows B.B. King and his Band (Jeff Goldblum, Michelle Pfeiffer, Dan Aykroyd, Eddie Murphy and Steve Martin) during their performance in one of the 80's night's clubs. Video made for Into the Night took place in television studio and shows B.B. King with Jeff Goldblum. Jeff Okun directed the rest of this film (including editing archival King's footage and interviews with Landis and King). The movie was made to promotion Into the Night movie and as a tribute to B.B. King's life and art.\n\nRiley B. King (born September 16, 1925), known by the stage name B.B. King, is an American blues guitarist and singer-songwriter acclaimed for his expressive singing and guitar playing.\n\nRolling Stone magazine ranked him at #3 on its list of the &quot;100 greatest guitarists of all time.&quot; According to Edward M. Komara, King &quot;introduced a sophisticated style of soloing based on fluid string bending and shimmering vibrato that would influence virtually every electric blues guitarist that followed.&quot;\n\nIn June 2008, King played at the Bonnaroo Music and Arts Festival in Manchester, Tennessee; he was also the final performer at the 25th annual Chicago Blues Festival on June 8, 2008, and at the Monterey Blues Festival, following Taj Mahal. Another June 2008 event was King's induction into the Hollywood Bowl Hall of Fame alongside Liza Minnelli and Sir James Galway.\n\nIn July 2008, Sirius XM Radio's Bluesville channel was re-named B.B. King's Bluesville.\n\nOn December 1, 2008, King performed at the Maryland Theater in Hagerstown, Maryland. On December 3, King and John Mayer were the closing act at the 51st Grammy Nomination Concert, playing &quot;Let the Good Times Roll&quot; by Louis Jordan. On December 30, 2008, King played at The Kennedy Center Honors Awards Show; his performance was in honor of actor Morgan Freeman.\n\nKing is slated to perform at the closing ceremonies of the Mawazine festival in Rabat, Morocco, on May 29, 2010.\n\nOver a period of 52 years, B.B. King has played in excess of 15,000 performances.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:0153a2331c54aa5a84e6a547bbcbc9b991d961f3","amp;dn":"B.B.+King-Into+The+Night%28from+the+movie+Into+The+Night%29%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0153a2331c54aa5a84e6a547bbcbc9b991d961f3","infoHashBuffer":{"type":"Buffer","data":[1,83,162,51,28,84,170,90,132,230,165,71,187,203,201,185,145,217,97,243]},"announce":[],"urlList":[]}}