{"title":"Heron...Upon Reflection - The Dawn Anthology, 2cd(1972)cdrip[FLA","uid":5303688,"size":861236574,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:02700d1abcadb3805a34ddc7b861964d9397de97&amp;dn=Heron...Upon+Reflection+-+The+Dawn+Anthology%2C+2cd%281972%29cdrip%5BFLA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dickspic","files":45,"time":1264316236,"description":"Audio CD (26 Feb 2008)\nNumber of Discs: 2\nFormat: Box set\nLabel: Sanctuary\nASIN: B000HT3KNS\n\nDisc: 1\n1. Yellow Roses\n2. Car Crash\n3. Harlequin 2\n4. Smiling Ladies\n5. Little Boy\n6. Sally Goodin\n7. Upon Reflection\n8. Lord and Master\n9. Little Angel\n10. Goodbye\n11. For You\n12. Sally Goodin\n13. Carnival And Penitence\n14. Harlequin 2\n15. Rosalind\n16. Bye and Bye\n17. Through Time\n18. Only A Hobo\n19. I'm Ready To Leave\n20. River Of Fortune\n21. Some Kinda Big Thing\n22. If It's Love\nDisc: 2\n1. Madman\n2. Take Me Back Home\n3. Love 13 (Lone)\n4. Something Inside\n5. Miss Kiss\n6. John Brown\n7. Big A\n8. Winter Harlequin\n9. The Sound Of Music\n10. Your Love And Mine\n11. You Really Got A Hold On Me\n12. The Great Dust Storm\n13. My Turn To Cry\n14. This Old Heart Of Mine\n15. Minstrel And A King\n16. Getting 'Em Down\n17. I Wouldn't Mind\n18. He's A Poor Boy\n19. The Devil\n20. Wanderer\n21. Harlequin 5\n\nThe first disc opens with their first album &quot;Heron&quot;, this is the recording that defines them and best captures what made them unique. Retaining birdsong and breeze in the background between tracks is very nice. The songs themselves are drifty, mellow and folky in a singer-songwriter folky sense, as opposed to being steeped in the tradition like Trees, Fairport etc. The frequent mention of rivers, waterfalls, meadows and trees in the lyrics evoke an idyllic English countryside that would perhaps peeve some actual country residents, but it's nice all the same. Some of the songs feel like watercolour paintings in a way. Highlights include &quot;Lord And Master&quot; and &quot;For You&quot;, both of which feature uncredited female backing vocals that add a lovely touch. \n\n&quot;Heron&quot; is followed by two tracks from the same sessions, the full-length &quot;Harlequin 2&quot; is great, but better still is &quot;Rosalind&quot;, to my thinking a finer track than many that were chosen at the time for the album. Most of the remaining tracks on disc one and disc two feature a more robust ensemble, their sound often boosted by drums and bass to the point that their meadows seem forgotten and they sound, well, talented but less distinctive. This sense is intensified by various &quot;indoor-sounding&quot; instruments being more to the fore, such as piano. \n\n&quot;Winter Harlequin&quot; is one track on disc two that sets back into the mood of the first album, and happily it is also the longest track on the collection, with beautiful delicate extended instrumental passages. It's the track, to my thinking, that best lives up to what is otherwise a misnomer, the description of Heron as &quot;legendary prog-folkies&quot;, mentioned in the cd notes. Be advised that there are far more tracks that bear no resemblance to prog at all, Heron having quite eclectic taste, such as in the straight-up cover of &quot;You Really Got A Hold On Me&quot;. For the most-part I'm hearing strong Beatles influences, the likes of &quot;Blackbird&quot; and &quot;Mother Nature's Son&quot; come to mind often, and also post-Beatles George Harrison, and Wings at their mellowest. The similarity between the lead singer and Paul McCartney in tone and delivery is striking at times on disc two. Sometimes the likeness gets a bit distracting. Elsewhere, there is something of a Simon And Garfunkel sound, whilst &quot;Bye And Bye&quot; has Van Morrison written all over it. &quot;River Of Fortune&quot; is perhaps the song that most resembles another band mentioned on the sleeve as an influence, Incredible String Band, but in general Heron don't exhibit much of the endearing strangeness of ISB. \n\nOn disc two highlights for me include &quot;Love 13 (Lone)&quot; and &quot;Minstrel And A King&quot;, alongside &quot;Winter Harlequin&quot;. The band themselves say that &quot;Twice As Nice And Half The Price&quot; should really have been edited down to a strong single disc album in its day, and I agree with that. In my opinion the cover versions should have been the first to get the chop, so that the focus could be kept upon the band itself, and their own songs. The first time I listened to &quot;John Brown&quot; I was struck by the gratingly clumsy lyrics that did no justice to the heavy subject-matter being tackled, and I was surprised to discover it was written by Bob Dylan\n\nCastle 2006, 2 CDs, 68 + 76 minutes (complete metadata) \nThe double CD gathers together the band's two albums for the Dawn label in the early seventies, plus a maxi single and previous unreleased material. \nTHE GROUP: Tony Pook (vocals), Roy Apps (guitar, vocals), \nGerald Moore (guitar, mandolin, vocals) and Steve Jones (keyboards). \nThe two albums were recorded in the fields, with the assistance of the Pye Mobile Unit, the first without drums, and the second with the assistance of Mike Finesilver (bass), Terry Gittings (drums), Bill Boazman (electric guitar) and Mike Cooper (slide guitar). \nTHE SONGS: tracks 1 to 13 from the album &quot;Heron&quot; (November 1970) \ntrack 14: previously unreleased full-length version of the song &quot;Harlequin 2&quot; \ntrack 15: previously unreleased outtake from &quot;Heron&quot; \ntracks 16 to 19: the Heron maxi-single (April 1971) \ntracks 20 and 21: previously unissued tracks (recorded 27 July 1970) \ntrack 22: previously unissued track (recorded 16 August 1972) \nDisc 2: the double album &quot;Twice As Nice and Half the Price&quot; (October 1971) \nTHE MUSIC: mostly originals, bucolic-acoustic-gentle ballads \nTHE SOUND: Superb remastering\n","torrent":{"xt":"urn:btih:02700d1abcadb3805a34ddc7b861964d9397de97","amp;dn":"Heron...Upon+Reflection+-+The+Dawn+Anthology%2C+2cd%281972%29cdrip%5BFLA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02700d1abcadb3805a34ddc7b861964d9397de97","infoHashBuffer":{"type":"Buffer","data":[2,112,13,26,188,173,179,128,90,52,221,199,184,97,150,77,147,151,222,151]},"announce":[],"urlList":[]}}