{"title":"Kiss - (You Make Me) Rock Hard  (2nafish)","uid":5303919,"size":133093380,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:03697a8eb2b2ff1666edc5d3b664dd280ee20b0e&amp;dn=Kiss+-+%28You+Make+Me%29+Rock+Hard++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1264325850,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 4000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\nSmashes, Thrashes &amp; Hits is a greatest hits album by the American hard rock band Kiss. It was the third hits album overall but the second such album released by the band in the United States (Killers was not released in the United States originally). Of the 15 songs on the album, two were new compositions and three were released after the band's unmasking in 1983. The remaining ten were all released during the band's years in makeup.\n\nIt was certified 2x Platinum on February 26, 1996, when it sold 2,000,000 copies, Kiss' only album of the non-makeup era to achieve that RIAA status officially.\n\nThe two new songs on Smashes, Thrashes &amp; Hits were &quot;Let's Put The X In Sex&quot; and &quot;(You Make Me) Rock Hard,&quot; which feature the same polished production style as 1987's Crazy Nights. They were both produced and co-written by guitarist/vocalist Paul Stanley, and were accompanied by videos that received moderate airplay on MTV.\n\nNearly all of the songs recorded by the band's original lineup were altered in one way or another. One song, &quot;Beth,&quot; was re-recorded with lead vocals by then-drummer Eric Carr, who had replaced the original drummer Peter Criss in 1980.\n\nIn 1983, Kiss abandoned its makeup and enjoyed a commercial resurgence throughout the rest of the decade. Buoyed by a wave of Kiss nostalgia in the 1990s, the band announced a reunion of the original lineup (with makeup) in 1996. The resulting Kiss Alive/Worldwide/Lost Cities/Reunion Tour was the top-grossing act of 1996 and 1997. Criss and Frehley have since left Kiss again and have been replaced by Eric Singer and Tommy Thayer, respectively. The band continues to perform with makeup, while Stanley and Simmons have remained the only two constant members.\n\nKiss was named by VH1 as 10th on their list of the '100 Greatest Artists of Hard Rock' and 9th on 'The Greatest Metal Bands' list by MTV.  On 23 September 2009, Kiss was nominated for the Rock and Roll Hall of Fame, ten years after becoming eligible but on December 15th 2009 it was announced that Kiss did not make it into the Rock and Roll Hall of Fame.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:03697a8eb2b2ff1666edc5d3b664dd280ee20b0e","amp;dn":"Kiss+-+%28You+Make+Me%29+Rock+Hard++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03697a8eb2b2ff1666edc5d3b664dd280ee20b0e","infoHashBuffer":{"type":"Buffer","data":[3,105,122,142,178,178,255,22,102,237,197,211,182,100,221,40,14,226,11,14]},"announce":[],"urlList":[]}}