{"title":"Loca obsesion [BRSCREENER][Xvid][Spanish][www.PorTorrent.com]","uid":5340340,"size":2041567232,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:038327e7947f326c17d277ce8267f76bb0396729&amp;dn=Loca+obsesion+%5BBRSCREENER%5D%5BXvid%5D%5BSpanish%5D%5Bwww.PorTorrent.com%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Morck22","files":1,"time":1265456205,"description":"\n \n\nTÃƒÂ­tulo original: All about Steve. DirecciÃƒÂ³n: Phil Traill. PaÃƒÂ­s: USA. AÃƒÂ±o: 2009. DuraciÃƒÂ³n: 101 min. GÃƒÂ©nero: Comedia romÃƒÂ¡ntica. InterpretaciÃƒÂ³n: Sandra Bullock (Mary Horowitz), Bradley Cooper (Steve), Thomas Haden Church (Hartman Hughes), Ken Jeong (Angus), DJ Qualls (Howard), Keith David (Corbitt), Howard Hesseman (Sr. Horowitz), Beth Grant (Sra. Horowitz), Katy Mixon (Elizabeth). GuiÃƒÂ³n: Kim Barker. ProducciÃƒÂ³n: Sandra Bullock y Mary McLaglen. MÃƒÂºsica: Christophe Beck. FotografÃƒÂ­a: Tim Suhrstedt. Montaje: Rod Dean y Virginia Katz. DiseÃƒÂ±o de producciÃƒÂ³n: Maher Ahmad. Vestuario: Gary Jones. Distribuidora: Hispano Foxfilm. Estreno en USA: 4 Septiembre 2009. Estreno en EspaÃƒÂ±a: 5 Febrero 2010. Apta para todos los pÃƒÂºblicos.\n\nSinopsis\n\nSandra Bullock, Thomas Haden Church y Bradley Cooper protagonizan la historia de una mujer que, tras enamorarse perdidamente de un hombre, piensa que por fin ha encontrado a su gran amor; desafortunadamente, Ã‚Â¡ÃƒÂ©l cree que ella le estÃƒÂ¡ acosando! Para Mary, nada es normal, sobre todo su relaciÃƒÂ³n con los demÃƒÂ¡s. Cuando le organizan una cita a ciegas con el apuesto operador de cÃƒÂ¡mara Steve, Mary cree que la quÃƒÂ­mica entre ellos es evidente y que Steve es %u201CÃƒÂ©l%u201D. Steve, por otro lado, piensa que Mary estÃƒÂ¡ loca. Mary, absolutamente segura de haber encontrado a su alma gemela, decide hacer lo que haga falta para estar con ÃƒÂ©l. Comienza a perseguirle sin descanso mientras Steve recorre el paÃƒÂ­s cubriendo las noticias de la actualidad. La progresiva obsesiÃƒÂ³n de Mary con Steve es fomentada por la conducta egoÃƒÂ­sta del reportero Hartman Hughes, que disfruta torturando a su arrogante operador de cÃƒÂ¡mara cada vez que tiene ocasiÃƒÂ³n. Con Mary pisÃƒÂ¡ndole los talones y Hartman animÃƒÂ¡ndola a ello, Steve cada vez estÃƒÂ¡ mÃƒÂ¡s alterado. Pero cuando Mary resulta implicada en la noticia del aÃƒÂ±o, Steve y Hartman empiezan a mirarla con otros ojos.\n","torrent":{"xt":"urn:btih:038327e7947f326c17d277ce8267f76bb0396729","amp;dn":"Loca+obsesion+%5BBRSCREENER%5D%5BXvid%5D%5BSpanish%5D%5Bwww.PorTorrent.com%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"038327e7947f326c17d277ce8267f76bb0396729","infoHashBuffer":{"type":"Buffer","data":[3,131,39,231,148,127,50,108,23,210,119,206,130,103,247,107,176,57,103,41]},"announce":[],"urlList":[]}}