{"title":"The Ramones - Blitzkrieg Bop (Live-Beat Club) (2nafish)","uid":5232717,"size":72491012,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:04aee5c61f32b10941015b21a230df3989a9d99b&amp;dn=The+Ramones+-+Blitzkrieg+Bop+%28Live-Beat+Club%29+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":1,"time":1261400847,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Blitzkrieg Bop&quot; is a song by punk rock band The Ramones. The band's inaugural single, it was released in April 1976 in the United States. It was recorded for and appeared as the lead track on the band's first album, Ramones, also released that month.\n\nThe song, whose composition was credited to the band as a whole, was written by bassist Dee Dee Ramone (lyrics) and drummer Tommy Ramone (music and lyrics). Based on a simple three-chord pattern, &quot;Blitzkrieg Bop&quot; opens with the chant &quot;Hey! Ho! Let's go!&quot;. The song is popular at sporting events where &quot;Hey! Ho! Let's go!&quot; is sometimes shouted as a rallying cry.\n\n&quot;Blitzkrieg Bop&quot; is number 92 on the Rolling Stone list of The 500 Greatest Songs of All Time. In March 2005, Q magazine placed it at number 31 in its list of the 100 Greatest Guitar Tracks, and in 2008 Rolling Stone Placed it number 18 on top 100 of Best Guitar Songs of All Time. In 2009 it was named the 25th greatest hard rock song of all time by VH1.\n\n&quot;Blitzkrieg Bop&quot; was named after the German World War II tactic blitzkrieg, which literally means &quot;lightning war&quot;. The song was mainly written by drummer Tommy Ramone, while bassist Dee Dee Ramone came up with the title (the song was originally called &quot;Animal Hop&quot;). Dee Dee also changed one line: The original third verse had the line &quot;shouting in the back now&quot;, but Dee Dee changed it to &quot;shoot 'em in the back now&quot;. The precise meaning and subject matter of the song are, unlike many of The Ramones' other early compositions, somewhat vague and obscure. It may be a reference to attacking the exposed flank of tanks during a blitzkrieg operation, while some fans contend, based on lines such as &quot;Shoot 'em in the back now&quot;, that the song tells of gang violence, which would seem to be more in line with the bands' other songs of that era. But it is more likely that the song is simply about having a good time at a concert, perhaps an ode to early punk fans.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:04aee5c61f32b10941015b21a230df3989a9d99b","amp;dn":"The+Ramones+-+Blitzkrieg+Bop+%28Live-Beat+Club%29+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04aee5c61f32b10941015b21a230df3989a9d99b","infoHashBuffer":{"type":"Buffer","data":[4,174,229,198,31,50,177,9,65,1,91,33,162,48,223,57,137,169,217,155]},"announce":[],"urlList":[]}}