{"title":"FantasyDVDPlayerPlatinum9.9.5B0318","uid":5446982,"size":6897476,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:053df99e3dc9445989e5ef353424a55b234f3ec1&amp;dn=FantasyDVDPlayerPlatinum9.9.5B0318&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rentoulisai","files":2,"time":1269052809,"description":"FantasyDVD is a exquisite and powerful software DVD player. Have with the same features and controls of the living- room DVD player and support over 70 type video and audio media files. Support the ts, tp, trp mpeg2 HDTV, wmv HDTV and mkv, mka, mks formats HDTV. Its advanced video and audio technologies deliver the highest quality viewing and listening experience possible on the PC. FantasyDVD has a perfect DVD navigation system, rich audio and video effects, is stable and easy use, and can meet all the demands of DVD playing. FantasyDVD automatically determines the type of disc in your DVD drive and uses the correct playback method for DVD titles, video CDs, or audio CDs. Play at normal speed, or fit the movie into the time you have available to watch it! Time stretching lets you decide how long the movie takes to view. If a DVD has it, FantasyDVD can handle it. FantasyDVD recognizes all of the author's DVD features and lets you access them through the FantasyDVD user interface.\n\nWhether watching DVD movies on your laptop as you travel, using your computer as a second DVD player for your kids or watching a movie on your desktop as you work, FantasyDVD lets you get the most out of any computer with a DVD drive. In addition to all the features you find in your home entertainment DVD player, FantasyDVD gives you advanced functionality not possible on your living room DVD player, such as time-stretching, zooming and panning and thumbnail bookmarks. FantasyDVD allows you to customize your video and audio preferences for a personalized movie watching experience.\nSupports 2 - 7.1 channel audio output, dolby ProLogic, Dolby ProLogicII and SRS TruSurround XT audio output mode. Supports Low frequency effect (LFE), High frequency effect (HFE), 10 Band Equalizer, EchoDelay etc.s expansion function.\n\nFantasyDVD automatically determines the type of disc in your DVD drive and uses the correct playback method for DVD titles, video CDs, or audio CDs. Play at normal speed, or fit the movie into the time you have available to watch it! Time stretching lets you decide how long the movie takes to view. If a DVD has it, FantasyDVD can handle it. FantasyDVD recognizes all of the author's DVD features and lets you access them through the FantasyDVD user interface.\n\nFantasyDVD includes the following main features:\n\nOptimize functions:\nOptimized for most updated CPUs and fully support MMX command sets for INTEL MMX, SSE, SSE2, AMD 3DNOW, 3DNOW PRO and has incorporated many up-to-date technologies like video hardware decode acceleration to endure high resolution picture playback.\nAdvance core decoding algorithms: Utilize the new high performance CPU's capacity to reduce the blocky effect for obtaining the better video quality.\nHardware decode acceleration enabling use of hardware moving compensation provided with VGA card.\nOffer high strength smooth playback by removing screen burrs and dithering.\n\nUniversal Player:\nTo increase the compatibility with other video file format, FantasyDVD now supports the playback of Real Player file and even WMV-HD. which means FantasyDVD is able to playback a broad band of various video file format.\nSupports DivX, DVD (MPEG-2), VCD (MPEG-1), SVCD, AudioCD, MiniDVD, Mpeg2 HDTV, MWV-HDTV formats and over 70 type other video and audio media files.\n\nPerfect playback control:\nNavigation slider allows a direct and instantaneous link to any scene.\nFantasyDVD lets you save the location of your favorite scenes, so that you can jump right to them. You can even create bookmarks at the beginning of each title chapter. FantasyDVD automatically remembers the last viewed location of a DVD.\nBroken-point Recording Function: With this function you are at your pleasure to setup broken point to watch what you are interested and replay automatically.\nTitle repeat, chapter repeat, AB repeat function that lets you set your favorite scenes for instant repeat.\n\nRich Audio Effect:\nFeatures Multi-channel Environment Impression technology , an audio channel expansion technology that converts stereo sound to a multiple-channel output.\nSupports 2 - 7.1 channel audio output, dolby ProLogic, Dolby ProLogicII and SRS TruSurround XT audio output mode.\nSupports Low frequency effect(LFE), High frequency effect(HFE), 10 Band Equalizer, EchoDelay etc.s expansion function, according to own habit changes sound effect.\nSupports video/audio synchronization regulate, Make video/audio synchronize.\n\nRich Video Effect:\nFantasyDVD's improved color controls are like those on a standard television set. No more confusing settings. Everything is straightforward and easy to use.\nSmart aspect ratio, 4:3, 16:9, 1.66:1, various stretch, make you enjoy the DVD or media files and can acquire the best visual effect regardless.\nDigital zoom at 2X to 10X equipped with location indicator. zoom closer into the viewing area. Pan around within the zoomed are to see exactly what you want to see at exactly the level of detail you want to see it.\n\nTime Stretch (Playback Speed):\nThe time stretch feature helps you fit your movies into your schedule. For example, if you are viewing a title and need to be done at a certain time, you can speed up the playback slightly so that the title has completed by the best time for you. You can also slow the title playback down slightly in order to watch for details. With FantasyDVD's time stretching, you don't lose any of the of audio. Even with a play speed change, stereo is crisp and clear.\n\nPlay DVD Content from a Hard Drive:\nFantasyDVD lets you view DVD content stored on a device such as a hard drive or NAS appliance. Simply select the drive, folder, and the name of the .ifo (DVD format) file to begin playback. Select the folder containing the content, or create playlists containing all your personal DVD favorites.\n\nPlaying AudioCD:\nWhy change players when you change discs? Play audio and video CDs with FantasyDVD. FantasyDVD detects the type of disc inserted into the drive and chooses the correct type of play. Full audio support is included with your FantasyDVD.\n\nImage Capture:\nCapture still images of your favorite movies with the click of a button. Click once, and the current image is captured.\n\nFantasyDVD Support the following media types:\nDVD Audio Files (*.ac3;*.dts;*.dtswav).\nDVD Audio Object Files (*.aob).\nDVD Video Object Files (*.vob).\nGZ-MC Music Files (*.mod;*.mdz;*.stm;*.stz;*.s3m;*.s3z;*.it;*.itz;*. xm;*.xmz;*.mtm).\nMPEG Video Files (*.mpg;*.mpeg;*.mpe).\nRealOne Media Files (*.ra;*.rpm;*.rm;*.rmvb;*.ram;*.rpx;*.rt;*.rp;*.sm i;*.smil).\nMPEG1 Audio Files (*.mp1;*.mp2;*.mp3;*.mpa).\nMPEG1 Video Files (*.m1v).\nMPEG2 Video Files (*.m2p;*.m2v).\nMPEG2 HDTV Files (*.ts;*.tp;*.trp).\nMPEG4 Video Files (*.mp4;*.div;*.divx;*.avi).\nWindows Media Files (*.wm;*.wma;*.wmv).\nMIDI Music Files (*.midi;*.mid;*.rmi;*.kar).\nWaveform Audio Files (*.wav).\nOGG Audio File (*.ogg;*.ogm).\nAU Media Files (*.au;*.snd).\nAIFF Media Files (*.aif;*.aifc;*.aiff).\nFLAC Audio Files (*.flac).\nMatrosky Files (*.mkv;*.mka;*.mks).\nMonkey's Audio Files (*.ape;*.apl;*.mac).\nVideoCD Files (*.dat).\nPicture Files (*.bmp;*.jpg;*.gif).\n\nFeatures and improved of include:\n* Add MPEG2 HDTV Files (*.ts;*.tp;*.trp) Supports. Add X264 format Support.\n* Add Microsoft HDTV Files (*.wmv) Supports (need the windows media player 9.0 or Higher).\n* Supports 2 - 7.1 channel sound cards and output on up to 7.1 discrete audio channels.\n* Supports Surround/ProLogic, Dolby ProLogicII Audio Mode, Certified Dolby Virtual Speaker technology allows you to experience virtual surround sound through 2 speakers.\n* Supports TruSurroundXT(tm) Headphone, based on SRS TruSurroundXT technology, provides an optimized headphone environment. It features TruSurround, Dialog Clarity Enhancement, and TruBass technologies that bring virtual surround and virtual bass experiences to your headphones.\n* Special 10 Band Equalizer for DVD playback. Supports True Bass  Treble Enhancer. Supports virtual space effect and virtual environment effect.\n* Add Mouse Wheel and keyboard control.\n* Fixed problem in exterior subtitle, supports unicode.\n* Optimized and improved operation of user interface. Supports Dynamic Skins.\n* Add multi-language supports.\n* Improvement and optimizations with antivirus software compatibility.\n* Improvement and optimization with windows vista32/64 compatibility.","torrent":{"xt":"urn:btih:053df99e3dc9445989e5ef353424a55b234f3ec1","amp;dn":"FantasyDVDPlayerPlatinum9.9.5B0318","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"053df99e3dc9445989e5ef353424a55b234f3ec1","infoHashBuffer":{"type":"Buffer","data":[5,61,249,158,61,201,68,89,137,229,239,53,52,36,165,91,35,79,62,193]},"announce":[],"urlList":[]}}