{"title":"John Fogerty - When Will I Be Loved  (2nafish)","uid":5204945,"size":95219716,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:06d4e7cdedee7915dbb0d3a0584de372c6a522dc&amp;dn=John+Fogerty+-+When+Will+I+Be+Loved++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1260333021,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;When Will I Be Loved&quot; is a popular song, written by Phil Everly, and recorded by The Everly Brothers, Don and Phil.\n\nIt was covered by Linda Ronstadt on her chart-topping Double Platinum album Heart Like A Wheel. Her version went to #1 on Billboard's Country chart and #2 on the Billboard Hot 100 chart, topping the Everly Brothers' original version, which peaked at #8 on that chart. It is Ronstadt's version that has made the track a modern day classic.\n\nA version sung by Vince Gill was included in the 1994 movie 8 Seconds.\n\nIt was covered on the ABC television show According to Jim by Jim Belushi's daughter Jamison Belushi\n\nIn the Magnum, P.I. season 5 episode &quot;Let Me Hear the Music,&quot; country singer Amanda McBroom does a live performance based on Linda Ronstadt's arrangement of the song.\n\nJohn Fogerty recently covered the song with Bruce Springsteen providing additional vocals. It is included on his 2009 album, The Blue Ridge Rangers Rides Again, which was released on August 31, 2009.\n\nThe Blue Ridge Rangers Rides Again is a studio album by American swamp rock singer-songwriter and guitarist John Fogerty, first released on August 25, 2009, by Verve Forecast Records.\n\nOriginally announced in December 2008, the album was then titled The Return of the Blue Ridge Rangers and was slated for release by Fantasy Records, the label Fogerty recorded for with Creedence Clearwater Revival and his 2007 &quot;comeback&quot; album Revival. The album shares similarities in style with Fogerty's first solo album The Blue Ridge Rangers and included auto-remake of a song from Eye of the Zombie album.\n\nThe album was recorded at Village Recorders in Santa Monica, California, in a 10-day session. Included in the group were Buddy Miller, Greg Leisz, Dennis Crouch, Jay Bellerose and Kenny Aronoff. It was recorded mostly at Berkeley Street Studios in Santa Monica, California. Beginning tracks started last October at Village Recorders in Santa Monica with Mike Piersante (Engineer). Additional sessions occurred with special guests, Bruce Springsteen and The Eagles' Don Henley and Timothy B. Schmit.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt; \n\n","torrent":{"xt":"urn:btih:06d4e7cdedee7915dbb0d3a0584de372c6a522dc","amp;dn":"John+Fogerty+-+When+Will+I+Be+Loved++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06d4e7cdedee7915dbb0d3a0584de372c6a522dc","infoHashBuffer":{"type":"Buffer","data":[6,212,231,205,237,238,121,21,219,176,211,160,88,77,227,114,198,165,34,220]},"announce":[],"urlList":[]}}