{"title":"Clinic - Do It! (2008) [EAC Wavpack]","uid":5352317,"size":245249732,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:07b1e86004b3c084a1604e84fb5906726fc515b5&amp;dn=Clinic+-+Do+It%21+%282008%29+%5BEAC+Wavpack%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":32,"time":1265823481,"description":"Review by Heather Phares\n\nClinic chug along like a coal-burning engine churning out thick black smoke on Do It!, working further into their cryptically dour art-punk/psych/soul/folk niche. Granted, that's a pretty specific niche, but as on their previous album, Visitations, it feels more like a groove than a rut. More than most bands, Clinic write songs in styles, and Do It! features most of their quintessential types: the excellent &quot;Corpus Christi&quot; is a menacing, whispery slow-burner like Walking with Thee's &quot;Come into Our Room&quot; before it, with a singsong lilt that makes it all the creepier; &quot;Emotions&quot; is one of Clinic's soulful ballads, this time boasting a thick fuzz bassline that runs through the song like a scratch; and &quot;Shopping Bag&quot; is this album's version of the band's noise-punk outbursts, now with a shrieking saxophone solo. While Do It! doesn't abandon Clinic's well-defined sound and approach, it does underscore how they innovate within their self-imposed limitations, even if they don't make radical changes. Almost suffocating distortion is one of Do It!'s main motifs, along with songs that swing from mood to mood rapidly. &quot;Memories&quot; uses both, shifting from heavy, ugly, deeply acidic psych-garage riffs to melancholy organs and autoharps as Ade Blackburn intones &quot;Memories are all you own&quot; (though it sounds more like he's singing &quot;Memories are all you're on,&quot; comparing thoughts to drugs ÃƒÂ  la the Electric Prunes' &quot;I Had Too Much to Dream Last Night&quot;). &quot;Free Not Free&quot; is nearly as trippy, jumping between brash riffs and mellow flutes while setting lyrics like &quot;when the hoax is in the mirror&quot; to one of the album's prettiest melodies. All of this is to say that despite Do It!'s direct name, Clinic are as elliptical as ever. They're rarely better than when they're telling someone off, even if they do it so cryptically that the feeling is the only thing that translates. &quot;High Coin&quot; sounds like the perfect soundtrack to skewering a voodoo doll, its sinister organ drones giving words such as &quot;You stitch who you always wanted/Now your thoughts begin to fray&quot; an extra malice. Visitations' elaborately dark atmosphere gets more focus on Do It!, with &quot;Tomorrow&quot;'s creaky, cranky acoustics and &quot;Mary and Eddie&quot;'s electronically enhanced steamboat shanty providing some of the spookiest, and best, moments. It all culminates on &quot;Coda,&quot; where Blackburn  explains that the album is a celebration of &quot;the 600th anniversary of the Bristol Charter&quot; and urges listeners to &quot;let go of the rail&quot; (probably not a good idea) as several chapels' worth of church bells ring out. Do It! finds Clinic getting curiouser and curiouser, but that's the direction that suits them best. ","torrent":{"xt":"urn:btih:07b1e86004b3c084a1604e84fb5906726fc515b5","amp;dn":"Clinic+-+Do+It%21+%282008%29+%5BEAC+Wavpack%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07b1e86004b3c084a1604e84fb5906726fc515b5","infoHashBuffer":{"type":"Buffer","data":[7,177,232,96,4,179,192,132,161,96,78,132,251,89,6,114,111,197,21,181]},"announce":[],"urlList":[]}}