{"title":"vista icons","uid":5265200,"size":469692,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:07e0b627c2f69694758d04272dd2c3d5b3b819fb&amp;dn=vista+icons&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bokasimon","files":1,"time":1262869680,"description":"vista icons\n\nLicense Agreement\n\n\nThis is a legal agreement between You, the purchaser, and INCORS GmbH\n(&quot;INCORS&quot;). By downloading any icons from this website, you agree to be bound\nby the terms of this agreement.\n\nAll ownership and copyright of the licensed icons remain the property of\nINCORS. INCORS grants to you a nonexclusive, non-sublicensable right to use\nthe icons royalty-free according to the license terms for any commercial or\npersonal design and software projects. You may also display the icon in\nrelated documentation, help files, and advertising materials.\n\nYou may modifiy the icons is shape, color, and/or file format and use the\nmodified icons royalty-free according to the license terms for any commercial\nor personal design and software projects. You may also display the modified\nicon in related documentation, help files, and advertising materials.\n\nYou may not lease, license or sub-license the icons, or a subset of the icons,\nor any modified icons to any third party unless they are incorporated into\nyour own software or design products, which do not compete directly with the\nIconExperience icon collections.\n\nAll icon files are provided &quot;As is&quot; without warranties of merchantability and\nfitness for a particular purpose. You agree to hold INCORS harmless for any\nresult that may occur during the course of using the licensed icons.\n\nThis License Agreement shall be governed and construed in accordance with the\nlaws of Germany. No choice of law rules of any jurisdiction will apply. If any\nprovision of this License Agreement is held to be unenforceable, this License\nAgreement will remain in effect with the provision omitted.\n      ","torrent":{"xt":"urn:btih:07e0b627c2f69694758d04272dd2c3d5b3b819fb","amp;dn":"vista+icons","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07e0b627c2f69694758d04272dd2c3d5b3b819fb","infoHashBuffer":{"type":"Buffer","data":[7,224,182,39,194,246,150,148,117,141,4,39,45,210,195,213,179,184,25,251]},"announce":[],"urlList":[]}}