{"title":"Onimusha - Blade Warriors [Ntsc], Ps2","uid":5390476,"size":636552983,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:086114fb5df9983e570668c021df0df348311eb2&amp;dn=Onimusha+-+Blade+Warriors+%5BNtsc%5D%2C+Ps2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Big_dude","files":-1,"time":1267044196,"description":"Onimusha - Blade Warriors for the Ps2                               Rel. 03/23/2004\n\n\nFormat:        DVD5 NTSC-USA\nLang.:         English\nDiscs:         1\nImage:         MDS/ISO\nGenre.:        3D Fighting\nRating:        T (Teen)\nRequirements:  Modded/Chipped Ps2 or Swap Magic Disc Method. \n\n\nCompressed with 7Zip, Game was tested and works.\n\n\nNote: No Ps2 backup disc/game or copy will work unless your Ps2 Console is Modded \n      (allows playing of backups), or if you use Swap Magic.\n\n\nYou could try the homebrew exploit to (Free Mc Boot - Also known as soft modding for ps2), if your ps2 system isn't hard modded with a chip or if Swap Magic isn't working as a last resort. There are ps2 emulators but its not 100% &amp; the quality isn't as good as playing your game on your ps2 console.\n\nIf your using swap magic and don't have a flip top, you'll need to first\nremove the front cover of the disc tray for use of the slide card.\n\nHere's a link for how to remove the front cover...\n          &lt;a href=&quot;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&lt;/a&gt;\n\nAnd here's some links on using the slide tool to open the tray to swap in your ps2 copy or backup game.\n          &lt;a href=&quot;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&lt;/a&gt;\n         &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&lt;/a&gt;\n         &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&lt;/a&gt;\n\nThose that don't have a modded Ps2 Here's a few links for Free MC Boot &amp; how to use it to soft mod your ps2 so you can be able to play burned games. Free Mc Boot won't work on newer models of ps2 you'll have to use an older version the tutorial explains this.\n\n-- &lt;a href=&quot; http://bootleg.sksapps.com/tutorials/fmcb/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bootleg.sksapps.com/tutorials/fmcb/&lt;/a&gt;\n\nThen you will also need to patch the iso (the PS2 game) with ESR disc patcher GUI v0.24a if your using free mc boot with ESR Elf to boot your p2 copies or backups (No-swapping required for esr method).\n\nAfter patching burn the iso with Imgburn or Dvd Decrypter to respectable media\nthen use the ESR through fmcb after you installed everything to boot your game.\n\nYou will still need to use the proper media for the game to run or load properly regardless if your using fmcb, a modded ps2, or swap magic. Verbatim or Taiyo Yuden is preferred.\n\nNote: If fmcb isn't working and your Ps2 isn't Modded, Swap Magic should do the\ntrick.\n\n\nGame Description:\n\nOnimusha Blade Warriors is a multi-player fighting game based on the first two games of the Onimusha series. Familiar elements taking from the Onimusha games include the medieval Japanese settings, the characters, items, and the ability to absorb souls in order to perform a magical attack. Fourteen characters are available initially, but a total of twenty-four can be unlocked over the course of play, including long-time Capcom superstars Mega Man and Zero. With the addition of items and weapons strewn around the battle field which characters can pick up to aid in battle, gameplay is aptly compared to one of Capcom's other fighting franchises, Power Stone.\n\nNow, Samanosuke, star of Onimusha Warlords can go head-to-head with Jubei from Onimusha 2: Samurai's Destiny! Fight alone or with up to three others for lightning fast multi-player battles that show off your skills as the ultimate warrior. \n\n\nFeatures:\n\n* Play as your favorite hero or turn to the dark side and fight as the enemy.\n\n* 24 unlockable characters including special surprise guests.\n\n* Over-the-top 4-player battles.\n\n* The blockbuster Onimusha series enters into a new gaming genre: 3-D Fighting.\n\n* Choose from among the mighty characters from the Onimusha series and master \n  intense head-to-head battles of epic proportions.\n\n* Fight in beautiful interactive backgrounds, lifelike worlds with cool fighting \n  effects.\n\n* Customize your characters powers, strengthen your equipment and boost your Genma\n  power.\n\n* 4 modes of play: Story, Fighting, Mini-Game and Practice.\n\n\n\nGame Pics Included.\n\n\nBurn with DVD Decrypter, (Included in download).  \n\nBurn at 8x or 4x Speed.\n\nUse Verbatim or Taiyo Yuden DVD Media for best quality, or if other media isn't \nworking.\n\n\nIf Using DVD+R booktype to DVD-ROM.\n(If your Mod-Chip or Ps2 doesn't support DVD+R)\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\n\nEnjoy!\t\t","torrent":{"xt":"urn:btih:086114fb5df9983e570668c021df0df348311eb2","amp;dn":"Onimusha+-+Blade+Warriors+%5BNtsc%5D%2C+Ps2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"086114fb5df9983e570668c021df0df348311eb2","infoHashBuffer":{"type":"Buffer","data":[8,97,20,251,93,249,152,62,87,6,104,192,33,223,13,243,72,49,30,178]},"announce":[],"urlList":[]}}