{"title":"Cheap Impostor v3.2.2 [IsolatedSoul5591]","uid":5355921,"size":260999,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:08f24e2d41c790d0c3716601c39b90991f2b8c60&amp;dn=Cheap+Impostor+v3.2.2+%5BIsolatedSoul5591%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Iso_Soul","files":2,"time":1265941156,"description":"Product Description:\nCheap Impostor... If you want to use your computer to make a book or a magazine, the final step before printing is called imposition. Cheap Impostor is a simple yet powerful alternative to fancy imposition software. It doesn't offer all the features of high-end imposition software (which costs hundreds or thousands of dollars). Hence the name.\nHowever, if you want to print and bind booklets, magazines, or even long books, this program might be all the imposition software you need.\nWhat does it do? Let's say you want to make a magazine from a document you've written. You would like to have the magazine be the size of a sheet of paper folded in half. Without imposition software the simplest way to transform your document into a magazine would be to use a photo-copier to shrink and re-order the pages so two fit sideways on a sheet of paper, and so that when a stack of them is stapled and folded in half the pages appear in the correct order.\nThe short story is that Cheap Impostor lets you skip the photocopier step, and produce output from your printer that can directly be turned into a magazine. Further, Cheap Impostor has settings that let you create books with multiple signatures. It comes with a simple &quot;How-to guide&quot;.\n\nFeature overview:\nTakes 1-up PDF input and produces 2-up output PDF\nReorders pages for magazines and books (sheets per signature can be varied from 1 to page-count / 4\nSupports automatic and manual duplex printers, with and without collation\nWith shareware registration, supports:\nVariable output page sizes: letter, legal, ledger, A3, A4, custom\nControl over page zoom and horizontal and vertical offset of 2-up - accommodates variable input page sizes.\n\nWhat's New?\n--&gt; Default window location and size saved with &quot;Save Preferences&quot;\n--&gt; Manual duplex now saves and opens two PDF files for separate printing\n--&gt; Advanced preferences button easier to see\n\nInstallation:\n--&gt; Open folder &amp; mount dmg\n--&gt; Drag app to your applications folder\n--&gt; Register with serials provided in .txt file\n--&gt; Done!\n\nNote- I removed the Nag screen from the program (it would appear even after registration) and I removed the black-listed serials so you can use them again! :D\n\nENJOY!! \n--&gt; IsolatedSoul5591","torrent":{"xt":"urn:btih:08f24e2d41c790d0c3716601c39b90991f2b8c60","amp;dn":"Cheap+Impostor+v3.2.2+%5BIsolatedSoul5591%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08f24e2d41c790d0c3716601c39b90991f2b8c60","infoHashBuffer":{"type":"Buffer","data":[8,242,78,45,65,199,144,208,195,113,102,1,195,155,144,153,31,43,140,96]},"announce":[],"urlList":[]}}