{"title":"Bad English - Price Of Love  (2nafish)","uid":5348058,"size":161226756,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:0a2f53a3f8786838e539221623c7558fbcbc55d5&amp;dn=Bad+English+-+Price+Of+Love++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1265708668,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\nBad English was an American rock band supergroup formed in 1988, reuniting keyboardist Jonathan Cain with singer John Waite and bassist Ricky Phillips, his former bandmates in The Babys.\n\nThe members decided on a name for the band while playing pool. John Waite missed a shot and Jonathan Cain made a comment on how bad his &quot;english&quot; was (referring to the spin a player puts on the cue ball) and the band decided to use the phrase.\n\nJonathan Cain and guitarist Neal Schon, who had enjoyed enormous success in Journey, continued on to form Bad English with Waite after Journey disbanded. The first album, eponymously titled, was a big seller with three hit singles, including the number one hit &quot;When I See You Smile&quot; written by Diane Warren, the top 10 hit &quot;Price of Love,&quot; and &quot;Possession.&quot; Another track from the debut album, the AOR song &quot;Best of What I Got&quot;, was featured in the soundtrack to 1989's Tango and Cash.\n\nThe band's second album, 1991's &quot;Backlash&quot; came and went without any fanfare. The only single, &quot;Straight To Your Heart,&quot; just missed the Top 40, peaking at #42. Ricky Phillips writes on his website that the group had parted company before the second album had been mixed. Both Phillips and guitarist Neal Schon expressed frustration with the &quot;pop&quot; side of the bands songs and wanted a harder edge. In the end, it proved to be the band's undoing as everyone left to pursue other projects.\n\nIn later interviews Waite revealed that although he loved playing to stadium-sized audiences, he was uncomfortable with the corporate rock image that he felt the band had presented and has been a solo artist ever since.\n\nBad English drummer Deen Castronovo later went on to join a reformed Journey with singer Steve Augeri, Neal Schon, Jonathan Cain, and Ross Valory. He also played on Ozzy Osbourne's album Ozzmosis in 1995.\n\nBad English is the self-titled platinum-selling debut album by American rock supergroup Bad English, released in 1989.\n\nThe band scored two huge hits on the Billboard charts including the #1 hit &quot;When I See You Smile&quot; and #5 hit &quot;Price of Love&quot;. In all, five singles were officially released from the album, all charting on the Hot 100.\n\nFirst single &quot;Forget Me Not&quot; was a major hit at rock radio, spending two weeks at #2 on the Mainstream Rock Tracks chart, but it narrowly failed to hit the pop Top 40. The second single was the Diane Warren-penned power ballad &quot;When I See You Smile&quot;, which was a massive multiformat hit, spending two weeks at #1 on the Hot 100, two weeks in the top 10 at rock radio, and getting significant and sustained play at Adult Contemporary radio. But &quot;When I See You Smile&quot; lingered in the pop Top 40 and was still climbing the Adult Contemporary charts, and close to being certified Gold, long after the song had peaked at rock radio. When the decision was made to release a second consecutive power ballad as the album's third single (&quot;Price of Love&quot;), the band released the stomper &quot;Best of What I Got&quot; as a promo to U.S. rock radio, hoping to maintain interest and credibility with the rock audience for their live headlining tour. The plan worked, as &quot;Price of Love&quot; hit the pop top five but didn't receive enough rock radio airplay to hit the 40-place Rock Tracks chart, while &quot;Best of What I Got&quot; surged to #9 there (the band's second-highest showing on that chart), and the band was invited to join the Whitesnake tour beginning in the spring for a second jaunt around the U.S.\n\nA five-video collection was released, containing the music videos for &quot;Best of What I Got&quot;, &quot;Heaven is a 4 Letter Word&quot;, &quot;Forget Me Not&quot;, &quot;When I See You Smile&quot;, and &quot;Price of Love&quot;.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:0a2f53a3f8786838e539221623c7558fbcbc55d5","amp;dn":"Bad+English+-+Price+Of+Love++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a2f53a3f8786838e539221623c7558fbcbc55d5","infoHashBuffer":{"type":"Buffer","data":[10,47,83,163,248,120,104,56,229,57,34,22,35,199,85,143,188,188,85,213]},"announce":[],"urlList":[]}}