{"title":"Fleetwood Mac - Go Your Own Way  (2nafish)","uid":5245854,"size":240015364,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:0a86d622974efb8f24136f0bb77d01a48f2f6b2c&amp;dn=Fleetwood+Mac+-+Go+Your+Own+Way++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1261985484,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nFleetwood Mac - Go Your Own Way (taken from the PBS series: Soundstage)(Live In Boston) (2nafish)\n\n\n&quot;Go Your Own Way&quot; is a song written by Lindsey Buckingham and performed by Fleetwood Mac. It was the first single to be released from their successful album, Rumours and peaked at number ten on the Billboard Hot 100. It is ranked number 119 on Rolling Stone's list of the 500 Greatest Songs of All Time and is on The Rock and Roll Hall of Fame's 500 Songs that Shaped Rock and Roll list.\n\nBuckingham wrote this song with regard to his bandmate Stevie Nicks, with whom he had just ended a romantic relationship. It describes their breakup, with the most obvious line being, &quot;Packing up, shacking up is all you want to do.&quot; Nicks insisted she never shacked up with anyone when they were together, and wanted Lindsey to take out the line, but he refused.\n\nRumours is the eleventh album by British and American rock band Fleetwood Mac, released in 1977. It was the second album recorded with this line-up, following the successful self-titled Fleetwood Mac album in 1975. In December 1976, prior to the release of the album, Reprise released the single &quot;Go Your Own Way&quot;. In 1978, Rumours won the Grammy Award for Album of the Year. As of 2009, the album has sold more than 40 million copies worldwide and is currently the 11th best-selling album of all time. In addition, Rolling Stone ranked Rumours at #25 on its list of the 500 greatest albums of all time.\n\n&quot;Go Your Own Way&quot; was believed by Nicks to be a gloomy reference to the break-up of their relationship, and she and Buckingham argued about it. &quot;Dreams&quot; was her attempt to be more optimistic. The song was the only U.S. number one hit for the group, and remains one of their best-known songs. &quot;You Make Loving Fun&quot; referred to an affair between Christine McVie and the group's lighting director. &quot;Gold Dust Woman&quot; was a reference to Stevie Nicks's own struggle with drugs. &quot;Don't Stop&quot; was written by Christine McVie after her divorce with John McVie, and it provided an optimistic outlook on their newly-separated lives.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:0a86d622974efb8f24136f0bb77d01a48f2f6b2c","amp;dn":"Fleetwood+Mac+-+Go+Your+Own+Way++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a86d622974efb8f24136f0bb77d01a48f2f6b2c","infoHashBuffer":{"type":"Buffer","data":[10,134,214,34,151,78,251,143,36,19,111,11,183,125,1,164,143,47,107,44]},"announce":[],"urlList":[]}}