{"title":"Soundtrack from the movie Gosford Park","uid":5233789,"size":122874001,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0b04ee07db94fa2bd55e9370a74fc52cb76fa19e&amp;dn=Soundtrack+from+the+movie+Gosford+Park&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mrizzo2","files":26,"time":1261439874,"description":"We prepared this torrent for you a year or so ago and never got around to seeding it back then given other pirorities.\n\nI want to thank you all tha have joined in with strong seeding support recently especially, on our karaoke torrents in particular. God bless! ts a great\nservice to humankind in what it is we do together.\n\n\nWe are going to try to get some robust seed into the 4.31 Michael Rizzo mp3 collection (we are still trying to stabilize it as we havent been on the torrent for a while and it appears &quot;asleep&quot; atthe moment as perhaps the peers havent shared enough recently although a warm thanks to those seeds that have faithfully been on the job here.\n\nIf you would like a great mp3 collection for your cafe &quot;jukebox&quot; disc player (DVD that plays mp3s for the most part) please join this seed of the 4.31GB mp3 collection and we'll try and get you seeded to a nice completion, with strong bandwidth support in hopes you are all willing to share all the way and beyond to the best you are able. merci!\n\n\nMichael Rizzo Chessman\n\nPS noone on one of our 4GB+ torrents should expect to be giving less than a constant 40k - 60k average and more if you have it to give. It otherwise takes too long to complete and some dont get their ssed in fair manner as not everyone is sharing appropriately - thats costs everyone. We really should have a constant 100k going into every peer thats on one of these torrents. That takes the efforts of all since seeders alone couldnt accomplish this fairly if you arent willing to give your bit too, to the fullest in fact! You reap what you sow! Thats especially true on our torrent system, youll find.\n","torrent":{"xt":"urn:btih:0b04ee07db94fa2bd55e9370a74fc52cb76fa19e","amp;dn":"Soundtrack+from+the+movie+Gosford+Park","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b04ee07db94fa2bd55e9370a74fc52cb76fa19e","infoHashBuffer":{"type":"Buffer","data":[11,4,238,7,219,148,250,43,213,94,147,112,167,79,197,44,183,111,161,158]},"announce":[],"urlList":[]}}