{"title":"Whore's Mascara - Monogamous  (2nafish)","uid":5353589,"size":139569156,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:0b742b80bd46d4dde0a5d06676a1a9c7b5787687&amp;dn=Whore%5C%27s+Mascara+-+Monogamous++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1265862703,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nIf the Pet Shop Boys and Madonna got together and had a drunken, explicit menage-a-trois, Whore's Mascara might sound like their lovechild.\n\nHeavily influenced by the 80s, this proud-to-be-Eurotrash band of lovers consists of the dark and brooding Brit Chaz Kourday, the Californian charmer Lonni Bahls, and the Aussie blonde bombshell Georgia Haege.\n\nSince they erupted onto the scene in July 2008, they've been spreading the seeds of lust all over New York and are gearing up for a much-anticipated European tour. If you haven't heard of them yet, brace yourselves; you're about to.\n\nThe music of Whore's Mascara has been described as &quot;post-electroclash neue wave eurotrash campy dirty dance party,&quot; and Michael Musto called them the &quot;sardonically fun underground band heading mainstream&quot; in his Village Voice column. \n\nWhore's Mascara has graced the stages of such NYC venues as Joe's Pub, Irving Plaza, The Gershwin Hotel, The Chelsea Hotel, The Mercury Lounge, The Zipper Factory, The Delancey, Luna Lounge, Don Hill's, Vlada, Piano's, Sugarland, The Javits Center, The Slipper Room, and The Ritz. They also won the 2008 Glammy Award for Best Duo or Group. \n\nProduced and co-written by master-beater Electronathan, Whore's Mascara's debut album LIKE THIS BUT SEXY is the perfect bedside companion, featuring lush electro-pop beats and over-the-top lyrics sure to seduce even the most elusive objects of desire. Witty and filthy, profane and profound, its 11 tracks take listeners on a mind-blowing journey through life's darkest crevices.\n\nIn October 2009, the band released MONOGAMOUS, their newest single. Their music video for MONOGAMOUS was directed by legendary fashion photographer Patrik Andersson (French, Italian, and American Vogue). \n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:0b742b80bd46d4dde0a5d06676a1a9c7b5787687","amp;dn":"Whore%5C%27s+Mascara+-+Monogamous++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b742b80bd46d4dde0a5d06676a1a9c7b5787687","infoHashBuffer":{"type":"Buffer","data":[11,116,43,128,189,70,212,221,224,165,208,102,118,161,169,199,181,120,118,135]},"announce":[],"urlList":[]}}