{"title":"CustomPlay.Golf.2010-SKIDROW","uid":5380030,"size":3025123241,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0b86c13a7675975c927d210e6e14727a8cc45eac&amp;dn=CustomPlay.Golf.2010-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"thenoobish","files":62,"time":1266700022,"description":"Eboy\n\nS   K   i   D   R   O   W\n\n-  T H E   L E A D i N G   F O R C E   -\n\nproudly presents\nCustomPlay Gold 2010 / CustomPlay Games Ltd.\n\nRELEASE DATE : 20-02-2010           PROTECTION : CustomPortal + Serial\nGAME TYPE    : Golf                 DISKS      : 1 DVD\n\nRelease Notes:\n\nThe Skid Rowdies are looking new blood to fill up the ranks.\nWere a professional team of dedicated sceners with big mark\nunder sceners. We believe on the ground idealism of the root\nof the real old school scene. We do all this for fun and\nnothing else. We dont earn anything on our hobby, as we do\nthis for the competition and the heart of what got the scene\nstarted in the mid eighties.\n\nIf you think you got something to offer, then dont hold back\non contacting us as soon as possible.\n\n\ntwice the fun   / double the trouble\n\n\nOn with the game release information:\n\nTwo years in the making, the team who created and developed\nCustomPlay Golf are back. With so few golf video games that\nactually hit the mark, CustomPlay 2010 is a hole in one\nexperience. Exploring true realism offering an all new physics\nengine that utilizes real-world data. Golf isnt simply a\ngame; its a way of life.\n\nCustomPlay Golf 2010 adds to the golfing experience with a\ngame packed with features that takes the player to a whole new\nlevel of both realism and game play. All new graphical effects\nincluding enhanced lighting and shadow systems for objects and\nterrain, normal map, detail map, mega-texture and more!\nPlayers will marvel at the stunning graphics, enhanced\nlighting and shadow system and more. The easy to play game\nmechanics will guarantee all of the thrills and drama on the\n18th hole.\n\nCourses and modes\n\nChampionship Golf - Plenty of full 18 holed licensed courses\navailable. Par3, Crazy Golf, Pitch and Putt, Mini Golf and of\ncourse the all important Range, perfect for honing that\nperfect swing.\n\nCustomisation\n\nWhether youre a seasoned pro or someone whos never attempted\nto design a course before, CustomPlay 2010s editor is sheer\nsimplicity to use. Not only are players able to create courses\nbut they can also customize their look and play style,\nallowing for the ultimate in gaming couture.\n\nNew game modes including Stableford, Practice, Nearest the\nPin, Longest Drive etc.\n\nImproved draw distance, allowing the entire course to be\ndisplayed in the distance.\n\nZero load times between holes.\n\nAll new characters and animations.\n\nReal-time passing of time - choose your tee time and watch\ntime fly!\n\nMultilingual version - available in English, French, German,\nSpanish, Italian  Russian\n\nAll new physics engine, using real-world data\n\nOver Twenty courses available, including real, licensed\ncourses\n\nNew trilling - Crazy Golf mode!\n\n\nInstall Notes:\n\n1. Unpack release\n2. Mount image or burn it\n3. Install\n4. Play the game\n\nAdditional Notes:\n\nWe have removed the lame CustomPortal installer, as it did\nrequire to verify the installer online, before being able to\ninstall and use the game.\n\nIf you want to play this nice golfer online - BUY IT!\n\nSupport the companies, which software you actually enjoy!\n\n\nGreetings:\n\nSalutes to our old Amiga friends from:\n\nFAIRLIGHT - RAZOR 1911 - VISION FACTORY - PARADOX - QUARTEX\nDCS - CRYSTAL - ZENITH - ACCESSION - ALPHA FLIGHT - PRODIGY\nTHE COMPANY - LEGEND - TRSI - ORACLE - ANTHROX - CLASSIC\n\nSalutes to our new friends in:\n\nUNLEASHED - TiNYiSO - BReWErS - RADIKAL - POSTMORTEM - SHOCK\nFAIRLIGHT - CRUDE - VACE - ReUnion - OUTLAWS - GENESIS\n\nLogo and layout by: Eboy/SAE\nLast updated 21/07/2007 by [XXX]","torrent":{"xt":"urn:btih:0b86c13a7675975c927d210e6e14727a8cc45eac","amp;dn":"CustomPlay.Golf.2010-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b86c13a7675975c927d210e6e14727a8cc45eac","infoHashBuffer":{"type":"Buffer","data":[11,134,193,58,118,117,151,92,146,125,33,14,110,20,114,122,140,196,94,172]},"announce":[],"urlList":[]}}