{"title":"Paul McCartney - Live and Let Die  (2nafish)","uid":5403946,"size":115933188,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:0cf136745808b23db9269cb42cec9fb2293ac1c0&amp;dn=Paul+McCartney+-+Live+and+Let+Die++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1267527413,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Live and Let Die&quot; is the main theme song of the 1973 James Bond film Live and Let Die and was performed by Paul McCartney and Wings on the movie soundtrack and on the soundtrack album. The song was one of Wings' most successful singles, and the most successful Bond theme to that point. Commissioned specifically for the movie and credited to Paul McCartney and his wife Linda, it reunited McCartney with Beatles producer George Martin, who both produced the song and arranged the orchestral break.\n\nAfter George Martin was hired to score the new James Bond film, Paul McCartney offered to compose the theme song, and Wings recorded a demo of &quot;Live and Let Die&quot;. However, Bond producer Harry Saltzman was interested in having an African American female artist perform it instead of Wings. Martin said that McCartney would only allow the song to be used in the movie if Wings were able to perform the song in the opening credits. Saltzman, who had previously rejected the chance to produce A Hard Day's Night, decided not to make the same mistake twice and agreed. A second version of the song, performed by B.J. Arnau, also appears in the film. The Arnau version of the song appears on the soundtrack album as a component in a medley that also contains two George Martin-composed instrumental pieces, &quot;Fillet of Soul - New Orleans&quot; and &quot;Fillet of Soul - Harlem&quot;.\n\nWings recorded &quot;Live and Let Die&quot; during the sessions for the Red Rose Speedway album. The single reached #2 in the U.S. and #9 in the U.K. Although McCartney's previous single, &quot;My Love&quot;, had been credited to &quot;Paul McCartney &amp; Wings&quot;, the label of the &quot;Live and Let Die&quot; single credited the performing artist simply as &quot;Wings.&quot; This is because the B-side of the single, &quot;I Lie Around&quot;, was not sung by Paul McCartney but instead sung by Wings guitarist Denny Laine. When the song made its first album appearance on the soundtrack album, however, the song was credited to &quot;Paul McCartney &amp; Wings&quot;. &quot;Live and Let Die&quot; was the last Paul McCartney single on Apple Records that was credited only to &quot;Wings&quot;.\n\nThe single and the soundtrack album also disagree on the composer credit. The single giving sole authorship to Paul McCartney, while the soundtrack album credits Paul &amp; Linda McCartney as the composer. In the 2001 documentary Wingspan, Paul revealed that Linda wrote the bridge section &quot;What Does It Matter To You...&quot;.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:0cf136745808b23db9269cb42cec9fb2293ac1c0","amp;dn":"Paul+McCartney+-+Live+and+Let+Die++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0cf136745808b23db9269cb42cec9fb2293ac1c0","infoHashBuffer":{"type":"Buffer","data":[12,241,54,116,88,8,178,61,185,38,156,180,44,236,159,178,41,58,193,192]},"announce":[],"urlList":[]}}