{"title":"Aurora Media Workshop w/key","uid":5397543,"size":12337152,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0d069ee7439e9a281f6ea9c69218dcc190284fa4&amp;dn=Aurora+Media+Workshop+w%2Fkey&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2mean2die","files":1,"time":1267291221,"description":"Aurora Media Workshop\n\nRequirements\n-------------------------------------------------------------------------\nCPU: Pentium 300MHz or better. \nMemory: 128M RAM. \nWindows 95,98,NT,2000,XP,2003.\n4Mb free disk space.\nASPI driver (comes with the installation package)\n\n\nVideo Converter, Joiner, Splitter. Convert, join, split video files between AVI, MPEG1, MPEG2, ASF, WMV, MOV, VOB, DAT , DivX, Xvid.\nAudio Converter, Recorder, CD ripper audio files between mp3, wma, wav.\nExtract audio tracks from all supported video formats to mp3, wma, wav,ogg.\nCD/DVD burner. Burn Video/Audio/Data CD/DVD.\nSpecifies start and end position while convert and join\nMake any favo rate pictures and ph otos to video films with fascinating transition effects and graceful background music.\nBatch file execution.\nJoints video files to a large one.\nSplits large video file to smaller clips.\nSpecifies start andend position while convert and joint..\nExtracts audio tracks from all supported video formats to mp3, wma, wav.\nExtracts images from all supported video formats.\nBackup VCD DVD Disc(.VOB, .DAT) to all supported formats.\nBackup VCD DVD Disc(.VOB, .DAT) music to mp3, wav, wma.\n\t\n\nAurora Media Workshop is such a kind of program that includes prefessional features in Video, Audio, and Compact Disc media. It is a video converter, joiner, splitter; audio cd ripper, converter, recorder; video, audio, date cd burner.\n\nThe powerful features and unbeatable price make Aurora Media Workshop an affordable and powerful all-in-one media solution on personal computer.\n \nFull audio and video edition pack\nAurora Media Workshop is a very complete utility which groups several applications on the same interface, so you will be able to work with audio and video using just one application.\n\nUsing Aurora Media Workshop you'll be able to convert, edit, join and split video and audio files, extract songs and rip them from an audioCD, video images, convert photos and more.\n\nAurora Media Workshop allows you to record audio from any device and convert them from/into MP3, WAV, WMA and OGG.\n\nAnd once you have done all you want, you can burn it thanks to its built-in burning program.\n\nIf you usually work with audio and video, we recommend you installing this great application, that can be also used by novice users too.\n\n","torrent":{"xt":"urn:btih:0d069ee7439e9a281f6ea9c69218dcc190284fa4","amp;dn":"Aurora+Media+Workshop+w%2Fkey","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d069ee7439e9a281f6ea9c69218dcc190284fa4","infoHashBuffer":{"type":"Buffer","data":[13,6,158,231,67,158,154,40,31,110,169,198,146,24,220,193,144,40,79,164]},"announce":[],"urlList":[]}}