{"title":"Blindskunk - Into The Light.mpg","uid":5210850,"size":108546052,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:0e2d7adff12e5759916a64ca5f8372295f20924d&amp;dn=Blindskunk+-+Into+The+Light.mpg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"claudeq","files":-1,"time":1260585256,"description":"Taken from BLINDSKUNK'S Bio\n\n\n\n\nUK Born now Australian, I have always had a passion for music, if not conventional.\n\nIn school I was never interested in theory and loathed learning the classical Guitar, but did like listening to my parents albums &quot;Switched on Bach&quot; and &quot;Clockwork Orange&quot; by Walter Carlos / now Wendy Carlos. (he/she also wrote the Tron sound track).\n\nIn my teens I started to get interested in Computers, with my first being a Commodore VIC 20. I then progressed onto the BBC Micro (yes a computer made by the B.B.C. TV station), where I purchased a  &quot;Hybrid Music System&quot; Music 500. This was a powerful language based multi Timbrel sequencer, very advanced for the 80's. Appealing more to the techies.\n\n\nMy main influences at this time coming from Jean Michael Jarre's Oxygene and a less well known Michael Shreeve and then Tangarine Dream. In my teens great influences including the DX7 bunch Howard Jones, Nick Kershaw, Human League, Depeche Mode, Yazoo and Mike Oldfield.\n\nIt wasn't until my college days that I actually managed to buy a Roland D10 and started using it with an Atari ST and Steinberg's base Cubase (1989). I created some great tracks back then but all lost in time and in the floppy disk era! - Over the years computer based music has always fascinated me including such areas as even the Commodore 64 , SID chip.\n\nAlways being interested in sound , graphic and computers I have always tried to merge the forms in some way or another. Creating many works for companies over the years including presentation animations in 3DMAX based on logos and small graphic pieces.\n\nRecently I decided to return to music after experimenting with Propellerhead Reason.  Wanting to take some of my works to the next stage I decided to start usingto encapsulate sounds and vision. Using Arkaos GrandDJ with Reason and even the Tenori-ON to create some interesting pieces.\n\nI've started to experiment with High-Def Video and 5.1/7.1 surround sound and find discovering new ways to use the technology around to have fun.\n\nHopefully some of my strange eclectic style of music will appeal to someone, but as long as I enjoy making the music, this is what counts...\n\nP.S. The BLINDSKUNK name was completely stumbled upon, pardon the expression, as I was trying to find a different domain name that had not been taken..\n\n\n\n\n\nEnjoy A Great Song","torrent":{"xt":"urn:btih:0e2d7adff12e5759916a64ca5f8372295f20924d","amp;dn":"Blindskunk+-+Into+The+Light.mpg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e2d7adff12e5759916a64ca5f8372295f20924d","infoHashBuffer":{"type":"Buffer","data":[14,45,122,223,241,46,87,89,145,106,100,202,95,131,114,41,95,32,146,77]},"announce":[],"urlList":[]}}