{"title":"Jason Derulo - In My Head  (2nafish)","uid":5421854,"size":132104196,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:0ebf502482e4ac372a96d552a52f8fd3b452ed86&amp;dn=Jason+Derulo+-+In+My+Head++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1268115249,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;In My Head&quot; is the second single released from Jason DerÃƒÂ¼lo's self-titled debut album, Jason DerÃƒÂ¼lo. It was released on December 8, 2009, in the United States, and in the UK on February 22, 2010, reaching number 1 on February 28 with Australia debuting at number #1 since 15 February 2010. It was also added to Canadian airplay in January 2010.\n\nThe music video was filmed in late December of 2009 and released on January 23, 2010 viaand as of March 2, 2010, the video has a total of 14,850,924 views. The video begins in the parking lot of a convenience store, with DerÃƒÂ¼lo leaning on a car with some friends when he eventually spots the female lead leaving the store. DerÃƒÂ¼lo is staring at her (with his debut single &quot;Whatcha Say&quot; playing in the background), and eventually he goes up and talks to her and starts singing to her. The video is an extensive dancing video with DerÃƒÂ¼lo dancing near the car with the female lead, in the occasional breakaways, and far more extensively with two male dancers during the bridge of the song. The music video occasionally breaks away to DerÃƒÂ¼lo's silhouette dancing in the fog. Eventually the girl he is dreaming about has joined him. In the end it is revealed that the entire music video was all in DerÃƒÂ¼lo's head and the beginning scene is shown again with the female lead exiting the store as she did at the beginning of the video.\n\nJason has stated that &quot;In My Head&quot; was chosen to be released as the second single from the album to show the other side of his debut album. The song is electro-influenced, and has a heavier rock feel than the R&amp;B and electronica influenced- Whatcha Say. DerÃƒÂ¼lo has stated that the album displays both sides, so &quot;In My Head&quot; was released to introduce his fans to electronic side of the record. The Song was alternately to be called &quot;In My Bed&quot; but decided to change the lyrics. He has explained this on the British televisions show &quot;Angela and Friends&quot;.\n\n&quot;In My Head&quot; debuted on the Billboard Hot 100 at #63 on the week ending December 26, 2009. It has since become Jason's second song to reach the top 10, at #9. The song peaked at #2 on the Canadian Hot 100 on the issue dated March 13, 2010, becoming his second top 3 single in Canada. It also debuted in Australia on the official ARIA Singles Chart at #1 and it is the only song (yet so far) to debut in Australia in 2010 since This Is Who I Am by Vanessa Amorosi. It also debuted at #1 on the UK Singles Chart making it his first #1 and second consecutive top three hit there. The song entered the Irish Singles Chart at number 3 on February 25th 2010 making it his highest charting single so for in that country.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:0ebf502482e4ac372a96d552a52f8fd3b452ed86","amp;dn":"Jason+Derulo+-+In+My+Head++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ebf502482e4ac372a96d552a52f8fd3b452ed86","infoHashBuffer":{"type":"Buffer","data":[14,191,80,36,130,228,172,55,42,150,213,82,165,47,143,211,180,82,237,134]},"announce":[],"urlList":[]}}