{"title":"TopGrl -  ( BDSM )-------Beverly Hills","uid":5397430,"size":389416674,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:0ed4dc9c5e472050ba9187aadbdaa97b25969637&amp;dn=TopGrl+-++%28+BDSM+%29-------Beverly+Hills&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":192,"time":1267286201,"description":" Beverly Hills    +  Pics\n\n(Posted: November 30, 2009)  \n      \nBeverly loves to play with other girls. There is something about submitting to them that just turns her on like nothing else. Sister Dee is just the type of woman to take advantage of her. It's been while since Beverly has had the pleasure of serving though suffering for someone as intense as Dee, but she is going to get into it fast the way Dee plays. It's been too long since Beverly has had her pussy punished. Dee takes the opportunity to remind her of how it feels. She cuts open her little fuck sluts clothing to better access her cunt and tits and hen stas to flick at them with her dragon tail. In the midst of her pain Beverly realizes she needs to piss. Dee isn't going to deny her that but it does need to be cleaned up and the wet rag needs to be put somewhere. It turns out it makes the perfect gag. So while Dee sets about playing with her clit Beverly has no choice but to moan her pleasure with a mouthful of her own pee.\n\nThe positions Sister Dee comes up with are extraordinary. Tied down to the cart, Beverly has a leash around her neck that is perfect for towing her around. Dee puts in an ass hook that her slutty little hole swallows in an instant. When Dee wants to make sure she is getting enough cock her limbs are tied up perfectly to allow easy access. The dick can't go in dry, so the bitch is going to have to suck it til it's ready. With her hair tied to the hook there is no problem keeping her face up to get fucked. Her pussy is where she really wants it, though.\n\nAs soon as Mr. Pogo is burried in her snatch Beverly starts moaning again. The vibrator makes her beg like a bitch to be allowed to cum and just before Dee lets her release she changes her mind and begins to cane the cunt's feet. 10 strokes hasn't set Beverly too far off her orgasm. It's seconds before she is begging like a slut again and this time Dee has a different means of torment. Instead of depriving her of pleasure Dee continues to vibrate her through multiple orgasms until she has no choice but to beg yet again, this time for it to end.\n\nJust because she has come enough to satisfy herself doesn't mean Beverly is done pleasing Sister Dee, though. Dee pulls her bitch's legs up into the air and seperates the lips of her pussy with a pair of clamps. An inflatable cock finds its home in her cunt and Dee starts flicking at her twat, thighs and stomach with a whip to amuse herself. The inverted position makes it so hard for Beverly to move that Dee sees a great chance to vibrate her again. Long after the first orgasm has subsided the slut is twisting herself into knots hoping to lessen the intensity of the vibrations through her clit. \n\n\nScreens &lt;a href=&quot; http://topgrl.com/pages/update_full1.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://topgrl.com/pages/update_full1.php&lt;/a&gt;\n\n\nCheers  :-)","torrent":{"xt":"urn:btih:0ed4dc9c5e472050ba9187aadbdaa97b25969637","amp;dn":"TopGrl+-++%28+BDSM+%29-------Beverly+Hills","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ed4dc9c5e472050ba9187aadbdaa97b25969637","infoHashBuffer":{"type":"Buffer","data":[14,212,220,156,94,71,32,80,186,145,135,170,219,218,169,123,37,150,150,55]},"announce":[],"urlList":[]}}