{"title":"Eraser 5.7 (Win 9x, ME, NT, 2000)","uid":5247349,"size":2811211,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0f59979646752cbf193aa1e03e766e04e58d2267&amp;dn=Eraser+5.7+%28Win+9x%2C+ME%2C+NT%2C+2000%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"olofolleola4","files":-1,"time":1262217114,"description":"Copied from Eraser Homepage:\n\n\nEraser is an advanced security tool for Windows which allows you to completely remove sensitive data from your hard drive by overwriting it several times with carefully selected patterns. Works with Windows 98, ME, NT, 2000, XP, Vista, Windows Server 2003 and Server 2008.\n\nEraser is Free software and its source code is released under GNU General Public License.\n\n\nWhy Use Eraser?\n\nMost people have some data that they would rather not share with others - passwords, personal information, classified documents from work, financial records, self-written poems, the list can be continued forever.\n\nPerhaps you have saved some of this information on your computer where it is conveniently at your reach, but when the time comes to remove the data from your hard disk, things get a bit more complicated and maintaining your privacy is not as simple as it may have seemed at first.\n\nYour first thought may be that when you 'delete' the file, the data is gone.\nNot quite, when you delete a file, the operating system does not really remove the file from the disk; it only removes the reference of the file from the file system table. The file remains on the disk until another file is created over it, and even after that, it might be possible to recover data by studying the magnetic fields on the disk platter surface.\n\nBefore the file is overwritten, anyone can easily retrieve it with a disk maintenance or an undelete utility.\n\nThere are several problems in secure file removal, mostly caused by the use of write cache, construction of the hard disk and the use of data encoding. These problems have been taken into consideration when Eraser was designed, and because of this intuitive design and a simple user interface, you can safely and easily erase private data from your hard drive.\n\n\nEraser Features\n\n\nIt works with Windows XP, Windows Vista, Windows Server 2003 and Windows Server 2008.\nWindows 98, ME, NT, 2000 can still be used with version 5.7!\n\nIt works with any drive that works with Windows\n\nSecure drive erasure methods are supported out of the box\n\nErases files, folders and their previous deleted counterparts\n\nWorks with an extremely customisable Scheduler\n\n\nDo note that the Eraser 5.x series will be retired (i.e. unmaintained) after the release of Eraser 6.0.7.\n\n\nED2K Link:\ned2k://|file|Eraser57Setup.zip|2811211|507D521F62535C8376C7D4CCF73D8E55|h=QXUMNB45O7CPO4O6GLV2KZ5NJXKIQZLC|/\n\n\nComments from the uploader (olofolleola4):\nEraser 5.7 is designed for Windows 98, ME, NT, 2000\n\nHere is some links if you cannot download it through this torrent:\nupload box  .  com  /  files  /  d940fed456\nrapid share  .  com  /  files  /  328130949  /  Eraser57Setup.zip","torrent":{"xt":"urn:btih:0f59979646752cbf193aa1e03e766e04e58d2267","amp;dn":"Eraser+5.7+%28Win+9x%2C+ME%2C+NT%2C+2000%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f59979646752cbf193aa1e03e766e04e58d2267","infoHashBuffer":{"type":"Buffer","data":[15,89,151,150,70,117,44,191,25,58,161,224,62,118,110,4,229,141,34,103]},"announce":[],"urlList":[]}}