{"title":"The Universe S1E01 - Secrets of the Sun [HD-Rip ITA ENG ~ 1080p]","uid":5217247,"size":4684656493,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:0fb025ceb7d2d9e4adfc897285bae082a581f2e4&amp;dn=The+Universe+S1E01+-+Secrets+of+the+Sun+%5BHD-Rip+ITA+ENG+%7E+1080p%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Colombo-bt","files":-1,"time":1260749179,"description":"www.navartek.org\n\n\n***************************************************************************\nThe Universe S1E01 - Secrets of the Sun [HD-Rip ITA ENG ~ 1080p]\n\nLa storia dell'Universo S1E01 - I segreti del Sole [HD-Rip ITA ENG ~ 1080p]\n***************************************************************************\n\nENGLISH\n\nOriginal series: The Universe - Season one\nEpisode number: 01 of 14\nDirector: D.J. Cohen\nWriter: D.J. Cohen\nBroadcast: 29/05/2007 - History Channel\nEpisode lenght: 44:07\nLanguage: ENGLISH / ITALIANO\nResolution: 1920x1080\nFile dimension : 4,36 Gb\n\nTHE SERIE - From the planets to the stars and out to the edge of the unknown, history and science collide in this epic exploration of the Universe and its mysteries. It's a very old universe. Yet just 50 years since man first ventured into outer space, the heavens are yielding their greatest secrets. Robotic rovers give us eyes on the red rock of Mars--NASA probes slam into comets at hyper speed--deep-space telescopes capture violent images of the birth of stars and their collapse into black holes. All have significantly changed the way we see ourselves. We wonder, is there anywhere else out there that that can support life? Using cutting-edge computer graphics, this series brings the universe down to earth to show what life would be like on other planets, and to imagine what kind of life forms might evolve in alien atmospheres. Episodes examine how discoveries were made and the scientists and explorers who dared to venture into the uncharted territory of the universe.\n\nEPIDOSE 01 - It is a fireball in Ethe sky, a bubbling, boiling, kinetic sphere of white hot plasma, exploding and erupting. Its size is almost unimaginable--one million Earths would fit within its boundaries. In this violence is born almost all the energy that makes existence on Earth possible, yet, its full mysteries are only now beginning to be understood. From Sun spots to solar eclipses, solar flares to solar storms, the birth of the sun to its potential death, discover the science and history behind this celestial object that makes life on Earth exist.\n\n***********************************************************************************\n\nITALIANO\n\nSerie: La storia dell'Universo - Stagione uno\nEpisodio: 01 of 14\nRegia: D.J. Cohen\nAutore: D.J. Cohen\nTrasmesso: 29/05/2007 (USA) da History Channel\nDurata episodio: 44:07\nLingue: ENGLISH / ITALIANO\nSottotitoli: Nessuno\nRisoluzione: 1920x1080\nDimensione file: 4,36 Gb\n\nEPISODIO 01 - I SEGRETI DEL SOLE - E' una palla di fuoco nel cielo, una sfera di plasma bianco bollente, ricoperto da esplosioni ed eruzioni. La sua dimensione ÃƒÂ¨ inimmagginabile: puÃƒÂ² conterenere la Terra un milione di volte. Nelle sue violente reazioni chimiche si sprigiona l'energia che permettono alla vita di esistere sulla Terra, ma la nostra compresione della Stella ÃƒÂ¨ solamente all'inizio. Dai punti solari alle eclissi e le tempeste solari analizzaremo la nascita del sole e la sua potenziale fine, tra scienza e storia.\n\n\n","torrent":{"xt":"urn:btih:0fb025ceb7d2d9e4adfc897285bae082a581f2e4","amp;dn":"The+Universe+S1E01+-+Secrets+of+the+Sun+%5BHD-Rip+ITA+ENG+%7E+1080p%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0fb025ceb7d2d9e4adfc897285bae082a581f2e4","infoHashBuffer":{"type":"Buffer","data":[15,176,37,206,183,210,217,228,173,252,137,114,133,186,224,130,165,129,242,228]},"announce":[],"urlList":[]}}