{"title":"La.Novia.del.Cabello.Blanco.1.DVD-Rip.Spanish.","uid":5365131,"size":733745152,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:10976d4dfa8e39247d4f05d7fc6a92b40b4ffe86&amp;dn=La.Novia.del.Cabello.Blanco.1.DVD-Rip.Spanish.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zurera","files":1,"time":1266193018,"description":"Nombre de Archivo : La.Novia.del.Cabello.Blanco.1.DVD-Rip.Xvid-Mp3.Spanish.avi\nTamaÃƒÂ±o de Archivo : 700 Mb.\nDuraciÃƒÂ³n : 01:28:48\n\n[VÃƒÂ­deo]\nResoluciÃƒÂ³n : 656x288\nCÃƒÂ³dec : XviD MPEG-4 codec\nFPS : 25,00\nBitRate : 985 Kbps\nFactor de Calidad : 0,21 b/px\n\n[Audio]\nCÃƒÂ³dec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNÃ‚Âº de canales : 2\nRatio de Muestra : 48000 Hz\nBitRate : 116 Kbps\n---\nLa novia del cabello blanco\nTÃƒÂ­tulo original The bride white hair, Bai fa mo nu zhuan\nNacionalidad Hong Kong\nAÃƒÂ±o 1993\nGÃƒÂ©nero Fantastico\nFormato Color\nDirector Ronny Yu\nGuiÃƒÂ³n David Wu Dai-Wai, Lam Kei-To, Tseng Pik-Yin, Ronny Yu Yan-Tai\nFotografÃƒÂ­a Peter Pau\nMÃƒÂºsica Marti Richa\nDistribuidora Manga Films\nReparto Brigitte Lin Ching-Hsia, Leslie Cheung Kwok-Wing, Elaine Lui Siu-Ling, Yammie Nam Kit-Ying, Francis Ng Chun-Yu, Law Lok-Lam, Pau Fong, Eddy Ko Hung, Joseph Cheng\n---\nFantasporto\nAÃƒÂ±o Resultado GalardÃƒÂ³n CategorÃƒÂ­a Receptores\n1995 Nominada International Fantasy Film Award Best Film Ronny Yu\n\nGolden Horse Film Festival\nAÃƒÂ±o Resultado GalardÃƒÂ³n CategorÃƒÂ­a Receptores\n1993 Ganadora Golden Horse Award Best Original Song Leslie Cheung\n1993 Ganadora Golden Horse Award Best Screenplay Adapted from Another Source David Wu, Kei To Lam, Ronny Yu\n\nHong Kong Film Awards\nAÃƒÂ±o Resultado GalardÃƒÂ³n CategorÃƒÂ­a Receptores\n1994 Ganadora Hong Kong Film Award Best Art Direction Eddie Ma\n1994 Ganadora Hong Kong Film Award Best Cinematography Peter Pau\n1994 Ganadora Hong Kong Film Award Best Costume &amp; Make Up Design\n1994 Nominada Hong Kong Film Award Best Film Editing David Wu\n1994 Nominada Hong Kong Film Award Best Original Film Score Richard Yuen\n1994 Nominada Hong Kong Film Award Best Original Film Song Leslie Cheung, Chik Lam\n---\nBasada en un magnÃƒÂ­fico clÃƒÂ¡sico de la literatura china, este filme narra la historia de Lian, una hermosa joven criada por los lobos en las montaÃƒÂ±as de Wudang, y de Zhuo, un joven y valiente guerrero. Cuando Zhuo era niÃƒÂ±o, el canto de una chica misteriosa le salva de ser devorado por una manada de lobos, pero Lian desaparece antes de que Zhuo pueda agradecÃƒÂ©rselo. Los aÃƒÂ±os pasan y llega el momento en que Zhuo se une al ejÃƒÂ©rcito revolucionario para derrocar a la malvada dinastÃƒÂ­a Mo, gobernadad por Ji, un emperador mutante que ha raptado a Lian para aprovechar su magia contra el ejÃƒÂ©rcito de rebeldes. Cuando Lian se niega a atacar a Zhuo, el emperador ordena que la torturen hasta morir. Pero el destino vuelve a unir a Lian y a Zhuo, lo que desata la ira del emperador, cuya parte masculina estÃƒÂ¡ secretamente enamorada de Lian. Celoso, Ji prepara su venganza.\n---\nEspectacular pelÃƒÂ­cula donde Ronny Yu ya demostraba su soltura a la hora de dirigir y su originalidad en las historias, y por eso Hollywood se fijo en ÃƒÂ©l para hacer pelÃƒÂ­culas como La novia de Chuky y Freddy Vs Jason, pelÃƒÂ­culas con mucha imaginaciÃƒÂ³n y efectivas pero lejos del encanto y aire mÃƒÂ­stico de La novia del cabello blanco.\n\nBrigitte Lin hace a la perfecciÃƒÂ³n su papel de novia de cabello blanco con su forma de ser desconcertante, la primera impresiÃƒÂ³n que da es de un ser friÃƒÂ³ y calculador pero en el fondo tiene &quot;corazÃƒÂ³n&quot; para segÃƒÂºn que cosas, como su amado.\n\nUna pelÃƒÂ­cula de culto China en la que la fotografÃƒÂ­a y la mÃƒÂºsica te meterÃƒÂ¡n de lleno en un mundo de leyenda. ","torrent":{"xt":"urn:btih:10976d4dfa8e39247d4f05d7fc6a92b40b4ffe86","amp;dn":"La.Novia.del.Cabello.Blanco.1.DVD-Rip.Spanish.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10976d4dfa8e39247d4f05d7fc6a92b40b4ffe86","infoHashBuffer":{"type":"Buffer","data":[16,151,109,77,250,142,57,36,125,79,5,215,252,106,146,180,11,79,254,134]},"announce":[],"urlList":[]}}