{"title":"METRO 2033 Full -DirectPlay- Windows 7 Compatible [2010]","uid":5449678,"size":3707362281,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:12771d15d8cf221a77176ef14a2644692f99faa0&amp;dn=METRO+2033+Full+-DirectPlay-+Windows+7+Compatible+%5B2010%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"DirtyButtPirate","files":-1,"time":1269137956,"description":"\n\n* The game will take place in post-apocalyptic Moscow, mostly inside the metro system, but occasionally the player will go aboveground to scavenge for supplies and valuables. The enemies that the player will be facing range from human renegades to giant mutated rats. Players will frequently have to defend themselves with makeshift combinations of two weapons put together. Ammunition is scarce and is also used as currency, forcing the player to use their weapons very carefully.\n\nThe game is essentially HUD-less, relying on blood spatters to show how much damage was done to the player, and a gas mask must be worn when exploring the surface. There is no on-screen indicator to tell how long the player has until the gas mask's filters begin to fail, so players must set a wrist watch, and continue to check it every time they wish to know how long they have. Due to the HUD-less screen players must use a map whenever they need to check their heading, leaving them vulnerable to attack. Dakota Grabowski was also able to sit down with Luis Giglotti who describes the game and how it relates to the book, and also gives descriptions of the &quot;Dark Ones&quot; who are one of the key enemies in the game who attack you psychically. He also talks about the players character being &quot;unique&quot; by being immune to the Dark Ones. The player will also have visions that will give some back story and some of them will be playable.\n\n\n*** ABSOLUTLY OBRIGATORY GET THE LATEST NVIDIA DRIVERS *** \n\n\nMINIMUM SYSTEM REQUIREMENTS :\n=============================\n\nXP / Vista / 7\nDual core CPU (any Core 2 Duo or better will do)\nDirectX 9, Shader Model 3 compliant graphics cards (GeForce 8800, GeForce GT220 and above)\n1GB RAM\n\n\n\nnote : the way that is file is worked have a good chance for video cards from lower series run the game\n\n\n\nNEWS :\n====== \n\nTHIS FILE APPROVED AFTER A TEST IN A LOWER SERIES VIDEO CARD THAN THAT ARE REQUESTED IN THE MINIMUM REQUIREMENTS . TRUE !!! \nAFTER THIS TEST I BELIEVE THAT LOWER VIDEO CARDS FROM SERIES 8 CAN WORK , FROM SERIES 7 PROBABLY TOO AND SERIES 6 HAVE A SHOT , FOR THE NICE VIDEO CARDS FROM SERIES 1 WILL WORK TOO (ALL NVIDIA VIDEO CARDS ANALISED HERE) AND THIS HAPPENS IN MY FILE , I AM NOT SAYING THIS TO GET MORE USERS AND THAT CAN BE TRUE ANYWAY BUT THE ORIGINAL ISO IS PREPARED FOR BEST RECCOMENDATIONS OF THE GAME AND I PREPARED THIS FILE TO LOWER VIDEO CARDS HAVE A BETTER CHANCE TO RUN . IN THIS PARTICULAR GAME IT HAPPEN LIKE THAT . THATÃ‚Â´S ALL AND ENJOY YOUR GAME ALL OF YOU , THE LATEST NVIDIA DRIVERS ARE REALLY OBRIGATORY .\n\nScanned clean with AVG Norton And Kaspersky 2010.\n\nWindows XP/Windows Vista/Windows 7 Compatible\n\n","torrent":{"xt":"urn:btih:12771d15d8cf221a77176ef14a2644692f99faa0","amp;dn":"METRO+2033+Full+-DirectPlay-+Windows+7+Compatible+%5B2010%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12771d15d8cf221a77176ef14a2644692f99faa0","infoHashBuffer":{"type":"Buffer","data":[18,119,29,21,216,207,34,26,119,23,110,241,74,38,68,105,47,153,250,160]},"announce":[],"urlList":[]}}