{"title":"Escape from Sobibor","uid":5389949,"size":1288585092,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1379ca26f7861caf0c5c1f325ecea024a3f60f07&amp;dn=Escape+from+Sobibor&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"muryucu","files":-1,"time":1267031455,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0092978/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0092978/&lt;/a&gt;\n \n   \n  Escape from Sobibor sound english and romanian subtitle    \n     \n \n \n                                                       \n     In al Doilea Razboi Mondial, in estul Poloniei existau trei lagare de \n     exterminare naziste, unul dintre ele fiind Sobibor. Cativa prizonieri, in \n     frunte cu Leon Feldhendler, decid sa evadeze. Sosirea in lagar a unor \n     soldati rusi, condusi de Aleksander Percherski a dus la reusita planului,\n     in urma caruia 300 de oameni si-au regasit libertatea.\n     Pelicula a fost apreciata pentru realismul si dramatismul cu care a \n     redat un episod tragic al omenirii, reusind, totodata, sa evite melodrama. \n     Multe dintre filmari au fost realizate la Belgrad. \n   \n   \n\n \n   Following the Wannsee Conference on January 20, 1942, the Nazi regime created  six &quot;Death Camps&quot;(extermination centers)in Eastern Poland. Three of these were set up under &quot;Operation Reinhard,&quot; named for Reinhard Heydrich, who had chaired the Wannsee Conference, where the &quot;Final Solution&quot; was decreed. One of the &quot;Reinhard&quot; camps was Sobibor (the other Reinhard camps were Belzec and Treblinka; Auschwitz-Birkenau, Chelmno, and Majdanek were also extermination centers). Other concentration camps were mainly labor or punishment camps, but the extermination centers had only one purpose - to kill as many Jews as possible as quickly as possible. A small group of prisoners were kept back from the gas chambers to work the camp under control of the Nazi guards. This is the story of what life was like for those people who had to watch their countrymen and families die. Pushed to the limit of human endurance, they finally found a way to fight back. The spirit of humanity at its most desperate and most magnificent.\n   \n   \n       \n  \n               \n    \tJoanna Pacula (1957) -- Luka\n\tRutger Hauer (1944) --- Alexander 'Sasha' Pechersky\n        Alan Arkin (1934) ----- Leon Feldhendler\n\tJack Shepherd (1940) -- Itzhak Lichtman\n \n","torrent":{"xt":"urn:btih:1379ca26f7861caf0c5c1f325ecea024a3f60f07","amp;dn":"Escape+from+Sobibor","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1379ca26f7861caf0c5c1f325ecea024a3f60f07","infoHashBuffer":{"type":"Buffer","data":[19,121,202,38,247,134,28,175,12,92,31,50,94,206,160,36,163,246,15,7]},"announce":[],"urlList":[]}}