{"title":"El futuro de la comida.2006 (Documental ciencia) .avi","uid":5339624,"size":471904256,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:1517f57824f38039d3b9b09c167c13911eeb0347&amp;dn=El+futuro+de+la+comida.2006+%28Documental+ciencia%29+.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"smookinganja","files":1,"time":1265426429,"description":"El futuro de la comida es un documental estadounidense de 2004 que hace una investigaciÃƒÂ³n en profundidad sobre productos alimenticios patentados y sin etiquetar alterados genÃƒÂ©ticamente que han ido entrando silenciosamente en las tiendas de comestibles estadounidenses desde la dÃƒÂ©cada pasada.\n\n\nMuestra la opiniÃƒÂ³n de agricultores en desacuerdo con la industria alimenticia y detalla el impacto en sus vidas y en su economÃƒÂ­a de esta nueva tecnologÃƒÂ­a y hace brillar una luz en el mercado y fuerzas polÃƒÂ­ticas que estÃƒÂ¡n cambiando lo que comemos.\n\n\nEl film critica el costo de la industria alimenticia globalizada en las vidas humanas de alrededor del mundo y subraya como las compaÃƒÂ±ÃƒÂ­as trasnacionales estÃƒÂ¡n gradualmente conduciendo a los agricultores fuera de sus tierras en muchos paÃƒÂ­ses. La dependencia potencial de manera global de la raza humana de un nÃƒÂºmero limitado de empresas alimenticias globales es discutida, asÃƒÂ­ como su riesgo incrementado de desastres ecolÃƒÂ³gicos como la Gran hambruna irlandesa (1845-1849), resultantes de la perdida de biodiversidad debido a la promociÃƒÂ³n de una agricultura de monocultivos patrocinada por las corporaciones.\n\n\nEl hecho de incorporar tecnologÃƒÂ­a Terminator en semillas de plantas es cuestionado, expresando datos concernientes sobre el potencial para expandir catÃƒÂ¡strofes afectando las fuentes de alimentos, al igual de como los genes contaminados afectan otras plantas silvestres. Las historias legales reportadas por el documental relatan como un nÃƒÂºmero de granjeros de NorteamÃƒÂ©rica han sido demandados por Monsanto; y se entrevista al demandado del caso Monsanto Canada Inc. contra Schmeiser.\n\n\nEl guiÃƒÂ³n y la direcciÃƒÂ³n del documental es de Deborah Koons, quien tambiÃƒÂ©n lo produjo conjuntamente con Catherine Butler. Fue estrenado el 14 de septiembre de 2005 en Nueva York en el Film Forum. Desde entonces se ha editado en DVD, en formato tanto NTSC como PAL.\n","torrent":{"xt":"urn:btih:1517f57824f38039d3b9b09c167c13911eeb0347","amp;dn":"El+futuro+de+la+comida.2006+%28Documental+ciencia%29+.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1517f57824f38039d3b9b09c167c13911eeb0347","infoHashBuffer":{"type":"Buffer","data":[21,23,245,120,36,243,128,57,211,185,176,156,22,124,19,145,30,235,3,71]},"announce":[],"urlList":[]}}