{"title":"15 March 2010 - BBC Trafigura libel defence (Wikileaks)","uid":5452791,"size":3095881,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:159d3bb35dce990eff59dc778befbb14ee888da9&amp;dn=15+March+2010+-+BBC+Trafigura+libel+defence+%28Wikileaks%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"zzoob","files":1,"time":1269244273,"description":"From Wikileaks.org\n\n15. Mar. 2010: BBC High Court Defence against Trafigura libel suit, 11 Sep 2009\n\nThis document was submitted to the UK's High Court by the British Broadcasting Corporation (BBC) in September 2009, as a Defence against a libel claim brought against them by the oil company Trafigura. A May 2009 BBC Newsnight feature suggested that 16 deaths and many other injuries were caused by the dumping in the Ivory Coast of a large quantity of toxic waste originating with Trafigura. A September 2009 UN report into the matter stated that 108,000 people were driven to seek medical attention. This Defence, which has never been previously published online, outlines in detail the evidence which the BBC believed justified its coverage. In December 2009 the BBC settled out of court amid reports that fighting the case could have cost as much as 3 million pounds. The BBC removed its original Newsnight footage and associated articles from its on-line archives. The detailed claims contained in this document were never aired publicly, and never had a chance to be tested in court. Commenting on the BBC's climbdown, John Kampfner, CEO of Index on Censorship said: &quot;Sadly, the BBC has once again buckled in the face of authority or wealthy corporate interests. It has cut a secret deal. This is a black day for British journalism and once more strengthens our resolve to reform our unjust libel laws.&quot; Jonathan Heawood, Director of English PEN, said: &quot;Forced to choose between a responsible broadcaster and an oil company which shipped hundreds of tons of toxic waste to a developing country, English libel law has once again allowed the wrong side to claim victory. The law is an ass and needs urgent reform.&quot; Now that this document is in the public domain, the global public will be able to make their own judgement about the strength of the BBC's case.","torrent":{"xt":"urn:btih:159d3bb35dce990eff59dc778befbb14ee888da9","amp;dn":"15+March+2010+-+BBC+Trafigura+libel+defence+%28Wikileaks%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"159d3bb35dce990eff59dc778befbb14ee888da9","infoHashBuffer":{"type":"Buffer","data":[21,157,59,179,93,206,153,14,255,89,220,119,139,239,187,20,238,136,141,169]},"announce":[],"urlList":[]}}