{"title":"Whitesnake - Now You're Gone  (2nafish)","uid":5324910,"size":189724676,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:15be87ec44bd9b0487695c38a5e8ab550212c155&amp;dn=Whitesnake+-+Now+You%5C%27re+Gone++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"2nafish","files":-1,"time":1264985111,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\nSlip of the Tongue is an album by the rock band Whitesnake, released in 1989. This is the band's ninth studio album overall. It features guitarist Steve Vai on guitars. Four singles were released from the album: &quot;Fool for Your Loving&quot;, &quot;Slip of the Tongue&quot; &quot;The Deeper the Love&quot; and &quot;Now You're Gone&quot;. All the singles hit the Mainstream Rock Tracks top 40, and &quot;The Deeper the Love&quot; and &quot;Fool For Your Loving&quot; were top 5. Slip of the Tongue has sold over four million copies (quadruple platinum).\n\n&quot;Fool for Your Loving&quot; originally appeared on the Ready an' Willing album, but it was re-recorded for this album.\n\nWhitesnake are an English rock band, founded in 1977 by David Coverdale (formerly of Deep Purple). The band's early material has been compared by critics to Deep Purple but by the mid 1980s Whitesnake had moved away from the early blues influenced hard rock to a more commercial heavy metal style.\n\nWhitesnake were named the 85th greatest hard rock band of all time by VH1.\n\nDavid Coverdale founded Whitesnake in 1977 in North Yorkshire, England. The core line-up had been working as his backing band The White Snake Band on the White Snake album tour and they retained the title before officially being known as Whitesnake. They toured with Coverdale as his support band and for both of the solo albums he released, White Snake and Northwinds, between exiting Deep Purple and founding Whitesnake. During the band's early years their music was primarily blues rock (although Coverdale described Whitesnake's early style as &quot;progressive R&amp;B&quot;). At this time, the band was made up of David Coverdale, Bernie Marsden, Micky Moody, Neil Murray and drummer David &quot;Duck&quot; Dowle with keyboardist Brian Johnston. Johnston would soon be replaced by Procol Harum organ player and keyboardist Pete Solley. Because of Solley's producing commitments he was replaced by the former Deep Purple keyboard player Jon Lord, during sessions for the first LP.\n\nVivian Campbell left Whitesnake in late 1988 due to creative differences, and so the band's line-up changed yet again for the 1989 album Slip of the Tongue. While preparing for the recording of the album, guitarist Adrian Vandenberg reportedly suffered a debilitating hand injury and Steve Vai was called in to record all the guitar parts. Slip of the Tongue sold three million copies and hit #10 in US and UK album charts. Successful singles included a re-working of &quot;Fool For Your Loving&quot; (#37 US and #43 UK), the melodic &quot;The Deeper The Love&quot; (#28 US and #35 UK) and &quot;Now You're Gone&quot; (#96 US and #31 UK).\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:15be87ec44bd9b0487695c38a5e8ab550212c155","amp;dn":"Whitesnake+-+Now+You%5C%27re+Gone++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15be87ec44bd9b0487695c38a5e8ab550212c155","infoHashBuffer":{"type":"Buffer","data":[21,190,135,236,68,189,155,4,135,105,92,56,165,232,171,85,2,18,193,85]},"announce":[],"urlList":[]}}