{"title":"Magic Mirror","uid":5399420,"size":3388726,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:16fc34f5a0a7c72c1a2d7429d8d829f345947669&amp;dn=Magic+Mirror&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2mean2die","files":1,"time":1267367513,"description":"\n \nMagic Mirror 6.15\n\nMagic Mirror is a comic program for work with photos. Magic Mirror differs from other analogues simplicity of use and the clear interface. If you wish to play a trick on the friends Magic Mirror it is your choice!\n\nFeatures:\n- Deformation and distortion of the face,\n- Professional tools of processing of the image, including: turn, framing, change of the sizes, increase in the image,\n- There are 4 tools for deformation of the image,\n- Support of images in formats BMP, JPEG, PNG, GIF.\n\nSize : 3.23 MB\nDistorting face and producing surreal effects!\n \nZeallSoft Magic Mirror is funny and easy to use photo distorting software. You can distorting your friend or family face and producing surreal effects! Have you ever heard the saying &quot;laugh until you weep&quot;? No! Don't worry, get Magic Mirror and try a face warp. It's an entertainment package. Whether yours is a group of friend or children, whether you opt for a face warp or warp picture, Magic Mirror will generate a laugh a minute. Magic Mirror is packed with laughter generating tools and all the features you will ever need to turn an ordinary image into something extraordinary. Just imagine, if you can, what the changes will be like when you apply the warp face or warp picture facility to someone you know or an image around you. So what's in it? How about Warping Mirrors? These help to disfigure and distort any ordinary image beyond recognition. We dare you to try Magic Mirror on a photograph of yourself before you use it to radically change the identity of family members and friends. It's so much fun and so easy to operate, it can seriously earn its place on your all age gift list.\n\n","torrent":{"xt":"urn:btih:16fc34f5a0a7c72c1a2d7429d8d829f345947669","amp;dn":"Magic+Mirror","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16fc34f5a0a7c72c1a2d7429d8d829f345947669","infoHashBuffer":{"type":"Buffer","data":[22,252,52,245,160,167,199,44,26,45,116,41,216,216,41,243,69,148,118,105]},"announce":[],"urlList":[]}}