{"title":"Strit og Stumme (aka Dreaming of Paradise)- VHS rip","uid":5391197,"size":132517962,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:17ead75d147886f4be76e0e492244324785d704e&amp;dn=Strit+og+Stumme+%28aka+Dreaming+of+Paradise%29-+VHS+rip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"liber_dragon","files":-1,"time":1267066998,"description":"Strit og Stumme\nFra Wikipedia, den frie encyklopÃƒÂ¦di\n\nStrit og Stumme er en dansk tegnefilm fra 1987 med instruktion af Jannik Hastrup og manuskript af Jannik Hastrup og Bent Haller, efter sidstnÃƒÂ¦vntes bog BlÃƒÂ¥folket.\n\nFilmen foregÃƒÂ¥r engang i fremtiden hvor menneskene lever i undergrunden pÃƒÂ¥ grund af at forureningen har gjort jordens overflade kold og ubeboelig. Menneskene lever i dybe huler hvor de er slaver for rotterne som nu har magten, men en lille pige, der hedder Strit, som elsker sin bedstemors historier om livet menneskene engang havde pÃƒÂ¥ overfladen, vil ikke opgive hÃƒÂ¥bet om &quot;Paradis&quot;, sÃƒÂ¥ hun og hendes ven BlÃƒÂ¥nÃƒÂ¦se begynder nu turen mod overfladen. PÃƒÂ¥ vejen mÃƒÂ¸der de Stumme en lille dreng, som de tager med sig. De fÃƒÂ¥r meget modstand af rotterne, som bliver anfÃƒÂ¸rt af Mr. President og hans general McDonald, som tyraniserer menneskenes drÃƒÂ¸mme om paradis.\n\nFilmen fik 1987 prisen som bedste animerede spillefilm ved Chicago Childrens Film Festival. PÃƒÂ¥ grund af dette blev den ogsÃƒÂ¥ udgivet pÃƒÂ¥ engelsk med titlen &quot;Dreaming of Paradise&quot;\n---\nSpike and her friends live in the future where the Earth has become so polluted that they must live underground. As legend has it, a creature that &quot;Walks on Air&quot; will guide them to a place where there are blue skies and green meadows.\n---\n\nI had been searching for a downloadable copy everywhere, but just couldn't find it. There supposedly a few worn VHS copies left among the public, but a DVD version was never released. The movie is long out of production, and the only way the creaters can possibly get more money out of this movie, is to spread the message.\n\nThis copy is supposedly a rip of a VHS tape that someone put online in parts. I just combined them back together and made a torrent out of them. I wish I could provide higher quality, but at least this is better than nothing.\n\nAlso, sorry for the slow initial seeding. I simply don't have anything faster. Please do keep seeding! Help revive this long gone child memory, from a time when animators were not afraid of showing kids the blunt truth!\n\nAudio language: Danish","torrent":{"xt":"urn:btih:17ead75d147886f4be76e0e492244324785d704e","amp;dn":"Strit+og+Stumme+%28aka+Dreaming+of+Paradise%29-+VHS+rip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17ead75d147886f4be76e0e492244324785d704e","infoHashBuffer":{"type":"Buffer","data":[23,234,215,93,20,120,134,244,190,118,224,228,146,36,67,36,120,93,112,78]},"announce":[],"urlList":[]}}