{"title":"U2 1993-05-11 Rotterdam (Apple Lossless)","uid":5372543,"size":1011853397,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:19e3a8ea9e450b7c247b01a318fd45e9801ae8a6&amp;dn=U2+1993-05-11+Rotterdam+%28Apple+Lossless%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"u2unes","files":42,"time":1266477243,"description":"U2unes is back.  Check this one out.\n=====\n\nU2\n11-MAY-93\nRotterdam\nFeyenoord Stadium\n\nThree Nights And The Truth\n \n\nDisc 1:\n\n01. Television, The Drug Of The Nation \n02. Zoo Station \n03. The Fly \n04. Even Better Than The Real Thing \n05. Mysterious Ways \n06. One \n07. Unchained Melody \n08. Until The End Of The World  \n09. New Year's Day \n10. Wild Rover \n11. Tryin' To Throw Your Arms Around The World \n12. Angel Of Harlem \n13. Slow Dancing \n14. I Still Haven't Found What I'm Looking For \n15. Satellite Of Love \n16. Bad\n\nDisc 2:\n\n01. Bullet The Blue Sky \n02. Running To Stand Still \n03. Where The Streets Have No Name \n04. Pride (in The Name Of Love) \n05. Video Confessionals \n06. Desire\n07. Macphisto Phone Call \n08. Ultraviolet (light My Way) \n09. With Or Without You \n10. Love Is Blindness \n11. Can't Help Falling In Love\n12. Dirty Old Town \n13. When Love Comes To Town \n14. Macphisto Phone Call \n15. Party Girl \n16. My Girl \n17. I Will Follow \n18. Sunday Bloody Sunday \n19. Macphisto Phone Call\n20. Are You Lonesome Tonight\n \nSource :\nDisc 1, Disc 2 (1-11): May 11, 1993. Rotterdam, Holland. Feyenoord Stadium.\nDisc 2 (12-14): May 9, 1993. Rotterdam, Holland. Feyenoord Stadium. \nDisc 2 (15-20): May 10, 1993. Rotterdam, Holland. Feyenoord Stadium. \n\nComments:\nThis is the last of three consecutive concerts U2 played at Feyenoord Stadium to commence their Zooropa '93 Tour. \nWhenever they play multiple gigs at one location, the last night's kind of special and this one's no exception. \nThe band made quite a few mistakes (maybe 'cause it was the day after Bono's birthday?), but the atmosphere was exuberant. \nThe first disc has the complete intro with the drummer boy and European anthem before &quot;Zoo Station&quot;. \nDuring &quot;The Fly&quot; Bono messes up the &quot;Achtung y'all!&quot;-part and has to improvise his way out of it. \nBefore the channel hopping, he thanks the crowd for having them three nights in a row. \n&quot;Until The End Of The World&quot; and &quot;New Year's Day&quot; sound fantastic. \nBono then introduces Larry, who comes forward to hold a little speech before singing &quot;Wild Rover&quot;. \nHe gets a loud cheer from the Dutch crowd. \nThe girl that Bono brings up for &quot;Tryin' To Throw Your Arms Around The World&quot; sings a few lines and even gets a kiss from him.\nAt the end of the song Bono sums it up perfectly by adding &quot;Gonna be alright.. Zoo TV tonight... Everything alright... \na little off-key tonight... that's alright... There's no tomorrow night&quot;. \nThe acoustic set is truly one of the best of the whole tour. \nBono improvises a few lines during &quot;Angel Of Harlem&quot; and &quot;Slow Dancing&quot; makes a very rare appearance. \nThe highlight, however, is the semi-acoustic and extended version of &quot;I Still Haven't Found What I'm Looking For&quot;. \nIt sounds simply amazing. To make it even more superb, Bono sings an extra verse in the middle of the song. \nDuring &quot;Bad&quot; he adds snippets of a song I don't know (anyone?). \n&quot;All I Want Is You&quot; is only about 30 seconds long. &quot;Bullet The Blue Sky&quot; sees more improvisation by Bono. \n&quot;Running To Stand Still&quot; segues beautifully into &quot;Where The Streets Have No Name&quot;. \nAs usual on the Zoo TV tours, &quot;Pride (In The Name Of Love)&quot; features the speech by Martin Luther King. \nUnlike most other Zoo TV bootlegs, this one has the complete video confessionals and the singing Russian cosmonaut \nbefore &quot;Desire&quot;. MacPhisto's speech about the invention of rock-and-roll is very weird. \nHe phones the residence of Queen Beatrix, but (as usual) doesn't get past the receptionist, who promptly hangs up on him. \n&quot;With Or Without You&quot; is rather short, but has the &quot;We'll Shine Like Stars&quot;-part. \n&quot;Love Is Blindness&quot; and &quot;Can't Help Fallin' In Love&quot; end a great show. \nThe bonus tracks on the second disc are taken from the two other nights at Feyenoord Stadium. \nThey're all very rare performances. \nLarry sings The Dubliners' &quot;Dirty Old Town&quot; and Bono improvises some lines during &quot;When Love Comes To Town&quot;. \nOn his debut, MacPhisto sings a few lines from the Dutch song that won the Eurovision song contest in 1975. \nThe second night features some nice surprises as well. \nThe Edge performs &quot;Party Girl&quot; solo for the first time in his life, with a nice birthday song for Bono on top of it. \nAlso included are rare performances of &quot;My Girl&quot; (with improvised lyrics), &quot;I Will Follow&quot; (dedicated to the Paradiso) \nand &quot;Sunday Bloody Sunday&quot;. Bono's birthday show ends with the only-ever performance of Elvis' &quot;Are You Lonesome Tonight?&quot;. \nThe sound is excellent throughout the whole concert. Even the bonus tracks sound very good to excellent. \nIn my opinion this is the best of all Rotterdam 1993 bootlegs.\nDeluxe color cover. Very limited edition. Only 25 copies. This is a bootleg from the Netherlands.\nThis is the original pressing on this label.\n\n\n\n","torrent":{"xt":"urn:btih:19e3a8ea9e450b7c247b01a318fd45e9801ae8a6","amp;dn":"U2+1993-05-11+Rotterdam+%28Apple+Lossless%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19e3a8ea9e450b7c247b01a318fd45e9801ae8a6","infoHashBuffer":{"type":"Buffer","data":[25,227,168,234,158,69,11,124,36,123,1,163,24,253,69,233,128,26,232,166]},"announce":[],"urlList":[]}}