{"title":"Desmond Olivier Dingles Compleat Life And Works Of William Shake","uid":5358502,"size":164729472,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:1a46bf26eba7424b9b3df66dc8a1566d0f62f277&amp;dn=Desmond+Olivier+Dingles+Compleat+Life+And+Works+Of+William+Shake&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"_Slimoo_","files":6,"time":1266023222,"description":"Desmond Olivier Dingle's Compleat Life And Works Of William Shakespeare - Series 01 - Audio Comedy - BBC7 via DVB-T\n6 x 30 Minute Episodes - 128Kbps - Mp3 - Slimoo\n\n\nDesmond Olivier Dingle never was one to hide his light under a bushel: the title of this show was, at his insistence, spelt out in full in the Radio Times billing.  \n\nThe creation of actor Patrick Barlow, Dingle is the more pompous half of the National Theatre of Brent, a renowned two-man touring company: his underling Wallace, who was played by Jim Broadbent, had presumably parted company with him by this point.  \n\nThis series followed on from a book entitled Shakespeare \u0014 The Truth! (adapted for radio in 1993), and aimed to provide a comprehensive survey of all there is to know about the great man (Shakespeare, not Dingle).  Desmond was assisted in his task by the variously inadequate members of the Royal Dingle Company, \n\nCast:\nPatrick Barlow\nJim Broadbent\nDuncan Preston\nKevin Allen\nRobert Austin\nMossie Smith\nRichard E Grant\nKenneth Branagh and Emma Thompson apparently cried off and were replaced by the far superior Lionel Blair\n\n\n\n\n\n\n\nDesmond Olivier Dingle's Compleat Life And Works Of William Shakespeare - S01 - E01\nDesmond Olivier Dingle's Compleat Life And Works Of William Shakespeare - S01 - E02\nDesmond Olivier Dingle's Compleat Life And Works Of William Shakespeare - S01 - E03\nDesmond Olivier Dingle's Compleat Life And Works Of William Shakespeare - S01 - E04\nDesmond Olivier Dingle's Compleat Life And Works Of William Shakespeare - S01 - E05\nDesmond Olivier Dingle's Compleat Life And Works Of William Shakespeare - S01 - E06\n\n.\n\nAudio Format    : MP3\nDuration        : 28mn 1s\nBit rate mode   : Constant\nBit rate        : 128 Kbps\nChannel(s)      : 2 channels\nSampling rate   : 44.1 KHz\nResolution      : 16 bits","torrent":{"xt":"urn:btih:1a46bf26eba7424b9b3df66dc8a1566d0f62f277","amp;dn":"Desmond+Olivier+Dingles+Compleat+Life+And+Works+Of+William+Shake","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a46bf26eba7424b9b3df66dc8a1566d0f62f277","infoHashBuffer":{"type":"Buffer","data":[26,70,191,38,235,167,66,75,155,61,246,109,200,161,86,109,15,98,242,119]},"announce":[],"urlList":[]}}