{"title":"Macbeth(Starring Orson Welles) 1948 Xvid AVI","uid":5343582,"size":1356836864,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1a67c35bbfc2f9af503f05c50fb0ee5b84fe1e46&amp;dn=Macbeth%28Starring+Orson+Welles%29+1948+Xvid+AVI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"2mean2die","files":-1,"time":1265561385,"description":"Macbeth \nShakespeare's tragic tale of the rise and fall of ambitious 12th-century Scottish warrior MacBeth has proven irresistible to filmmakers. Orson Welles was so anxious to transfer the play to the screen that he acceded to the demands of his parent studio, Republic pictures, that he shoot his version of MacBeth in 23 days on standing B-western sets. The result may not be the best-ever cinematic MacBeth, but it's certainly one of the most moody and atmospheric. Director Welles naturally casts star Welles in the title role, with his old radio colleague Jeanette Nolan as Lady MacBeth (her highly stylized performance has been unfairly castigated by purists, but we defy you to take your eyes off her). Dan O'Herlihy plays MacDuff, Roddy MacDowell is Malcolm, and Edgar Barrier the unfortunate Banquo. Erskine Sanford, William Alland and Gus Schilling, veterans all of Welles' masterpiece Citizen Kane, are also prominently featured, as is Welles' daughter Christopher (as one of MacDuff's murdered children). The severe cutting of the original text is compensated for by the addition of a new character, the &quot;Holy Father&quot; (played in Boris Karloff-style makeup by Alan Napier), whose potted Shakespearian speeches help to bridge several continuity gaps. Highlights include MacBeth's tremulous sighting of Banquo's ghost, an extended monologue in which only MacBeth's head is illuminated, and the synthesizer-like interpolations of the three ubiquitous witches. Welles had originally instructed his actors to deliver their dialogue in a thick Scots burr, but this proved so incomprehensible to preview audiences that Republic ordered the film to be completely redubbed. \n\tDirector: Orson Welles\n\tAMG Rating:    \n\tGenre: Drama\n\tMovie Type: Tragedy, Period Film\n\tThemes: Rise and Fall Stories, Rise To Power, Crowned Heads\n\tMain Cast: Orson Welles, Jeanette Nolan, Dan O'Herlihy, \n        Roddy McDowall,    Edgar Barrier\n\tRelease Year: 1948\n\tCountry: US \n\tRun Time: 111 minutes\n","torrent":{"xt":"urn:btih:1a67c35bbfc2f9af503f05c50fb0ee5b84fe1e46","amp;dn":"Macbeth%28Starring+Orson+Welles%29+1948+Xvid+AVI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a67c35bbfc2f9af503f05c50fb0ee5b84fe1e46","infoHashBuffer":{"type":"Buffer","data":[26,103,195,91,191,194,249,175,80,63,5,197,15,176,238,91,132,254,30,70]},"announce":[],"urlList":[]}}