{"title":"Need for Speed Carbon [PAL] [WiiTorrentZ]","uid":5305815,"size":4445386658,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:1a7edbcd2b3ba8fa389233fd624a730fb6e20a89&amp;dn=Need+for+Speed+Carbon+%5BPAL%5D+%5BWiiTorrentZ%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ecabuk","files":-1,"time":1264381995,"description":"NAME: Need for Speed: Carbon\nREGI: PAL\nLANG: ENG\nGENR: Racing &amp; Flying &gt; Car\nSIZE: 4.13GB\n\nProduct Description\nNeed for Speed Carbon Wii What starts in the city is settled in the canyons as Need for Speed Carbon immerses you in the world's most dangerous and adrenaline-filled form of street racing. You and your crew must race in an all-out war for the city, risking everything to take over your rivals' neighborhoods one block at a time. As the police turn up the heat, the battle ultimately shifts to Carbon Canyon, where territories and reputations can be lost on every perilous curve. Represent your car class, your crew, and your turf in Need for Speed Carbon, the next revolution in racing games.\n&gt;Survive the Canyon All-new Canyon Duel and Drift race modes are the ultimate test of skill and nerve, where one wrong turn could cost you more than the race.\n&gt;The City Is Yours for the Taking Race for control of the city block-by-block by taking down rival crews on their turf, then defeat their crew leaders in life-or-death races in Carbon Canyon.\n&gt;Customize Your Dream Cars The revolutionary new Autosculpt car customization tool gives you the power to design and tweak your crew s cars in every way imaginable.\n&gt;Represent a Class Affiliate with the Tuner, American Muscle, or Exotic car classes and prove once and for all who makes the best set of wheels. A new physics model makes each class handle and drive differently.\n&gt;Build Your Crew Strategically choose your crew members and then use their skills on the road and in the garage to help you win races and customize your cars","torrent":{"xt":"urn:btih:1a7edbcd2b3ba8fa389233fd624a730fb6e20a89","amp;dn":"Need+for+Speed+Carbon+%5BPAL%5D+%5BWiiTorrentZ%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a7edbcd2b3ba8fa389233fd624a730fb6e20a89","infoHashBuffer":{"type":"Buffer","data":[26,126,219,205,43,59,168,250,56,146,51,253,98,74,115,15,182,226,10,137]},"announce":[],"urlList":[]}}