{"title":"Trisha Yearwood - It Wasn't His Child  (2nafish)","uid":5219210,"size":162105348,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:1b391f094c37880221091fd004f7ad62373257f4&amp;dn=Trisha+Yearwood+-+It+Wasn%5C%27t+His+Child++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1260868446,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 4000 Kb/s\nAudio: Linear PCM, 48000 Hz, Stereo, 1536 kbps\n\n\nThe Sweetest Gift is a Christmas album by country singer Trisha Yearwood and is her fourth album overall. Yearwood sings a mixture of familiar traditional and popular material, along with more recent compositions such as &quot;It Wasn't His Child&quot; and &quot;There's a New Kid in Town&quot;. Two of its tracks managed to achieve positions near the lower end of the Billboard Hot Country Singles chart: &quot;It Wasn't His Child&quot; peaked at #60, and &quot;Reindeer Boogie&quot; at #63. The album rose to the #17 position in the Country Albums chart. A re-release of the album in 1998 has a different album cover.\n\nYearwood covers a series of Christmas standards in a country music format. The album was a given a positive review by allmusic.com, receiving 4 out of 5 stars.\n\nPatricia Lynn Yearwood, professionally known as Trisha Yearwood (born September 19, 1964) is an American country music artist. She is best known for her ballads about vulnerable young women from a female perspective that have been described by some music critics as &quot;strong&quot; and &quot;confident.&quot;\n\nOriginally discovered by Garth Brooks in the late 1980s, Trisha Yearwood signed with MCA Records in 1990. She came to prominence with her debut single, &quot;She's in Love with the Boy&quot; which became a #1 hit on the Hot Country Singles &amp; Tracks chart in 1991. Her second album release, Hearts in Armor (1992) reflected Yearwood's own personal issues, which won her widespread critical acclaim among music critics and further success in country music. Her later album releases such as, The Song Remembers When (1993), Thinkin' About You (1995), and Everybody Knows (1996) also demonstrated her creative control, featuring collaborations from Rodney Crowell, Willie Nelson, and Garth Brooks.\n\nYearwood also found major success in country radio during much of the 1990s, including with the 1997 song &quot;How Do I Live.&quot; Initially released on the soundtrack of the film, Con Air, the song was also issued on her &quot;greatest hits&quot; compilation entitled (Songbook) A Collection of Hits (1997) and would eventually win Best Female Country Vocal Performance from the Grammy Awards. In addition she would also win accolades from the Academy of Country Music and Country Music Association Awards in 1997 and 1998. Aside from her success in country music, she has also donated her time as a philanthropist, working with Habitat for Humanity and the Make a Wish Foundation. In addition she also set aside a project to release her first cookbook in April 2008 titled Georgia Cooking in an Oklahoma Kitchen, which consisted of southern cooking recipes from Yearwood, her mother, and sister.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:1b391f094c37880221091fd004f7ad62373257f4","amp;dn":"Trisha+Yearwood+-+It+Wasn%5C%27t+His+Child++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b391f094c37880221091fd004f7ad62373257f4","infoHashBuffer":{"type":"Buffer","data":[27,57,31,9,76,55,136,2,33,9,31,208,4,247,173,98,55,50,87,244]},"announce":[],"urlList":[]}}