{"title":"Focus Photoeditor v6.0.16-Fixed [M4n]","uid":5228243,"size":12693146,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1b3d9746602bfecf7e385539481a14a7c2912d01&amp;dn=Focus+Photoeditor+v6.0.16-Fixed+%5BM4n%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dbzfreak778","files":6,"time":1261223120,"description":"Focus Photoeditor is a powerful image and photo editor, picture retouching tool, web album creator, image browser and Photoshop Filters Host Application for Windows. Besides its excellent ability to correct digital photos, it has many rich tools and effects found in much more expensive professional tools. And there are also many tools you can hardly find elsewhere, such as Quick Fix Wizard, Effective and Intelligent Automatic Corrections, Smart Color Replacement and extras like a web-album builder, a batch processor and support for photoshop plugins.. Expand your Creativity, improve your digital photos, create artwork, produce pictures for the web, print your own Cd and MusicCassette covers, prepare logos, paint with the mouse and create professional looking graphics. Focus is the easy-to-use image editor for anyone. Focus Photoeditor is a feature rich graphics and photo editing solution for Painting and Retouching as well as Image Processing. It offers customizable brushes, more than 30 Filters/Effects/Deformations, gradients patterns, painting, magic wand and many other standard and advanced features. Focus Photoeditor also supports layers and offers a light studio to apply effects like Elliptic Hotspot, Supernova and others. \n\nKey features: \nGraphics Formats: All common picture file formats and many others (a total of 30) are supported: \n? Loads: BMP, JPG, GIF, PNG, TIFF, TGA, PCX, ICO, CUR, JPEG2000 \n? also Loads: FAX, G3N, G3F, DIB, RLE, WMF, EMF, TARGA, VDA, ICB, VST, PIX, PXM, PPM, PGM, PBM, WBMP, JP2, JPC, J2C \n? Saves: BMP, JPG, GIF, PNG, TIFF, TGA, PCX, ICO \n? Preserves EXIF and IPTC informations when saving to jpg \n? Easily Navigate through files with the image browser and with projecs previews \n? Acquires from scanner \n? Opens multiple pictures without affecting memory usage \n? Automatic corrections \n? Quick Fix \n? Auto Contrast \n? Auto Stretch \n? Auto Colors (automatic color cast detection) \n? Auto Sharpen \n? Smart Flash \n? Reduce Hilights \n? Clarify \n? Natural Skin and Green tones \n? Auto Rotate Scanned document \n? Remove Noise and Jpeg artifacts \n? Quick Fix Wizard \n? Manual Exposure Correction \n? Gamma &amp; Levels \n? Histogram Stretch \n? Brightness &amp; Contrast \n? Unlinear Contrast \n? Shadows-Midtones-Hilights \n? RGB Curves \n? Manual Color Correction \n? RGB and CMY Color Balance \n? Saturation \n? HLS and HVS \n? Color Temperature \n? Calibrate Colors (Color Cast) \n? Color Replacement \n? Histogram of picture \n? Transformations: Rotate, Flip, Wave, Skew, Whirlpool, Add Borders, 3D Bevel, Drop Shadow \n? Batch Processing \n? More than 50 Built-in Filters \n? Photoshop Plugins support \n? Layers Create complex graphics projects using blend modes \n? Create Selections: many selection tools provided such as: lasso, polygon, magic wand, pencil, all geometric selections: rectangle, ellipse, etc.. \n? Edit and Paint precisely \n? Retouch: change brightness, saturation, contrast, blur and sharpen locally, etc.. \n? Objects Factory: create objects and then layers just copying and pasting text from your word processor. \n? Object Stamp tool \n? Deformer tool \n? Uses Color, Textures, Retouch with all the tools \n? Gradients \n? Prints precisely \n? Web Albums \n\n\n? Improved interface - The program is more intuitive to use, floating windows are now easily managed and can be closed or docked. \n? Formats: Added support for newest cameras. View updated list of supported cameras . \n? Improved speed of several editing and displaying operations \n? Added some photo corrections and improved existing ones. \n? Added &quot;Auto Crop&quot; \n? Paint Engine was improved, now follows the mouse movements more smoothly and precisely \n? Improved &quot;Quick Fix&quot; correction \n? Added Automatic and Manual &quot;Dynamic Range&quot; Correction \n? Corrected many bugs \n? Improved many other features. \n","torrent":{"xt":"urn:btih:1b3d9746602bfecf7e385539481a14a7c2912d01","amp;dn":"Focus+Photoeditor+v6.0.16-Fixed+%5BM4n%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b3d9746602bfecf7e385539481a14a7c2912d01","infoHashBuffer":{"type":"Buffer","data":[27,61,151,70,96,43,254,207,126,56,85,57,72,26,20,167,194,145,45,1]},"announce":[],"urlList":[]}}