{"title":"Missing Persons - Destination Unknown (2nafish)","uid":5242066,"size":113678340,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:1b3e0b54974647c559ca88cb3880daaff5439136&amp;dn=Missing+Persons+-+Destination+Unknown+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1261818098,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nMissing Persons - Destination Unknown (Live-Beat Club) (2nafish)\n\n\n\nDestination Unknown is a single by the new wave band Missing Persons. It was released in 1982 on their album Spring Session M. In the US it was a minor hit spending 13 weeks on the Billboard Hot 100 chart, peaking at #42.\n\nThe Smashing Pumpkins have covered this song; it appears on their 1996 box set The Aeroplane Flies High.\n\nSpring Session M is the debut album by American new wave band Missing Persons, released in 1982. The title of the album is an anagram of the band's name. Tracks from this album: &quot;Words&quot;, &quot;Windows&quot;, &quot;Destination Unknown&quot;, and &quot;Walking in LA&quot; all had videos created and all received heavy play on MTV and AOR and modern rock radio. The group toured and its shows were well attended.\n\nMissing Persons was an American band who played a blend of New Wave music and pop rock. The band was founded in 1980 in Los Angeles by guitarist Warren Cuccurullo, vocalist Dale Bozzio, and drummer Terry Bozzio. They went on to add bassist Patrick O'Hearn and keyboardist Chuck Wild. Dale's quirky voice and heavy makeup made the band a favorite on MTV in the early 1980s.\n\nDale and Terry Bozzio met and married while working with Frank Zappa, and Cuccurullo encountered the pair while contributing to the Zappa album Joe's Garage. O'Hearn was also a former member of Zappa's touring band.\n\nIn 1980 the band made its first record, a 4-song EP entitled Missing Persons, in Zappa's brand-new Utility Muffin Research Kitchen studios; the recording was financed by Cuccurullo's father. The band toured, promoted the EP, appeared in the movie Lunch Wagon, and became a must-see band among the Los Angeles live music crowd. &quot;Mental Hopscotch&quot; was a #1 record on local radio station KROQ, and the self-promoted EP sold 7,000 copies.\n\nTwo years of hard work led up to a signing with Capitol Records in 1982. With label support, the re-released EP sold another 250,000 units, and the new album Spring Session M (an anagram of &quot;Missing Persons&quot;) went gold.\n\nThe singles &quot;Mental Hopscotch&quot;, &quot;Destination Unknown,&quot; &quot;Words,&quot; &quot;Walking in L.A.,&quot; and &quot;Windows&quot; met with varying success, especially in the local markets of Los Angeles, New York, and San Francisco. The visual effects used in the music video for &quot;Words&quot; were unusual for the time, making it popular on the fledgling cable TV channel MTV.\n\nMissing Persons appeared at a three-day Southern California concert known as the US Festival in May 1983, along with Berlin, David Bowie, The Pretenders, U2, and several other performers.\n\nAlthough the band gained new attention by heavy play on MTV and FM rock-radio with the striking music video for &quot;Surrender Your Heart&quot; that was designed by Peter Max, the experimental album Rhyme &amp; Reason (1984) was not a great success, and Capitol was not happy about the direction the band was taking. The band followed up with the more conventional Color In Your Life in June 1986, but during the short-lived promotional tour, increasing tensions between Terry and Dale Bozzio led to the end of the tour, the couple's marriage, and the band.\n\n\nMy Videos: &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:1b3e0b54974647c559ca88cb3880daaff5439136","amp;dn":"Missing+Persons+-+Destination+Unknown+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b3e0b54974647c559ca88cb3880daaff5439136","infoHashBuffer":{"type":"Buffer","data":[27,62,11,84,151,70,71,197,89,202,136,203,56,128,218,175,245,67,145,54]},"announce":[],"urlList":[]}}