{"title":"How Weed Won the West.avi","uid":5387672,"size":40693091544,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:1c43b57255622463ff19a0e29238423ca60e5cea&amp;dn=How+Weed+Won+the+West.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"k_semler","files":1,"time":1266944263,"description":"From the creators of American Drug War the long awaited sequel -How Weed Won the West- now on DVD\n\nWith California and the rest of the country going bankrupt, one business is booming. How Weed Won the West is the story of the growing Medical Marijuana industry, focusing on Los Angeles with over 700 legal dispensaries doling out the buds. Following the story of Organica, a southland dispensary which was raided by state and federal agencies in August of 2009, the film shows that although much has changed with Obama in office, the drug war is nowhere near over. Kevin Booth, producer/director of American Drug War, picks up where the last film left off and continues his fight against the hypocrisy of the War on Drugs. Intended to inform and entertain, this fast paced and even sometimes funny film features Texas conspiracy guru Alex Jones, Ethan Nadelmann head of Drug Policy Alliance, and a host of amazing characters including a former LAPD narcotics officer who now thinks all drugs should be legal.\n\n90 minutes - High Def Color\n\nDirected and narrated by Kevin Booth, Co-Produced by Trae Painter Booth, Special appearance by Alex Jones, Edited by Ryan Kaye, Executive Producer Eric Preven,\n\nEthan Nadelmann, Alex Jones, Craig X Rubin, William Kroger, Theresa Blaylock, Jeff Joseph, Don Duncan, Kyle Kazan, Bret Bogue, Freeway Ricky Ross, Shelly Martinez, T. Rodgers, Darryl Lucky Rodgers, Slipknot-Cory Taylor, DJ Sid, Rudy Reyes, Rev Paul Cody, Dr. Michael Morris, New Jersey Weed Man- Ed Forchion, Richard Eastman, Mac Lindsay, Dr. Edward Alexander, Mary Taylor\n\n\n\nFilmed in the summer and fall of 2009","torrent":{"xt":"urn:btih:1c43b57255622463ff19a0e29238423ca60e5cea","amp;dn":"How+Weed+Won+the+West.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c43b57255622463ff19a0e29238423ca60e5cea","infoHashBuffer":{"type":"Buffer","data":[28,67,181,114,85,98,36,99,255,25,160,226,146,56,66,60,166,14,92,234]},"announce":[],"urlList":[]}}