{"title":"House.of.Games.1987.DVDRip.Xvid-mrpink","uid":5341432,"size":735404032,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1cd7e18338ffd28e28aa0852a24c561cd1f390cf&amp;dn=House.of.Games.1987.DVDRip.Xvid-mrpink&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mrpink51089","files":1,"time":1265492980,"description":"In his directorial debut, Pulitzer Prize-winning playwright David Mamet creates a stylish cinematic puzzle of games within games, as con men are joined by a psychologist in creating the perfect caper. Dr. Margaret Ford (Lindsay Crouse), the writer of psychological self-help books, meets Mike (Joe Mantegna) as she attempts to help a patient who owes heavy gambling debts. When she herself is the victim of a con, she becomes intrigued by the psychological drama of the con game and joins in a complicated scam involving a suitcase of cash. Mamet directs his extremely complicated plot with skill and complete control until it is impossible to tell who is the con and who is the victim. The suspense builds to an amazing surprise ending which is both reasonable and believable but completely unpredictable. Crouse and Mantegna are outstanding as are all the supporting performances. Mamet and his cinematographer Juan Ruiz-Anchia create a visually stunning, compelling film that does justice to Mamet's superbly written screenplay","torrent":{"xt":"urn:btih:1cd7e18338ffd28e28aa0852a24c561cd1f390cf","amp;dn":"House.of.Games.1987.DVDRip.Xvid-mrpink","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1cd7e18338ffd28e28aa0852a24c561cd1f390cf","infoHashBuffer":{"type":"Buffer","data":[28,215,225,131,56,255,210,142,40,170,8,82,162,76,86,28,209,243,144,207]},"announce":[],"urlList":[]}}