{"title":"Office 2003 OGA notifier removal","uid":5384437,"size":729353,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1d61eee2d516f6babb73e5ad95c0fb6a577b22c1&amp;dn=Office+2003+OGA+notifier+removal&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"fisher8251","files":2,"time":1266847059,"description":"With this you can remove the annoying OGA notifications that are generated by KB949810. You actually can remove the whole KB949810 update. How does this work? This torrent just provides the original KB949810 update from MS. They don't offer it on their site you have to look for it in the download folder of automatic updates. (Well in this case I already have done that for you;)). The nice thing of having the original update file is that it's got an uninstall function built in. All you have to do is: \n\n1.\n- Unpack oganotifier.cab with for example Winrar. \n- Right click on oganotifier.msi and do 'remove'. Done :)\n\n\nOr, alternative method:\nRight click on oga unhide.reg . Click 'merge'. OGA notifier will now be visible in 'add/remove programs'. You can uninstall it there.\n\n\nOffcourse the OGA update will keep returning via automatic updates. If you however set them to 'download only' you can unselect the update and it won't return. So you are done until MS comes with something new.\n\n- - - - -\nEDIT: This might also work for Office 2007. I don't know because I didn't test it. My version of Office 2007 is seen as genuine without having to do anything (downloaded from here) I couln't find a version of Office 2003 which was genuine by itself so I did some research and found this method.\n\nEDIT2: I did this with a Dutch version of Windows XP so chances are the update won't work on an English version of Windows. I don't know if there are different language versions of this update/if it matters. Anyway, the alternative method (reg file) should still work.\n","torrent":{"xt":"urn:btih:1d61eee2d516f6babb73e5ad95c0fb6a577b22c1","amp;dn":"Office+2003+OGA+notifier+removal","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d61eee2d516f6babb73e5ad95c0fb6a577b22c1","infoHashBuffer":{"type":"Buffer","data":[29,97,238,226,213,22,246,186,187,115,229,173,149,192,251,106,87,123,34,193]},"announce":[],"urlList":[]}}