{"title":"Paramore - Brick By Boring Brick  (2nafish)","uid":5267198,"size":157919236,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:1da5f87e8e039c68f395b4724858acc7dc69e356&amp;dn=Paramore+-+Brick+By+Boring+Brick++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1262929910,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Brick by Boring Brick&quot; is a song by American alternative rock band Paramore, and the second single from their third album Brand New Eyes.\n\nA live version of the song was performed by the band in September 2009 for MTV Unplugged.\n\nParamore performed an unreleased song live that ties into the lyrics of &quot;Brick by Boring Brick&quot;.\n\nThe music video for &quot;Brick by Boring Brick&quot; was filmed in Los Angeles on October 8, 2009. It was directed by Meiert Avis (New Found Glory, U2).\n\nIn an interview with MTV, bassist Jeremy Davis explained that the band had created a treatment for the video before receiving further ideas from several directors. The video is Paramore's first to not be performance based and some of the members of the band are only seen for a short period of time. It is also their first video to be filmed in front of green screen, and to have &quot;a whole story behind it&quot;, with acting. Guitarist Josh Farro likened the video to the 2006 Spanish fantasy film Pan's Labyrinth. It was originally set to premiere on November 17 on The Hills, but was later postponed. The video was eventually released on Paramore.net on November 23.\n\nThe video features a young, blonde girl who has many similarities to lead singer Hayley Williams. The young girl happily walks through a fairy tale land but as she gets deeper into the fairy tale the atmosphere changes and it suddenly becomes dark and evil. The ending shows the young girl falling into a hole that lead guitarist Josh Farro had been digging throughout the video. Singer Hayley Williams seems to be the narrator of the story while Josh Farro (guitar) digs a &quot;deep hole&quot;, Jeremy Davis (bass) is a knight, Zac Farro (drums) is a robber and Taylor York (guitar) is a gnome.\n\nBrand New Eyes (styled as brand new eyes) is the third studio album by American alternative rock band Paramore, released September 29, 2009 through Fueled by Ramen in the United States and Canada.\n\nThe album was produced by Rob Cavallo and recorded in Hidden Hills, California from January to March, 2009. It topped the charts in many countries across the world including Australia, New Zealand, Ireland and the United Kingdom, making it the band's most successful album to date.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:1da5f87e8e039c68f395b4724858acc7dc69e356","amp;dn":"Paramore+-+Brick+By+Boring+Brick++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1da5f87e8e039c68f395b4724858acc7dc69e356","infoHashBuffer":{"type":"Buffer","data":[29,165,248,126,142,3,156,104,243,149,180,114,72,88,172,199,220,105,227,86]},"announce":[],"urlList":[]}}