{"title":"Terminator Salvation Complete Dvd Iso","uid":6310104,"size":4681431040,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1e6183bf5e2c7494469c3641bb6e7a1e23b06baa&amp;dn=Terminator+Salvation+Complete+Dvd+Iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Reaphesitation","files":1,"time":1302505906,"description":"This is an iso file. Browse for the image file and burn to a dvd r or dvd r dl disk with such programs as roxio or imgburn. Once complete, just play on a dvd player, xbox 360, Ps3, ect. This is the complete dvd with previews, main menu, and includes different languages. Good Luck! :p\n\n\n\n\n\n\n\nStoryline\nIn 2003, in the Longview State Correctional Facility, the criminal Marcus Wright that is in the death row is convinced by the cancerous Dr. Serena Kogan to donate his body to her research and he accepts. In 2018, after an unsuccessful attack to a Skynet facility, only John Connor survives, but he discovers that Skynet is developing the powerful new model T-800. Out of the blue, Marcus appears naked and with amnesia in the location. Marcus befriends the teenager Kyle Reese and the girl Star that help him to survive to lethal machines and they travel together in a Jeep. Meanwhile the resistance discovers a signal that might turn-off the machines and John offers to test it. When Kyle is captured by a machine and brought to the Skynet headquarter, Marcus decides to help the youngster and heads to Skynet; on the way, he saves Blair Williams that suggests him to meet John Connor first. But Marcus steps on a mine and is submitted to a surgery, when a secret about his origins is disclosed. Written by Claudio Carvalho, Rio de Janeiro, Brazil  \n\nPlot Summary | Plot Synopsis\nPlot Keywords: Machine | Future | Army | Death Row | Scarface  | See more Ã‚Â»\nTaglines: The End Begins See more Ã‚Â»\nGenres: Action | Drama | Sci-Fi | Thriller\nMotion Picture Rating (MPAA)\nRated PG-13 for intense sequences of sci-fi violence and action, and language.; Rated R for some violence and brief nudity. (director's cut) See all certifications Ã‚Â»\nParents Guide: View content advisory Ã‚Â»\nEdit\nDetails\nOfficial Sites: InterCom [Hungary] | Sony Pictures [Japan] | See more Ã‚Â»\nCountry: USA | Germany | UK | Italy\nLanguage: English | Italian\nRelease Date: 21 May 2009 (USA) See more Ã‚Â»\nAlso Known As: T4: Salvation See more Ã‚Â»\nFilming Locations: Albuquerque Studios - 5650 University Boulevard SE, Albuquerque, New Mexico, USA See more Ã‚Â»\nBox Office\nBudget: $200,000,000 (estimated)\nOpening Weekend: $51,943,726 (USA) (24 May 2009) (3530 Screens)\nGross: $372,046,055 (Worldwide) (13 September 2009)\nSee more Ã‚Â»\nCompany Credits\nProduction Co: Halcyon Company, The, Wonderland Sound and Vision See more Ã‚Â»\nShow detailed company contact information on IMDbPro Ã‚Â»\nTechnical Specs\nRuntime: 115 min  | 118 min (director's cut)\nSound Mix: SDDS  | Dolby Digital  | DTS\nColor: Color (Technicolor)\nAspect Ratio: 2.35 : 1\nSee full technical specs Ã‚Â»\n MOVIEmeter: Down 5% in popularity this week. See why on IMDbPro\nEdit\nDid You Know?\nTrivia\nBeing Released in 2009, Terminator Salvation marks the 25th Aniversary of The Terminator See more Ã‚Â»\nGoofs\nErrors made by characters (possibly deliberate errors by the filmmakers): Marcus Wright's accent drops momentarily when he is chained up and the actor's native Australian accent comes through. See more Ã‚Â»\nQuotes\n[first lines] \nDr. Serena Kogan: Marcus. How are you? \nMarcus Wright: Ask me in an hour.\nSee more Ã‚Â»\nConnections\nReferenced in Spike's Guys Choice (2009) See more Ã‚Â»\nSoundtracks\n&quot;Rooster&quot; \nWritten by Jerry Cantrell\nPerformed by Alice in Chains\nCourtesy of Columbia Records\nBy Arrangement with Sony Music Entertainment See more Ã‚Â»","torrent":{"xt":"urn:btih:1e6183bf5e2c7494469c3641bb6e7a1e23b06baa","amp;dn":"Terminator+Salvation+Complete+Dvd+Iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e6183bf5e2c7494469c3641bb6e7a1e23b06baa","infoHashBuffer":{"type":"Buffer","data":[30,97,131,191,94,44,116,148,70,156,54,65,187,110,122,30,35,176,107,170]},"announce":[],"urlList":[]}}