{"title":"8 Mile[2002]DvdRip - Experiencia","uid":5222487,"size":734013472,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1f5c05c05e308bc5c109bae3329687db2bf44042&amp;dn=8+Mile%5B2002%5DDvdRip+-+Experiencia&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Experiencia","files":2,"time":1260985575,"description":"Hi im Experiencia, im new to uploding here, hope you like it:\n\n\n---------------------------------------------------------------------------------\nNo matter who we are, no matter where we live, we're all bound by borders. Many of us are content to live within these borders--others are simply forced to exist within them. But some of us need to break out, burst through, even if what is on the other side is both frightening and unknown. From this comes the tale of one young man's dilemma as he navigates his way through his colliding worlds. Set against Detroit's hip-hop scene in 1995, Jimmy Smith Jr., a young white rapper, struggles to find his voice. The people of Detroit know 8 Mile Road as the city's perimeter. It is also a psychological dividing line between urban and suburban, between black and white, between where Jimmy is and where he wants to be. Here, survival is key, and for many, the emotional life preserver is hip hop. In the absence of nurturing parents, Jimmy and his friends--cool and charasmatic Future, optimistic dreamer Sol, aspiring activist DJ Iz and slow but steady Cheddar Bob--have created their own family. Jimmy and his &quot;crew&quot; (Three One Third), live on hopes of getting their &quot;big break&quot; while struggling to eke out a living at their dead end day jobs. At night, they feed their dreams in the hip hop clubs where the city's best rappers battle each other with abusive rhymes that are wielded like weapons. Here, words are meant to wound and victory belongs to the quick-witted. \n\n\n\n\n\nGenres:\tDrama and Musical/Performing Arts\nRunning Time:\t1 hr. 58 min.\nRelease Date:\tNovember 8th, 2002 (wide)\n\n\n\nIF u liked it check other great torrents from me!","torrent":{"xt":"urn:btih:1f5c05c05e308bc5c109bae3329687db2bf44042","amp;dn":"8+Mile%5B2002%5DDvdRip+-+Experiencia","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f5c05c05e308bc5c109bae3329687db2bf44042","infoHashBuffer":{"type":"Buffer","data":[31,92,5,192,94,48,139,197,193,9,186,227,50,150,135,219,43,244,64,66]},"announce":[],"urlList":[]}}