{"title":"Firewall(multi-Subs 6)(2Lions-Team)","uid":5433144,"size":4682077878,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:2083edc7fc3fd50301d6a538ad092f1cf6c7c803&amp;dn=Firewall%28multi-Subs+6%29%282Lions-Team%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"JUULTJE","files":-1,"time":1268497653,"description":"Firewall (2006) \n\nVerenigde Staten\nThriller / Actie\n105 minuten\n\ngeregisseerd door Richard Loncraine\nmet Harrison Ford, Paul Bettany en Virginia Madsen\n\nComputerveiligheidsexpert Jack Stanfield heeft voor de Landrock Pacific Bank het veiligheidssysteem ontwikkeld. Dit systeem kan slechts op ÃƒÂ©ÃƒÂ©n manier gekraakt worden, namelijk door Jack zelf. Crimineel Bil Cox heeft het leven van de familie Stanfield voor maanden geobserveerd en ontvoert vervolgens Jacks vrouw en kinderen in hun eigen huis, zijn eis: Jack moet $100 miljoen stelen van zijn eigen werkgever. Om zijn gezin te redden probeert Jack een zwakke plek in zijn eigen beveiligingssysteem te vinden.\n\nEngels\n\n\nJack Stanfield is a bank's security chief who has designed a computer system &amp; firewall to protect his employer from fraud. One day, after being introduced to a man named Bill Cox who is interested in working with Jack on a security project, Jack finds himself ambushed and staring down a gun barrel. The man holding the gun is Cox. When Jack arrives home the motive for the meeting becomes clear: Cox &amp; his gang of violent, psychopathic thieves want Jack to hack through his employer's computer security &amp; transfer $100 million to Cox's bank accounts in the Caymans. Failure to comply means the murder of Jack's family. Stanfield realizes this will implicate him as an embezzler but he complies. However, even after Cox has the money, it becomes obvious that he had no intention of letting anyone live and kidnaps the family to kill them &amp; hide their bodies, leaving one of his henchman to eliminate Jack. When Jack kills the thug who was supposed to kill him, the sociopathic Cox's plans are ruined. Jack must race against time to get his family back before Cox and his fellow thugs carry out their murderous plans.\n\nWeblink http://www.imdb.com/title/tt0408345/\nWeblink http://www.moviemeter.nl/film/33685\n\nVideo                 : DVD RIP\nAudio                 : Engels Italiaans\nSubs                  : Nederlands Engels Italiaans Arabisch Hebreeuws IJslands \nSlechthorenden        : Engels Italiaans\nID                    : 0xE0\nFormat                : MPEG Video\nFormat version        : Version 2\nBit rate mode         : Variable\nWidth                 : 720 pixels\nHeight                : 576 pixels\nDisplay aspect ratio  : 16:9\nFrame rate            : 25.000 fps\nStandard              : PAL\nCover                 : Yes\n\n*****************************************\n\nBrought to you by Juultje\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n\n                          &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt;\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n\t\t\n\n\n","torrent":{"xt":"urn:btih:2083edc7fc3fd50301d6a538ad092f1cf6c7c803","amp;dn":"Firewall%28multi-Subs+6%29%282Lions-Team%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2083edc7fc3fd50301d6a538ad092f1cf6c7c803","infoHashBuffer":{"type":"Buffer","data":[32,131,237,199,252,63,213,3,1,214,165,56,173,9,47,28,246,199,200,3]},"announce":[],"urlList":[]}}