{"title":"Sex, Power, Conflict- Evolutionary and Feminist Perspectives","uid":5277885,"size":22801537,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:20aaffed9e5605e458b4fdd2b153a8759f0a2bdb&amp;dn=Sex%2C+Power%2C+Conflict-+Evolutionary+and+Feminist+Perspectives&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"lookeasii","files":-1,"time":1263441055,"description":"Sexual harassment in the workplace, date rape, and domestic violence dominate the headlines and have recently sparked scholarly debates about the nature of the sexes. Concurrently, the scientific community is conducting research in topics of sex and gender issues. \n\nIndeed, more research is being done on the topics of sexual conflict and coercion than at any other time in the history of the social sciences. Despite this attention, it is clear that these issues are being addressed from two essentially different perspectives: one is labeled &quot;feminist&quot;, while the other, viewed as antithetical to the feminist movement, is called &quot;evolutionary psychology&quot;, which emphasizes the history of reproductive strategies in understanding conflict between the sexes. \n\nThis book brings together leading experts from both sides of the debate in order to discover how each could offer insights lacking in the other. The editors' overall goal is to show how the feminist and evolutionary approaches are complementary despite their evident differences, then provide an integration and synthesis. In fact, several of the contributors to this unique volume consider themselves advocates of both approaches. As a stimulating presentation of the dynamics of sex, power, and conflict--and a pioneering rapprochement of the diverse tendencies within the scientific community\n\n-- this book will attract a wide audience in both psychology and women's studies fields.","torrent":{"xt":"urn:btih:20aaffed9e5605e458b4fdd2b153a8759f0a2bdb","amp;dn":"Sex%2C+Power%2C+Conflict-+Evolutionary+and+Feminist+Perspectives","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20aaffed9e5605e458b4fdd2b153a8759f0a2bdb","infoHashBuffer":{"type":"Buffer","data":[32,170,255,237,158,86,5,228,88,180,253,210,177,83,168,117,159,10,43,219]},"announce":[],"urlList":[]}}