{"title":"Dancing Stage Hottest Party [PAL] [WiiTorrentZ]","uid":5358543,"size":942264483,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:20dd544ce093017ed8f158eaf6eaa5a88cb21140&amp;dn=Dancing+Stage+Hottest+Party+%5BPAL%5D+%5BWiiTorrentZ%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"ecabuk","files":-1,"time":1266024954,"description":"NAME: Dancing Stage Hottest Party\nREGI: PAL\nLANG: MULTI-5\nGENR: Music &amp; Dancing\nSIZE: 0.89GB\n    \nProduct Description:\nDancing Stage fans eagerly awaiting a Wii version can now rest at ease as their wish has finally been granted. Featuring over 50 tracks spanning some four decades of music, there's a huge variety of tunes for players to strut their stuff to.\n\nThanks to the compatibility of the Wii Remote and the Nunchuk, a whole new dimension has been added to Dancing Stage: Hottest Party. Total body interaction is now possible during the game using the twin controllers and it is now possible to have four-player simultaneous play to really get everyone involved. It is also possible to send obstacles to rival players in the Battle Mode using the Wii Remote and a well placed swipe!\n\nThere are a host of new modes focusing on the multiplayer element to ensure that the Dancing Stage experience stays fresh for many months to come. New gameplay twists and a host of entertaining minigames complement the main dancing action and offer a different challenge to expert players.\n\nThe phenomenally popular Workout Mode from other versions of Dancing Stage is here again and players also have the opportunity to customise their own dance steps in the Edit Mode to make bespoke routines a possibility!\n\nWith only half of the songs available at the start, the emphasis is on the players to practice and perfect their skills as there are a huge amount of unlockable bonuses in the game from the extra songs through to new computer player challenges and new outfits.\n\n    * Over 50 tracks from the last four decades of music\n    * Total body interaction using the Wii Remote and Nunchuk\n    * Four-player simultaneous play\n    * Workout mode to help you get in shape\n    * First Dancing Stage title for Nintendo Wii","torrent":{"xt":"urn:btih:20dd544ce093017ed8f158eaf6eaa5a88cb21140","amp;dn":"Dancing+Stage+Hottest+Party+%5BPAL%5D+%5BWiiTorrentZ%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20dd544ce093017ed8f158eaf6eaa5a88cb21140","infoHashBuffer":{"type":"Buffer","data":[32,221,84,76,224,147,1,126,216,241,88,234,246,234,165,168,140,178,17,64]},"announce":[],"urlList":[]}}