{"title":"The.Spy.Next.Door.With.SAMPLE-GPB2008","uid":5349808,"size":687843110,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:21c613f6b721c37f22e08acf551f10446129a1d9&amp;dn=The.Spy.Next.Door.With.SAMPLE-GPB2008&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"GPB2008","files":-1,"time":1265749728,"description":"This is The CN DVDrip Video.. Cropped To Hide The Chinese Subtitles, Muxed With The Cam Audio From TA... Thanks To Both ... Enjoy All!!\n\n\n\nBob Ho, a Chinese spy working with the CIA to stop a man named Poldark. He's been posing as an importer and has been dating his neighbor, Gillian, a single mother with 3 children. When Bob captures Poldark, he retires from the spy game. He wants to make a commitment to Gillian but her children are not exactly warming up to him. When Gillian has to go out of town Bob offers to take care of the kids while she's away, which proves to be no easy task. At the same time, Poldark somehow escapes. It's apparent that some in the Agency helped him. At the same time Colton one of Bob's associates at the CIA asks him to look at something that Poldark had on him that appears to encrypted, hoping he can crack it.When the children break into his home to see what they can find out about him, they find the file and download it. And when they try to open it, Poldark tracks it down and sends his people to take care of Ho. Bob manages to deal with them and then takes the children and goes on the run.\n\nPlease Comment ... Seed ... ENJOY!!!","torrent":{"xt":"urn:btih:21c613f6b721c37f22e08acf551f10446129a1d9","amp;dn":"The.Spy.Next.Door.With.SAMPLE-GPB2008","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21c613f6b721c37f22e08acf551f10446129a1d9","infoHashBuffer":{"type":"Buffer","data":[33,198,19,246,183,33,195,127,34,224,138,207,85,31,16,68,97,41,161,217]},"announce":[],"urlList":[]}}