{"title":"The.Wolfman.2010.TS.H264","uid":5374387,"size":314466545,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:21cf3ed2a607d0309787d66d1b2e451daed3546f&amp;dn=The.Wolfman.2010.TS.H264&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"twentyforty","files":2,"time":1266525376,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0780653&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0780653&lt;/a&gt;\n\nRelease Date: 17 February 2010\nGenre: Horror | Thriller\nIMDB Rating:6.6/10 6,461 votes\nDirected By: Joe Johnston\nStarring: Emily Blunt, Benicio Del Toro, Anthony Hopkins\n\nPlot: Upon his return to his ancestral homeland, an American man (Del Toro) is bitten, and subsequently cursed by, a werewolf.\n\nSAMPLE is included. Download it first, then decide.\n\n *** Small-sized 2-pass re-encode of TS (CAM video+Line audio) for computers (PC, Mac), PS3 or Xbox, portable and mobile devices (Ipod, Itouch) . ***\n*** Video is 480x272 H264; audio is 44.1 kHz/stereo AAC LC and container is MP4. ***\n\nI recommend CoreCodec for H264 (avc1, x264) video-playback, free DivX 7 for AAC sound-playback (and .mkv with AAC), Haali splitter (free, comes with CoreCodec) as the fastest and best combination for Windows Media Player. This is what I use.\nVLC player (free), mplayer (free) and KMplayer (free) are available as alternative for all platforms (operating systems) out there and have BUILT-IN codecs and MP4 capabilities. But, video quality is approx. 10-15% lower, blurrier at least on system I have.\nOne can try CCCP matroska codec pack, where ffdshow codec/filter packs and Haali splitter comes in one package and support MP4 playback - but extra caution is required during the install process.\nQuickTime of course, supports H264/AAC natively.\nPS3 + HDMI cable + newer TV have been reported as best combination.\nAnd please, do not watch it with a nose in the screen, take proper distance to the monitor or TV (as advised in TV manuals).Many of movies I encode have embedded subtitles. So far, only VLC player is able to use them correctly.\n\n&quot;Home&quot; of my torrents (for Bookmark/Favorites in your browser) &lt;a href=&quot;\nhttp://thepiratebay.se/user/twentyforty&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/twentyforty&lt;/a&gt;\n\n*************************************************************************************************************************************\nPlease, do not make my work (and life) harder than already is.\nBy choosing small-file for download, you already saved, right?\nThere is no need to LIMIT your upload to others, I cannot allow that.\nYou all have been warned many times, on different ways.\nYou cannot screw my system up, Maybe temporarily or once, but you would be at lost, at the end.\n\nDo not: use foul language in your comments. Read, however, everything written.\nDo not post stupidities.\nDo not judge as bad neither me or my work, fact is - you don't know me.\nInternet is a Big place, if you're not satisfied with my torrents or my work - silently go away. No harm would be done.\nI do not care if you do not show respect. Simple as that.\n\nRemember, I have something, you want that. You can get it, under my terms. No exceptions.\nIf you don't care; I repeat, I do not care. Go someplace else.\n","torrent":{"xt":"urn:btih:21cf3ed2a607d0309787d66d1b2e451daed3546f","amp;dn":"The.Wolfman.2010.TS.H264","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21cf3ed2a607d0309787d66d1b2e451daed3546f","infoHashBuffer":{"type":"Buffer","data":[33,207,62,210,166,7,208,48,151,135,214,109,27,46,69,29,174,211,84,111]},"announce":[],"urlList":[]}}