{"title":"StampCat [final version]","uid":5224165,"size":8326465,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:2241353b984ecb2c681075432849a0fb9c575997&amp;dn=StampCat+%5Bfinal+version%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"flixonase","files":4,"time":1261010220,"description":"StampCat version 9.10\n\nStampCAT is a powerful stamp collector database program that helps you catalog and manage of your stamp collection. StampCAT will help you monitor what you have, where it is, and the total value of your collection. StampCAT has a comprehensive set of data fields, enabling you to register information as detailed as you want: country, catalog number, face value, date of issue, design, topic, color, perforation, condition, watermark, postmark (type, city and date), purchase date, location, price, market value, quantity, your own notes, and more. Other features include customized entry fields, a loan module, flexible searching, a report designer, more than 50 pre-defined report formats, a HTML generator, a sample data base to get you started, pop-up menus for quick feature access and navigation, and comprehensive context-sensitive on-line documentation available at the touch of a button.\n\nFeatures:\n Store information about an unlimited number of stamps\n Change the data field names to suit your personal preferences\n Register most information, such as country and catalog, only once.\n Comprehensive set of data fields enabling you to catalog a wide range of information\n 14 custom data fields (in case we have missed something)\n Add personal notes\n Store stamp images\n Use StampCAT Explorer to browse your collection\n Search in all fields with any combination of key words and operators (and, or, etc.)\n Use the search and replace function to search for a specific word or number and replace it with another\n Sort data by any field with up to five sort levels\n Create your own reports with exactly the layout you want, or use one of the more than 50 pre-defined reports\n Preview reports on screen before printing\n Save reports in virtually any file format: Adobe Acrobat, Excel, HTML, JPEG, Lotus 1-2-3, Quattro Pro, or RTF\n Use the HTML Generator to quickly generate documents to be published on the Internet\n Analyze your collection in a variety of ways with the statistics module\n Export data to ASCII text files to bring the information into other applications\n Backup your valuable data with the backup/restore module","torrent":{"xt":"urn:btih:2241353b984ecb2c681075432849a0fb9c575997","amp;dn":"StampCat+%5Bfinal+version%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2241353b984ecb2c681075432849a0fb9c575997","infoHashBuffer":{"type":"Buffer","data":[34,65,53,59,152,78,203,44,104,16,117,67,40,73,160,251,156,87,89,151]},"announce":[],"urlList":[]}}