{"title":"Trapped TVRip - Season 1","uid":5421433,"size":4671614590,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:22dbd4aa2d9c889550d0812b047dde5f08be9ae3&amp;dn=Trapped+TVRip+-+Season+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"opxau","files":29,"time":1268098680,"description":"Trapped - 2008 Australia\n                                  \nDuration: 10:29:30\nEpisodes: 26\nIMDB: http://www.imdb.com/title/tt1343302/\nVideo Details: 720x400 H.264 910kbps 25.000fps\nVideo Source: 720x576 MPEG-2\nAudio Details: English, Vorbis 48000khz 2.0ch 80kbps\nAudio Source: MPEG-1 Audio Layer II (MP2) 48000khz 2.0ch 256kbps\nSize: 4.35GB (4671605887 bytes)\n\nTrapped is the story of a group of ordinary kids thrust into an extraordinary situation, when they are left alone, struggling to survive, at a remote scientific research station. For some of the kids, the research base already seems like a prison. No stretch of beautiful sand beach or warm turquoise sea is going to make up for being away from the &quot;real world&quot;. For others, it's a coral paradise they are free to explore and enjoy, without having to share it with any tourists. And there's always the thrill of knowing that the work their parents are doing over on the research island is not only top secret but incredibly important for humankind. Then one day a stranger and his son fly in. The man flashes his i.d card and heads over to the island research base, promising his reluctant passenger that he'll be back by dark, and they'll be out of there. Only he doesn't come back. And neither does anyone else. As the days pass, and there's no news, the kids come to realize that whatever has happened on the island has left them on their own, with no communications, two thousand kilometers from anywhere. Their only choice is to rely on their own resources to survive until they can find out what's happened to their parents, and uncover the terrible secret that is behind the Eden Project. And, at the same time, cope with all the usual challenges of growing up: Friendship, First love &amp; Families. For, as the days pass, one thing becomes very clear: unless they find out the truth, they will probably be here forever. In addition, someone, or something, is watching them from the bushes!","torrent":{"xt":"urn:btih:22dbd4aa2d9c889550d0812b047dde5f08be9ae3","amp;dn":"Trapped+TVRip+-+Season+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22dbd4aa2d9c889550d0812b047dde5f08be9ae3","infoHashBuffer":{"type":"Buffer","data":[34,219,212,170,45,156,136,149,80,208,129,43,4,125,222,95,8,190,154,227]},"announce":[],"urlList":[]}}