{"title":"Puddle Of Mudd - Spaceship  (2nafish)","uid":5234336,"size":123398148,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:22f0f306677458c9991747878b68c2efd37b3fac&amp;dn=Puddle+Of+Mudd+-+Spaceship++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":1,"time":1261473613,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nSpaceship is the first single by the post-grunge band Puddle of Mudd from their album Volume 4: Songs in the Key of Love &amp; Hate. The music video premiered on Yahoo Music on November 16, 2009.\n\nThe video directed by Petro (The Academy Is, Rufus Wanwright) channels the best in space travel with alien strippers and an homage to Star Wars and its scrolling text intro. Rounding out the rockstar antics are the daredevils of Nitro Circus, including Travis Pastrana on his signature dirtbike.\n\nPuddle of Mudd is an American rock band from Kansas City, Missouri. They achieved success on rock radio and some success in the mainstream, and their major-label debut Come Clean has sold over 5 million copies. To date the band has sold over 7 million albums, and have had a string of #1 mainstream rock singles in the U.S. They have released 2 independent and 4 major albums, with their latest being Volume 4: Songs in the Key of Love &amp; Hate in December of 2009.\n\nVolume 4: Songs in the Key of Love and Hate is the fourth major label studio album from U.S. post grunge band Puddle of Mudd. It was released on December 8, 2009, on Flawless Records.\n\nIn Spring 2009, the band began recording sessions in Vancouver with Famous producer Brian Howes. Recording in a three part, three week session in Canada initially because of extensive touring duties. Afterwards the band relocated to Hollywood, California for 3 weeks for additional production with producer and engineer Brian Virtue and Come Clean and Life on Display producer John Kurzweg. Their first time together in 6 years. Puddle of Mudd announced through their MySpace and follow-up interviews that the album had finished production and was currently in mixing. Bassist Doug Ardito announced that the disc will only contain 10 songs to avoid what he called &quot;filler material&quot; and to have new listeners focus more on non-single songs. Around 21 songs were worked on during production, and widdled down to 10 to 12 tracks according to singer Scantlin. The record is expected to contain more edgier, punk rock, similar to earlier releases according to singer Wes Scantlin. Puddle of Mudd has announced that &quot;Vol. 4 Songs in the Key of Love and Hate&quot; has a release date set for December 8 and a new single named &quot;Spaceship&quot; is now available at digital stores.\n\nThe album art was revealed on October 26, 2009, on their official site.\n\nThe track &quot;The Only Reason&quot; was a bonus track titled &quot;Reason&quot; from the Famous sessions.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:22f0f306677458c9991747878b68c2efd37b3fac","amp;dn":"Puddle+Of+Mudd+-+Spaceship++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22f0f306677458c9991747878b68c2efd37b3fac","infoHashBuffer":{"type":"Buffer","data":[34,240,243,6,103,116,88,201,153,23,71,135,139,104,194,239,211,123,63,172]},"announce":[],"urlList":[]}}