{"title":"POTHS - Conspiracy Theory - Part 16 - Secret Societies","uid":5445498,"size":1388098765,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:23e9b1f6598e6625e419e1896cf80af348d68c88&amp;dn=POTHS+-+Conspiracy+Theory+-+Part+16+-+Secret+Societies&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"11jf11","files":63,"time":1268959930,"description":"POTHS - Pointing Out The Hellish Scumbags - POTHS - Pointing Out The Hellish Scumbags - POTHS\n\n\n\n1-27-2010 Washington DC     The State of The Union Speech by President (still to be determined)Barack HUSSEIN Obama (aka Barry Soetoro, Obama's real name.) I must admit that President Obama is the Finest Public Speaker I have ever heard. The Bible says the Antichrist will be the most elegant Speaker you have ever heard. It also says that more than anything in End Times Prophecies as spoken by Jesus Christ is that almost everyone will be deceived by the AntiChrist. He spoke this more than any other topic when talking about his Second Coming. DO NOT BE DECEIVED. Obama is a LIAR. Here is the Alex Jones Documentary called, The Obama Deception. Here are all the LIES that he tried to sell us during the Election. This movie was released 30 days after he took office which means most of it was filmed before Obama was even sworn in. Look how much was predicted in this movie.\n\nHe even tried to sell us on GLOBAL WARMING again. Even after &quot;climategate&quot; exposed that Global Warming from Co2 is a hoax. The UN Scientists now admit they cooked the books. Obama stood right up lied to us last night over and over. Have you already forgotten all his broken campaign promises? OBAMA Even said He did not want the Banker Bailout,,,,BULLSHIT!!!! OBAMA IS A LIAR. Here is the PROOF one more time.  The Obaaaama Deception is also in Part 11. If Obama was a wooden puppet and not a flesh and blood puppet his Nose would reach from Washington to Kenya.\n\nSeed Long and Prosper from the Blessings of Our Father. I have ask the Father to Bless all that SEED Long.","torrent":{"xt":"urn:btih:23e9b1f6598e6625e419e1896cf80af348d68c88","amp;dn":"POTHS+-+Conspiracy+Theory+-+Part+16+-+Secret+Societies","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23e9b1f6598e6625e419e1896cf80af348d68c88","infoHashBuffer":{"type":"Buffer","data":[35,233,177,246,89,142,102,37,228,25,225,137,108,248,10,243,72,214,140,136]},"announce":[],"urlList":[]}}