{"title":"ActiveFarver","uid":5222218,"size":9642734,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:2465d2550fc07fc13ec717d9d6035b24152d24c8&amp;dn=ActiveFarver&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"halo2suger","files":5,"time":1260978228,"description":"ActFax has been designed for network-wide transmission and receipt of fax messages, as well as sending and forwarding fax messages by email. The software runs on any Windows version from Windows 95 or higher and also supports terminal servers. Due to the client/server architecture of ActFax, all data is stored centralized on the fax server. With the integrated fax client and the ActFax printer driver, faxing from any standard application is as easy as printing. For the integration of the fax service into own applications, ActFax offers various standardized interfaces. Due to the intuitive user interface, the installation and configuration of ActFax is done in just a few minutes. Since ActFax automatically detects and configures the available hardware, the fax server is ready for operation right after the installation. ActFax is also available for free download through the download area for in-depth testing.\n\nFeatures:\n# Terminal Server and Citrix support\n# Complete client/server architecture\n# Centralized data storage on the fax server\n# Data access from every workplace in the network\n# Sophisticated user, group and security concept\n# Support of all common fax modems (fax class 1, 1.0, 2 and 2.0), ISDN adapters and Brooktrout/Cantata and Intel/Dialogic fax boards (list of recommended modems)\n# Support of V.34 Fax (Super G3) for transfer rates of up to 33,600 bps\n# Support of VoIP/FoIP (Voice over IP/Fax over IP) with Eicon &quot;Diva Server SoftIP&quot; software\n# Support of Venali Web Fax Service\n# Unlimited number of fax lines (modems)\n# Faxing and emailing from any Windows application through native printer driver\n# Faxing and emailing from UNIX and Linux through LPD/LPR, FTP, TFTP and RAW-TCP-Port connections as well as import from the file system\n# Automatic routing of received fax messages with extension numbers (DDI, MSN, DID), station id (CSID) and line routing\n# Automatic printing of received fax messages and sending reports on different printers per user\n# Automatic forwarding of fax messages by email, also to multiple email addresses\n# Automatic export of fax messages\n# Support of the file formats PDF, Tiff, Multipage Tiff, GIF and BMP for email attachments and document export\n# Automatic definition of fax parameters (fax number, subject, priority, etc.) for fully automated fax messages from own applications through data fields\n# Formatting of fax messages from non-Windows operating systems with printer commands of HP-LaserJet (PCL), Epson-LQ, Postscript and PDF\n# Automatic archiving of fax messages\n# Central and private phone books\n# Direct access to Outlook and Exchange address books\n# Cover pages and overlays\n# Data exchange with external database tables through ODBC\n# Fax on Demand server and client (fax polling)\n# Least Cost Routing and automatic delayed fax transmissions\n# Email transmission through SMTP with direct Internet connections or RAS dialup connections\n# Support of HP Digital Sender 9100C and Xerox Workcentre series\n# Economical utilization of available resources for low hardware requirements\n# Automatic hardware detection and configuration by the setup program","torrent":{"xt":"urn:btih:2465d2550fc07fc13ec717d9d6035b24152d24c8","amp;dn":"ActiveFarver","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2465d2550fc07fc13ec717d9d6035b24152d24c8","infoHashBuffer":{"type":"Buffer","data":[36,101,210,85,15,192,127,193,62,199,23,217,214,3,91,36,21,45,36,200]},"announce":[],"urlList":[]}}