{"title":"X-MIX THE DVD COLLECTION PART 1","uid":5318196,"size":6728511827,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:25394d161cbdea1e2f4d7f66d5a93b42347d0a09&amp;dn=X-MIX+THE+DVD+COLLECTION+PART+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"MossadUK","files":-1,"time":1264781270,"description":"*****************************\n\n\nPlease continue to seed.       MossadUK.\n\n\n*****************************\n\nX-MIX THE DVD COLLECTION PART 1  \n\nX-Mix 1,2 &amp; 2 make up the part 1 dvd compilation. \n\nRipped from master dvd.  \n\nDevelopers !K7 Studio appear to have compiled the dvd collection from the original VHS releases. \n\nThe most innovative artists and DJs, the cutting edge of computer animation - this was the X-Mix concept. The beginning of the legendary series in 1993 saw the visualisation of techno begin to sweep into 3D. Mixed by a young Paul van Dyk, the MFS-Trip is a journey into inner spaces, imaginary dimensions and symbolic landscapes set to a soundtrack of landmark trance tunes from the pioneering Berlin label. The setlist of classics includes Humate's Love Stimulation, Visions of Shiva's How Much Can You Take and Microglobe's High On Hope. \nFrom inner space to outer space on Destination Planet Dream. The mix was Laurent Garnier's unique meltdown of house and acid, trance and Detroit techno - including legendary tunes from Kenny Larkin, Derrick May, Dave Angel and Garnier himself. The animations were Out There - unfolding into visions of a digital future somewhere beyond gravity's rainbow.\nOn Enter: Digital Reality, Richie Hawtin and John Acquaviva provide the mix for a journey further into virtual dimensions than techno had ever gone before - the ever more confident animations reflecting the increasing sophistication of techno itself, reflected in some of the genres most memorable tracks from the likes of Speedy J, LSG, Plastikman, Laurent Garnier and Hardfloor.\n47 trance and techno classics. 3 unique mixes by essential DJs. Hours of pioneering sound and vision. \n","torrent":{"xt":"urn:btih:25394d161cbdea1e2f4d7f66d5a93b42347d0a09","amp;dn":"X-MIX+THE+DVD+COLLECTION+PART+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25394d161cbdea1e2f4d7f66d5a93b42347d0a09","infoHashBuffer":{"type":"Buffer","data":[37,57,77,22,28,189,234,30,47,77,127,102,213,169,59,66,52,125,10,9]},"announce":[],"urlList":[]}}