{"title":"Anjulie - Rain  (2nafish)","uid":5236151,"size":142675972,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:25f63b0d763693d5c5c36c857c715000289ef304&amp;dn=Anjulie+-+Rain++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":1,"time":1261546481,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 4000 Kb/s\nAudio: Linear PCM, 48000 Hz, Stereo, 1536 kbps\n\n\nThis video has no logos or titles.\n\n\nAnjulie is a Canadian singer/songwriter from Oakville, Ontario Canada, a suburb outside of Toronto. She is of Canadian, Indian and Guyanese origin. Anjulie is a self-described music addict and has been writing and composing her own music since she was a teenager and is the youngest of four children of Guyanese-Canadian parents. She wrote the song &quot;Say Goodbye to Jr. High&quot;, contributed background vocals and played percussion for the CD Unfabulous and More. Her debut album was co-written and produced by Jon Levine of the Philosopher Kings. Anjulie met Levine while working as an intern at Metalworks Recording Studio in Mississauga Canada. Anjulie was later fired for accepting a lunch date with Levine, but it ultimately led to their partnership and the beginnings of her music career.\n\nAnjulie opened for Jesse McCartney during his United States tour in 2009.[citation needed] Her unreleased singles have been featured on MTV television series: &quot;Rain&quot; on The Hills and &quot;Addicted2Me&quot; on several episodes of The City. The single &quot;Boom&quot; has been featured on ABC's Eastwick, Canada's Next Top Model, and The CW's Melrose Place and The Vampire Diaries.\n\nAnjulie wrote the single &quot;Don't Call Me Baby&quot; by Canadian recording artist Kreesha Turner which reached number 8 on Billboard's Canadian Hot 100 in 2008 and number 1 on Billboard's Hot Dance/Club Play Chart.\n\nInfluences on Anjulie's music are as varied as Annie Lennox, Lauryn Hill, U2 and Prince.\n\nShe cowrote the single &quot;I Want You&quot; with its performer Fefe Dobson. Music videos have been released and the song will appear on Dobson's upcoming album, Joy out in March 2010. &quot;I Want You&quot; has appeared on various projects ranging from promos for TV shows to promos for films to even a version recorded in Simlish for the PC game The Sims 3: World Adventures. On October 14, Dobson announced via her official imeem, Twitter (in graphic), Facebook and more that she will perform and that Anjulie will be a special guest at one of the PINKtober events, a benefit concert held at the Hard Rock Cafe in Hollywood, CA on October 22, 2009.\n\nAnjulie's music is featured in the 2009 movie/musical Fame. She wrote and performed &quot;Big Things&quot; which plays during the opening scene of the film.\n\nShe was nominated for a 2009 MTV Video Music Award for &quot;Best Breakthrough Artist in a Video.&quot;\n\nAnjulie has toured with Shwayze and Bobby Ray aka B.o.B. across the United States and she will be touring this Fall/Winter with Raphael Saadiq.\n\nReleased on August 4, 2009, Anjulie's self-titled CD reached number 2 on Billboard's &quot;Heatseekers Albums&quot; chart and number 108 on the Billboard 200 Albums chart. The album's first single &quot;Boom,&quot; released in 2008, reached number one on the U.S. Dance chart in 2009. Remixes of follow-up &quot;Love Songs&quot; reached the Top 10 on Billboard's Hot Dance/Club Play charts in October 2009.\n\n&quot;Rain&quot; debuted on Billboard's Hot Dance/Club Play charts in November 2009 at number forty-eight.\n\n\nMy Videos: &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:25f63b0d763693d5c5c36c857c715000289ef304","amp;dn":"Anjulie+-+Rain++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25f63b0d763693d5c5c36c857c715000289ef304","infoHashBuffer":{"type":"Buffer","data":[37,246,59,13,118,54,147,213,197,195,108,133,124,113,80,0,40,158,243,4]},"announce":[],"urlList":[]}}