{"title":"Life On The Edge Of A Bubble - Blowing The American Dream","uid":5249937,"size":650232704,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:267c5843398a397c0daa8abfd3f38eccf2fc6279&amp;dn=Life+On+The+Edge+Of+A+Bubble+-+Blowing+The+American+Dream&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"shasham","files":-1,"time":1262290804,"description":"Financial Crisis... Panic... Bailout... The current crisis appeared to materialize out of nowhere. Even regulators and financial authorities would have us believe that they were taken entirely by surprise. Dire headlines demanded quick action to prevent the collapse of the financial system. Politicians told us that we have to bail out Wall Street to keep Main Street afloat. As many of us lose our savings, our jobs and our homes, they tell us that we have to swallow hard and make sacrifices for the good of the country. The same political class tries to convince everyday Americans that the reasons for the bailout are too complicated for us to understand, so we must leave the solutions to the financial experts . . . the same ones that didn't see this coming. At the same time, they give our hard-earned money to Wall Street fat cats, without any strings attached, turning a deaf ear to our intense and vocal opposition. They saddle us and our children with an alarming debt burden as they expect us to passively allow the greatest transfer of wealth in American history.\n\nLife On The Edge of A Bubble challenges the prevailing view of the sudden, unforeseeable and unique nature of the crisis by bringing to light the unfamiliar historical pattern; in fact, each generation has found itself precariously perched on the edge of a bubble. While the media focuses on symptoms, this film addresses the root causes that politicians, lobbyists and corporate executives conveniently avoid. The pattern unfolds for the viewer in an entertaining and accessible blend of archival footage, historical vignettes, and snapshots of current events, revealing the story in a sometimes irreverent, often surprising manner. The DVD also includes a special documentary short on the genesis of our nation's banking and financial system. If knowledge is power, then this film arms the viewer with the information they need to restore the promise of the American Dream\n\nSir Isaac Newton is quoted as saying, 'I can calculate the motions of the heavenly bodies, but not the madness of people.' Newton, was not immune to the folly of his own time and made 7000 pounds and 100% profit on the speculative South Sea bubble, only to lose 20,000 pounds later, when he bought in at the height of the market.  While most of the attention focuses on the US, an exploration of the Dutch tulip mania and financial innovations mirrors thecom bubble of recent times.  Exposing the 'con' in the confidence game, how profits are privatized and losses socialized, how the rule makers bend and break the rules to enrich themselves and their financial backers, the film skillfully identifies key aspects of the systemic nature of the problem, a first step in the awesome task breaking that pattern &lt;a href=&quot;\nhttp://www.lifeontheedgeofabubble.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.lifeontheedgeofabubble.com/&lt;/a&gt;\nhttp://www.amazon.com/Life-Edge-Bubble-Blowing-American/dp/1615774009\n\n\n  ____                      _                      _   _       _\n / ___|___  _ __  ___ _ __ (_)_ __ __ _  ___ _   _| | | |_   _| |__\n| |   / _ \\| '_ \\/ __| '_ \\| | '__/ _` |/ __| | | | |_| | | | | '_ \\\n| |__| (_) | | | \\__ \\ |_) | | | | (_| | (__| |_| |  _  | |_| | |_) |\n \\____\\___/|_| |_|___/ .__/|_|_|  \\__,_|\\___|\\__, |_| |_|\\__,_|_.__/\n                     |_|                     |___/\n   ____\n  / ___|___  _ __ ___\n | |   / _ \\| '_ ` _ \\\n | |__| (_) | | | | | |\n(_)____\\___/|_| |_| |_|\n\n\nPLEASE KEEP SEEDED TO PASS ON THE MESSAGE.  PLEASE VISIT OUR SITE AND SHARE THE WORD!\nDOWNLOAD MAYBE SLOW BUT SURE! PLEASE ASSIST IN BANDWIDTH!\n\n* Don't Be Fooled Any Longer on Darwinism, Evolution, Global Warming Lies, Internationalism, etc.\n* Get The Message Out, Openly!\n","torrent":{"xt":"urn:btih:267c5843398a397c0daa8abfd3f38eccf2fc6279","amp;dn":"Life+On+The+Edge+Of+A+Bubble+-+Blowing+The+American+Dream","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"267c5843398a397c0daa8abfd3f38eccf2fc6279","infoHashBuffer":{"type":"Buffer","data":[38,124,88,67,57,138,57,124,13,170,138,191,211,243,142,204,242,252,98,121]},"announce":[],"urlList":[]}}