{"title":"Tegan &amp; Sara - Hell  (2nafish)","uid":5218861,"size":124473348,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:271fccbcb4ad10b1c126c804820a80d039e0911b&amp;dn=Tegan+%26+Sara+-+Hell++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1260850820,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nTegan and Sara are a Canadian indie rock/indie pop duo consisting of identical twins Tegan Rain Quin and Sara Kiersten Quin, born September 19, 1980. Both Tegan and Sara write, sing, and play guitar and keyboard. They have released six studio albums since 1999, most recently Sainthood in 2009.\n\nTegan and Sara have been profiled in a number of magazines and their albums have been included on several notable &quot;best of&quot; lists. In the fall of 2003, they graced the cover of ROCKRGRL magazine issue #49, which focused on a tribute to duos. In 2004, Rolling Stone magazine named their album So Jealous on their list of the best 50 albums of the year.\n\nTegan and Sara were nominated for a 2006 Juno Award for Alternative Album of the Year alongside Hot Hot Heat, Metric, The New Pornographers and Broken Social Scene. They were also nominated for 2008 Alternative Album of the Year alongside Arcade Fire, Wintersleep, and Patrick Watson. The 2008 Junos were presented on April 6 in Calgary, Alberta and they lost to Arcade Fire.\n\nMore recently, they appeared on the cover of the Summer 2007 issue of Under the Radar, the March 2008 cover of Alternative Press magazine and Spinner.com placed them at #7 on their list of Women Who Rock Right Now.\n\nIn January/February 2009, Tegan and Sara graced the cover of WonkaVision's &quot;Women in Rock&quot; issue, also featuring the likes of Feist, Amy Millan and Kate Nash.\n\nTegan and Sara were on the cover of the July/August issue of Curve Magazine. They were also on the cover of the November 2009 issue of Exclaim! Magazine. \n\nPunk band NOFX's 2009 album, Coaster, contains a song titled &quot;Creeping Out Sara&quot; (it appears as &quot;Creeping Out Tegan&quot; on Frisbee). The song details an alleged conversation between the singer and Sara (or Tegan).\n\nSainthood is Tegan and Sara's sixth full-length studio album, released on 27 October 2009.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:271fccbcb4ad10b1c126c804820a80d039e0911b","amp;dn":"Tegan+%26+Sara+-+Hell++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"271fccbcb4ad10b1c126c804820a80d039e0911b","infoHashBuffer":{"type":"Buffer","data":[39,31,204,188,180,173,16,177,193,38,200,4,130,10,128,208,57,224,145,27]},"announce":[],"urlList":[]}}