{"title":"Cheryl Cole - Fight For This Love  (2nafish)","uid":5334172,"size":151742468,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:274c885a53b5ae0df864571126f61a08f72c7a1c&amp;dn=Cheryl+Cole+-+Fight+For+This+Love++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1265270730,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Fight for This Love&quot; is the first solo single by British pop singer Cheryl Cole, best known for being a member of British girl group Girls Aloud and a judge on reality TV show The X Factor. The song was written and produced by Wayne Wilkins, Steve Kipner and co-written by Andre Merritt. It was released as the first single from Cole's debut solo studio album 3 Words on 16 October 2009. It charted at the top spot on the UK Singles Chart and the Irish Singles Chart and went on to be the fourth best-selling British single of the year.\n\nThe music video was directed by Ray Kay and was filmed in early September 2009. ITV1 premiÃƒÂ¨red the video at 12:15am on 20 September 2009. The video stars Cole dancing in front of various moving backgrounds in a number of outfits, most notably a soldier-themed outfit with a red military jacket. There is a sequne in front of moving bars like in Chipmunk's hit Look For Me. There is also a dance sequence in which Cheryl, wearing leopard-print bottoms, and a number of dancers perform a routine.The main colours of the video are red, white and black. Also the music video has Scored over 13 millon views onKay commented on the filming that:\n\n    The recordings went very well, and Cheryl was fantastic to work with. I drove her very hard at the shoot, and it was very difficult on her part. My job was relaxing in comparison. We made the video in London, with a lot of focus on fashion and dance, with very tough choreography, before putting it all together in Los Angeles afterwards. I have a strong feeling that this will be a # 1 for Cheryl in England!\n\n&quot;Fight for This Love&quot; was Cole's first entirely solo release outside of pop group Girls Aloud, following an appearance on will.i.am's &quot;Heartbreaker&quot; in 2008. The song initially came to Cole in demo form with a male vocalist. Cole said she &quot;knew instantly it was a single&quot;, having &quot;connected with the song so well&quot;.\n\nThe song received its worldwide radio premiÃƒÂ¨re on 7 September 2009 on BBC Radio 1's The Chris Moyles Show. On 18 October 2009, Cole performed the song for the first time on The X Factor's live results show. It was the first time that Cole had performed by herself on TV since participating on Popstars: The Rivals. There were reports that the performance would be pre-recorded, but Cole insists she performed the song live. The show, which also featured Whitney Houston, drew a record audience of 14.8 million to The X Factor, making it the most watched episode in the show's history. Cole also performed the song on T4.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:274c885a53b5ae0df864571126f61a08f72c7a1c","amp;dn":"Cheryl+Cole+-+Fight+For+This+Love++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"274c885a53b5ae0df864571126f61a08f72c7a1c","infoHashBuffer":{"type":"Buffer","data":[39,76,136,90,83,181,174,13,248,100,87,17,38,246,26,8,247,44,122,28]},"announce":[],"urlList":[]}}