{"title":"Stargate SG-1 S02 D5 PAL 2Lions-Team","uid":5349480,"size":4648228192,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:27662a2c55530593c90c920861eabdde82c76e56&amp;dn=Stargate+SG-1+S02+D5+PAL+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"wietseherman","files":-1,"time":1265742246,"description":"\n\nStargate SG-1 S02 D5 Pall 2Lions-Team\n\nNederlandse Informatie\n\nHoliday  - SG-1 ontmoet Ma'chello die van lichaam wisselt met Daniel.\n\nSerpent's Song - Apophis vraagt asiel aan bij SGC omdat Sokar hem wil doden.\n\nOne False Step - Als SG-1 in een communie komen breekt er plotseling een epidemie uit.\n\nShow and Tell - SG-1 maakt kennis met de Retou die een aanval openen op het SGC.\n\nEnglisch Information\n\nHoliday  - SG-1 meets an elderly man called Machello and learns that he has been hunted by the Goa'uld his entire life due to his inventions of technological devices meant to oppose them. Machello convinces Daniel to grasp a device made to switch bodies, and then escapes, leaving Daniel to die in the old body of Machello's. \n\nSerpent's Song - Apophis's death glider crashes on PB5-926. Dying, he is brought to the SGC. Sokar tries to attack Earth as he wants him, but is stopped when they hand over the dead Apophis. However, Sokar will use a sarcophagus to revive him and torture him indefinitely\n\nOne False Step - After a UAV crashes into a large white plant off-world (PJ2-445), SG-1 encounters inhabitants who appear to be dying en masse. SG-1 discover that the aliens depend on the large plants for survival because of an essential infrasound  they emit, and rectify the situation\n\nShow and Tell - A young boy warns SGC of a plot by invisible non-humanoid aliens (rogue Re'tu, who exist in large numbers on P63-2031) to destroy all humans. A minority of the Re'tu wage war on the Goa'uld by eliminating their potential hosts: humans. They operate in 5-man suicide units, which are capable of setting off an explosion equivalent to a small tactical nuke.\n\n\n\nSource    : retail\n\n\nFormat    : DVD5\n\n\nVideo     : Pal\n\n\nSound     : DD 5.1\n\n\nLanguages : EN \n\n\nMenu      : Yes\n\n\nExtra     : No\n\n\nSubs      : EN NL IT FR\n\n\n\n\n\n\nBrought to you by\n\n\nBack to Basic\n\n\n2Lions Team\n\n\n\nmeer zien??\n\n\nKom dan eens kijken op ons forum\n  \n \n\n\n &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl/index.php&lt;/a&gt;\n\n2Lions-Team for all your Dutch MOVIES and more\n\n\n\n*****************************************************\n\n\n\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden.\n\nDon`t quit after you finished the download, but keep seeding.\n\n\n\n*****************************************************\n\n\n\n\nThere are fake torrents from uploaders who use our team name.\n\nThose are not ours, or members from our team.\n\n\nWe 2Lions-Team are not responsible for the fake posts on our name.\n\n\n\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\n\n\n\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n\n*****************************************************\n\n\n","torrent":{"xt":"urn:btih:27662a2c55530593c90c920861eabdde82c76e56","amp;dn":"Stargate+SG-1+S02+D5+PAL+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27662a2c55530593c90c920861eabdde82c76e56","infoHashBuffer":{"type":"Buffer","data":[39,102,42,44,85,83,5,147,201,12,146,8,97,234,189,222,130,199,110,86]},"announce":[],"urlList":[]}}