{"title":"My name is khan X264_[250MB]_[Rohnak]","uid":5430011,"size":265335960,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:295ac2313c3db6bfc1d7fda13779677349cd5259&amp;dn=My+name+is+khan+X264_%5B250MB%5D_%5BRohnak%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rohnakzz","files":8,"time":1268383395,"description":"File Name    : My name is khan_[250MB]_[Rohnak]\nType         : Movie\nFormat       : mp4\nFile Size    : 253 MB\nDuration     : 02:27:08\nLanguage     : Hindi\nSource       : R5\nSubtitles    : yes-English\nGenre        : Drama | Romance See more\nIMDB Link    : http://www.imdb.com/title/tt1188996/\nIMDB Rating  : 7.0/10\nIMDB Votes   : 4,423 votes\n\nFormat                           : MP4\nCodec ID                         : x264\nCodec ID/Hint                    : x264\nDuration                         : 2h 27mn\nBit rate                         : 192 Kbps\nWidth                            : 608 pixels\nHeight                           : 256 pixels\nDisplay aspect ratio             : 2.35:1\nFrame rate                       : 8 fps\nResolution                       : 8 bits\nColorimetry                      : 4:2:0\nScan type                        : Progressive\nBits/(Pixel*Frame)               : 0.252\nStream size                      : 253 MiB\n\nPLOT\n\nRizwan Khan (Tanay Chheda) is a Muslim child who grew up \nwith his brother Zakir and his mother (Zarina Wahab) in a middle \nclass family in the Borivali section of Mumbai. Rizwan is different \nfrom the other children and no one, including his mother, can understand \nwhy. However, he has certain gifts, particularly a special ability to \nrepair any machine that is broken. His difference leads to special \ntutoring from a reclusive scholar and extra attention from his mother. \nThis attention, however, leads to a heightened level of jealousy from \nhis brother Zakir, who eventually leaves his family for a life in the \nUnited States.\n\nDespite this resentment, as an adult Zakir (Jimmy Shergill) \nsponsors Rizwan (Shahrukh Khan) to come and live with him in San Francisco. \nIt is at this time that Zakir's psychologist wife, Haseena diagnoses Rizwan \nas having Asperger's syndrome, a disorder which makes it difficult for people \nto interact socially. Rizwan also begins to work for Zakir as an herbal salesman \nand in the process he meets a Hindu woman, Mandira and her young son, Sameer \nor Sam (Yuvaan Makaar), from a previous marriage. Despite Zakir's hostility to \nthe match, they marry and settle down in the fictional town of Banville, where \nboth Mandira and Samir take Rizwan's last name as their own. They also live next \ndoor to the Garrick family. Sam is close with their young son, Reese (Kenton Duty \nand Michael Arnold) while Mark (Dominic Renda) is a journalist and Sarah \n(Katie A. Keane) is a friend of Mandira.\n\nThe Khans' perfect existence gets disrupted, however, after the September \n11 attacks on the twin towers in New York City. Mark goes to cover the war \nin Afghanistan and dies there. At the same time, the Khan family begins to \nexperience post 9-11 prejudice in their community and Reese begins to turn \nagainst Sam as well. One afternoon, an argument between them turns into a \nracially motivated schoolyard fight between Sam and a number of older students. \nReese tries to stop the fight but is held back and Sam is injured so badly that \nhe dies. A shattered Mandira blames Rizvan for his death stating that Sam &quot;died \nonly because his name was Khan.&quot; She then tells Rizwan that she no longer wants \nhim in her life. When he asks her what he has to do to be a part of her life, \nshe tells him that he has to tell the people of the United States, and the \nPresident that his name is Khan and that he is not a terrorist.\n\nRizvan thus sets out on a journey that takes him from one US state to \nanother (including Georgia, where he is befriended by Mama Jenny) in order \nto first meet President George W. Bush and later Barack Obama. During this \nquest, he is detained and later freed from the San Francisco Airport. Later, \nin Los Angeles, he prays in a Mosque and overhears violent rhetoric from Faisal \nRahman (Arif Zakaria). He reports this to the FBI but there is no response at \nthat moment. Later, while waiting in a crowd to meet President Bush and \nrepeating again and again, &quot;my name is Khan and I am not a terrorist,&quot; Rizwan \nis arrested and placed in a prison by police who misinterpret his statement.\n\nWhile in the prison he is tortured as a terrorist suspect and meets \nthe psychiatrist Radha (Sheetal Menon) who believes he is innocent. \nHe is later released after a media campaign by two Indian student reporters \nRaj (Arjun Mathur) and Komal (Sugandha Garg) and Bobby Ahuja (Parvin Dabas) \nprove his innocence by unearthing his attempts to inform the FBI about Faisal \nRahman. After his release, he returns to hurricane-hit Georgia to help Mama \n\nJenny and her son. His efforts attract media attention and numerous Muslims come \nto help as well. At the same time, Reese confesses to Mandira and reveals the \nidentity of the boys who beat up Sam. She informs Detective Garcia (Benny Nieves) \nwho has been assisting her on the case.\n\nAfter they are brought to justice, she joins Rizwan in Georgia. At the moment \nshe arrives, Rizwan is stabbed by a follower of Faisal Rahman and is rushed to \nthe hospital. With Mandira's help, he survives and meets President-elect \nBarack Obama (Christopher B. Duncan) who tells him: &quot;Your name is Khan and you \nare not a terrorist.&quot;\n\nscreens shots \n &lt;a href=&quot;\nhttp://bayimg.com/balLbAAcc&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/balLbAAcc&lt;/a&gt;\n &lt;a href=&quot;\nhttp://bayimg.com/bAlLeaAcc&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/bAlLeaAcc&lt;/a&gt;\n &lt;a href=&quot;\nhttp://bayimg.com/ballFaACC&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/ballFaACC&lt;/a&gt;\n &lt;a href=&quot;\nhttp://bayimg.com/bALLgAACC&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/bALLgAACC&lt;/a&gt;\n","torrent":{"xt":"urn:btih:295ac2313c3db6bfc1d7fda13779677349cd5259","amp;dn":"My+name+is+khan+X264_%5B250MB%5D_%5BRohnak%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"295ac2313c3db6bfc1d7fda13779677349cd5259","infoHashBuffer":{"type":"Buffer","data":[41,90,194,49,60,61,182,191,193,215,253,161,55,121,103,115,73,205,82,89]},"announce":[],"urlList":[]}}