{"title":"Seal - Crazy (Live)  (2nafish)","uid":5342457,"size":220188676,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:2a90e5defbe82ae5ced36dac09f7748415952074&amp;dn=Seal+-+Crazy+%28Live%29++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1265533042,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Crazy&quot; is a song written by English soul artist Seal (music and lyrics) and producer Guy Sigsworth (music only). The song was produced by Trevor Horn for Seal's debut album Seal (1991). Seal's debut single, &quot;Crazy&quot; is one of his biggest hits, reaching the top five in the United Kingdom and the top ten in the United States. It since has been covered by several artists, including Alanis Morissette, whose version was released as a single from her album The Collection (2005).\n\nThe song's signature is a keyboard mantra that continually swells and swirls, driven by bass-heavy beats and wah-wah pedal guitars. Its floating, ambient stylings established a sound years before &quot;The Politics of Dancing&quot; by Paul Van Dyk or William Orbit's work with Madonna and All Saints. Orbit produced a remix of the track for the single release. Seal's vocals are deeply melodic and soulful, at times with a characteristic rasp, while at others soaring high above the backing track.\n\nIn the United Kingdom the song was released as the first single from the album Seal in November 1990 and peaked at number two on the UK Singles Chart in January 1991 and is Seal's biggest solo hit there. The single sold over 200,000 copies, thus earning a BPI Silver certification. It won Seal a number of awards including the 1992 Ivor Novello award for songwriting. \n\nThe single was released in the United States in 1991, debuting at number eighty-three on the Billboard Hot 100 in mid-June; it peaked at number seven in late August and remained on the chart for nineteen weeks, until October. It reached the top five on the Modern Rock Tracks chart and the top twenty on the Hot Dance Music/Maxi-Singles Sales chart. It was the most commercially successful single from Seal and was Seal's biggest hit in the U.S. until &quot;Kiss from a Rose&quot;, which reached #1 in 1995. In August 2003 an acoustic version of &quot;Crazy&quot; charted at number four on Billboard's Hot Digital Tracks chart.\n\nThe song is heard in a Baywatch episode, in the trailer for the film The Basketball Diaries (1995) and featured in a scene in Spike Lee's Clockers (1995). It is also heard in the middle of &quot;True Calling,&quot; the second episode of Season 6 of TV's Cold Case. It was also used as a theme song for the ABC-TV series Murder One (1995-96).\n\nSeal is seen singing this song on an episode of the ABC series Eli Stone.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:2a90e5defbe82ae5ced36dac09f7748415952074","amp;dn":"Seal+-+Crazy+%28Live%29++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a90e5defbe82ae5ced36dac09f7748415952074","infoHashBuffer":{"type":"Buffer","data":[42,144,229,222,251,232,42,229,206,211,109,172,9,247,116,132,21,149,32,116]},"announce":[],"urlList":[]}}