{"title":"Julie Enfield Investigates - S01 to 05 - Audio Drama - MP3 - Sli","uid":5449616,"size":674827522,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2ac502c1b1bd7ec29558fd4f76fdf8961ae15782&amp;dn=Julie+Enfield+Investigates+-+S01+to+05+-+Audio+Drama+-+MP3+-+Sli&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"_Slimoo_","files":22,"time":1269134387,"description":"Julie Enfield Investigates - S01 to 05 - Audio Drama - BBC7 via DVB-T\n18 x 30 &amp; 4 x 45 Minute Episode - 128Kbps - Mp3 - Slimoo\n\nJulie Enfield Investigates was a series of radio dramas originally broadcast between 1994 and 1999. Written by Nick Fisher and starring Imelda Staunton as DSI Enfield, there were five stories: Terminus (1994), The Smithfield Murders (1995), The Net And The Canal (1996), The Leaves Of The Dead (1997) and Murder West One (1999). The first four runs were serials of four or five 30 minute episodes. Murder West One consists of four self-contained 45 minute cases. As an initial one-off, Terminus didn't carry the 'Julie Enfield Investigates' prefix. Trademarks running through all the stories are a very dark, almost Gothic, sense of horror, and an unusual narrator (in the case of Terminus, the railway station in which the murders take place). The series is occasionally repeated on BBC 7.\n\n &lt;a href=&quot;\nhttp://www.radiolistings.co.uk/programmes/julie_enfield_investigates.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.radiolistings.co.uk/programmes/julie_enfield_investigates.html&lt;/a&gt;\n\nJulie Enfield Investigates - S01 - E01 - Terminus \nJulie Enfield Investigates - S01 - E02 - Terminus \nJulie Enfield Investigates - S01 - E03 - Terminus \nJulie Enfield Investigates - S01 - E04 - Terminus \nJulie Enfield Investigates - S01 - E05 - Terminus \n\nJulie Enfield Investigates - S02 - E01 - The Smithfield Murders - Filth And Fat And Blood And Foam \nJulie Enfield Investigates - S02 - E02 - The Smithfield Murders - Blue Bummarees \nJulie Enfield Investigates - S02 - E03 - The Smithfield Murders - Chef's Special \nJulie Enfield Investigates - S02 - E04 - The Smithfield Murders - A Mushroom Diet \nJulie Enfield Investigates - S02 - E05 - The Smithfield Murders - A Passion For Hunting Something \n\nJulie Enfield Investigates - S03 - E01 - The Net And The Canal - Waking Up To Nessun Dorma \nJulie Enfield Investigates - S03 - E02 - The Net And The Canal - Communicating Wth The President \nJulie Enfield Investigates - S03 - E03 - The Net And The Canal - Tarantulas In Trojan Horses \nJulie Enfield Investigates - S03 - E04 - The Net And The Canal - Beyond The Firewall \n\nJulie Enfield Investigates - S04 - E01 - Leaves Of The Dead - Proverbs And Punctures From Hell \nJulie Enfield Investigates - S04 - E02 - Leaves Of The Dead - Stacks And Baps And Amulets \nJulie Enfield Investigates - S04 - E03 - Leaves Of The Dead - Welcome To The Nightmare \nJulie Enfield Investigates - S04 - E04 - Leaves Of The Dead - Pyramids In The Spider \n\nJulie Enfield Investigates - S05 - E01 - Murder West One - A Cure For Death \nJulie Enfield Investigates - S05 - E02 - Murder West One - The Art Of The Matter \nJulie Enfield Investigates - S05 - E03 - Murder West One - Five Star Killing \nJulie Enfield Investigates - S05 - E04 - Murder West One - Soho Espresso \n\n\n\nAudio Format    : MP3\nDuration Approx : 28mn\nBit rate mode   : Constant\nBit rate        : 128 Kbps \nChannel(s)      : 2 channels\nSampling rate   : 44.1 KHz\nResolution      : 16 bits\n\n. \n","torrent":{"xt":"urn:btih:2ac502c1b1bd7ec29558fd4f76fdf8961ae15782","amp;dn":"Julie+Enfield+Investigates+-+S01+to+05+-+Audio+Drama+-+MP3+-+Sli","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ac502c1b1bd7ec29558fd4f76fdf8961ae15782","infoHashBuffer":{"type":"Buffer","data":[42,197,2,193,177,189,126,194,149,88,253,79,118,253,248,150,26,225,87,130]},"announce":[],"urlList":[]}}