{"title":"HALLOWEEN - Portuguese Hip-Hop - Gangsta Rap Collection -TuGaRip","uid":5455178,"size":220541186,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:2b9d80d3cf742a5b5a94b74bed4ba4e25742b4d3&amp;dn=HALLOWEEN+-+Portuguese+Hip-Hop+-+Gangsta+Rap+Collection+-TuGaRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"djpatron","files":-1,"time":1269298951,"description":"Since 1996 Halloweem has the lifestyle of hip-hop. Residing in Odivelas, Lisbon, he finally decided to release his first album of originals. \n\nWe learned very early to write and express their ideas through rap. His rhyme with consistent metrics makes Halloween onw of the mosts active figures in the Portuguese underground hip-hop scene. \n\nHis latest album speaks of the harsh and violent reality of the large slums and ghettos of Lisbon. The main purposes of Halloween is to rescue the ethnic and ideological nostalgia through hip-hop and more specifically the gangsta rap through his lyrics are direct and well put together. Characterized as a rapper rapporteur of stories of the streets and the suburbs, Halloween put in his songs many of his experiences related to the dramatic life of suburban youths.\n\nUnemployment, crime, slums, immigration, police violence, and prison life are recurring topics of his rhymes. In addition to its quality in rap, Halloween has been distinguished by his tremendous charisma, and his powerful and peculiar voice. \n\nHardcore and dark, the instrumental &quot;Mary Witch Project&quot; remind us of the raw sounds of Wu Tang Clan in its heyday. This is an album that is sure to be deployed to Portuguese Hip-Hop for its originality and difference.\n\n\n","torrent":{"xt":"urn:btih:2b9d80d3cf742a5b5a94b74bed4ba4e25742b4d3","amp;dn":"HALLOWEEN+-+Portuguese+Hip-Hop+-+Gangsta+Rap+Collection+-TuGaRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b9d80d3cf742a5b5a94b74bed4ba4e25742b4d3","infoHashBuffer":{"type":"Buffer","data":[43,157,128,211,207,116,42,91,90,148,183,75,237,75,164,226,87,66,180,211]},"announce":[],"urlList":[]}}