{"title":"Serbian Scars [2009]","uid":5416116,"size":736712704,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2c5fa23648f3b56d8a9c5f6169536100eb4d108d&amp;dn=Serbian+Scars+%5B2009%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mihajlovic","files":1,"time":1267921185,"description":"DVD RIP - XviD WITHOUT SUBTITLE\n\n720 X 416\n\n702 MB\n\nThis action, thriller, drama SERBIAN SCARS, is set in Belgrade, Chicago and Kosovo, chronicles the complicated relationship and reunion of estranged brothers, Alex and Peter and the forbidden love of a Serbian Soldier (Alex Obilich) and a young Muslim woman. Alex believing his father (Goran Obilich) to be at deaths door and in need of a bone marrow transplant, ventures from Serbia to Chicago to find his brother Peter in an effort to save their dying dad. Peter escaped from Serbia with their mother years ago leaving behind his brother and father to fight in the war. With the help of an American CIA operative, Alex finds his brother in Chicago. What Alex does not realize is that their father is being used as a tool by a terrorist named Dreq, who thinks that Peter holds the key to a devastating chemical weapon that their father developed under duress for the Soviets during the Cold War. Goran Obilich is prepared to sacrifice everything to make sure that the chemical weapon will never fall into terrorist hands. Alex convinces his brother to return to Serbia where they discover that Alexs Muslim girlfriend has become a pawn in Dreqs deadly game. Secret alliances are revealed and hidden identities become known as the brothers discover that freedom is never free. \n","torrent":{"xt":"urn:btih:2c5fa23648f3b56d8a9c5f6169536100eb4d108d","amp;dn":"Serbian+Scars+%5B2009%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c5fa23648f3b56d8a9c5f6169536100eb4d108d","infoHashBuffer":{"type":"Buffer","data":[44,95,162,54,72,243,181,109,138,156,95,97,105,83,97,0,235,77,16,141]},"announce":[],"urlList":[]}}