{"title":"Vonda Shepard - Searchin' My Soul (From Ally McBeal) (2nafish","uid":5409093,"size":160116740,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:2c61cc03cc6cebe2ea2d0f7f026a421ca352439b&amp;dn=Vonda+Shepard+-+Searchin%5C%27+My+Soul+%28From+Ally+McBeal%29+%282nafish&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1267702702,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nVonda Shepard - Searchin' My Soul (Soundtrack: Ally McBeal - TV) (2nafish)\n\n\nNote: This video is a &quot;Movies &amp; Music&quot; video so it has 2 logos.\n\n\nSongs from Ally McBeal is an album by Vonda Shepard released in 1998 as a soundtrack for the American television series Ally McBeal.\n\nIt reached number three in the UK album charts and was a success in the US, Canada and many European countries too. The song &quot;Searchin' My Soul&quot; was used as the Ally McBeal theme tune and was originally featured on one of Vonda Shepard's previous albums, The Radical Light. The majority of the songs, however, are covers of old songs whose lyrics reflected what was happening in Ally's life onscreen.\n\nIt peaked #1 in Spain for a month in the summer of 1999, thanks to a big promotion in radios, Vonda Shepard shows in Madrid and Barcelona and the TV series, with the album selling more than 500,000 copies. It is a gold record in Poland.\n\nVonda Shepard (born July 7, 1963) is an American pop/rock singer. She appeared as a regular in the television show Ally McBeal from seasons 1-5 in which she played a resident performer at the bar where the show's characters drank after work. She plays piano, guitar, and bass.\n\nVonda Shepard was born in New York but her family relocated to California when she was a child. She played piano from an early age. Her father is Richmond Shepard, a mime and improv actor. Vonda has three sisters: Armina, Rosetta (now Brianna) and Luana.\n\nAfter performing as a backing singer for many years she was eventually given her own recording contract. Shepard's first chart appearance was in 1987 when she recorded a duet with Dan Hill entitled &quot;Can't We Try&quot;. Before this she tried out for the part of Michael J. Fox's sister in Light of Day but lost the part out to Joan Jett. She was also poised to sing on Peter Cetera's duet &quot;The Next Time I Fall&quot; but unfortunately he picked Amy Grant instead. She released her first self-titled album in 1989 with little fanfare. The album did yield one chart single, &quot;Don't Cry Ilene&quot;, a mid-tempo, piano-driven jazz-R&amp;B flavored song dealing with the break-up of a relationship between a black woman and a white man, arising from adult peer pressure. The track is sung from the perspective of the woman's white female friend, who harbors a desire to have the man for herself, but keeps her distance out of respect for her friend. The song peaked at Number 17 on the Billboard Hot Adult Contemporary chart and stayed on the charts for 12 weeks.\n\nAfter her third album, Shepard was signed up to appear on Ally McBeal after being spotted by the show's creator David E Kelley. While on the show she recorded two full soundtrack albums and was featured on two other Ally McBeal compilations. The songs Shepard recorded for Ally McBeal soundtrack albums were mainly covers of old songs with lyrics that paralleled what was happening in the title character's life onscreen. Since appearing in the show, Shepard has released two more studio albums and a live album.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:2c61cc03cc6cebe2ea2d0f7f026a421ca352439b","amp;dn":"Vonda+Shepard+-+Searchin%5C%27+My+Soul+%28From+Ally+McBeal%29+%282nafish","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c61cc03cc6cebe2ea2d0f7f026a421ca352439b","infoHashBuffer":{"type":"Buffer","data":[44,97,204,3,204,108,235,226,234,45,15,127,2,106,66,28,163,82,67,155]},"announce":[],"urlList":[]}}