{"title":"Wondershare.dvd.ripper.platinum","uid":5336543,"size":9461696,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2ca5a61349ad308cda8fbbdfc76153e94489fb6b&amp;dn=Wondershare.dvd.ripper.platinum&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gulashfek","files":2,"time":1265335887,"description":"Wondershare DVD Ripper Platinum can rip/convert DVD to video file with lossless video/audio quality. It supports most of popular video and audio formats such as AVI, MPEG, WMV, MP3, and WAV (check all supported video/audio formats in the &quot;Specifications&quot; tab).\n\nNo boring time anymore - Watch DVD movies anytime and anywhere\nIt will be fun to watch DVD movie when you get bored (waiting for bus or airplane). Wondershare DVD Ripper allowes you to rip/convert DVD to video that can playing on iPod, Zune, mobile phone (e.g. iPhone, BlackBerry and Nokia), PSP, Google Nexus One and other portable media players. So you can watch DVD movie anytime and anywhere. You will never be bored during the waiting time.\n\n \n\nMake fun with edit and share key quote from a DVD movie\nYou can extract and edit key quote from your favorite DVD movie and upload it tofor sharing with your friends. You can also add special effect and your own subtitle. There are a lot of interesting things that you can do with Wondershare DVD Ripper.\n\n \n\nWatch DVD movies freely\nSometime you just can't play your favorite DVD move because of regional lockout or CSS protection, Wondershare DVD Ripper can make it region free and remove CSS protection for you. So you can watch any DVD freely.\n\n \n\nFaster than ever\n\nIt allows you to import multiple DVD or DVD folders, and convert them at the same time. ","torrent":{"xt":"urn:btih:2ca5a61349ad308cda8fbbdfc76153e94489fb6b","amp;dn":"Wondershare.dvd.ripper.platinum","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ca5a61349ad308cda8fbbdfc76153e94489fb6b","infoHashBuffer":{"type":"Buffer","data":[44,165,166,19,73,173,48,140,218,143,187,223,199,97,83,233,68,137,251,107]},"announce":[],"urlList":[]}}