{"title":"eMule 0.50a BETA1","uid":5430738,"size":3382198,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2d33d839da2c286cce593dafeaf7546da21f3247&amp;dn=eMule+0.50a+BETA1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"olofolleola4","files":-1,"time":1268404880,"description":"Copied from eMule Project Homepage:\n\n\nWhat is eMule?\nAt dawn of  May 13th 2002 a guy called Merkur was dissatisfied with the original eDonkey2000 client and was convinced he could do better. So he did.\nHe gathered other developers around him, and eMule Project was born.\nTheir aim was to put the client back on track where eDonkey had been famous before, adding tons of new features and a nice GUI.\nThey couldn't imagine what impact this decision would have... \n\nAs of today, eMule is one of the biggest and most reliable peer-to-peer file sharing clients around the world. Thanks to it's open source policy many developers are able to contribute to the project, making the network more efficient with each release. \n\nWhat does eMule mean?\nThe name &quot;eMule&quot; comes from an animal called &quot;Mule&quot; which is somehow similar to a donkey ;) \n\nHow often is eMule updated?\neMule is not updated regularly, but at the moment the frequencies are between 1 and 3 months.\nDon't take this for guaranteed. :) \n\n\nA list of a few features available.\n\nClients use several networks to create one reliable network.\n(ED2K, Source Exchange, Kad) \n\nKad is now in an open testphase, eMule v0.42 can be enabled to use Kad \n\neMule's Queue and Credit system helps to ensure that everyone will get the file he wants by promoting those that upload back to the network. \n\neMule is completely free. eMule is also completely free of any Adware, Spyware, and ect. We do this for fun and knowledge, not for money. \n\nEach file checked for corruptions while downloading to ensure an error free file. \n\nThe eMules Intelligent Corruption Control helps to speed up the correction of corrupted parts. \n\nAuto priorities and Source management allows you to start many downloads without having to monitor them. \n\nThe Preview function allows you to look at your Videos and Archives before they are completed. For video previewing, we recommend the Video Lan Client. \n\nThe eMule features webservices and a webserver that allows you to have quick access to and from the internet. \n\nYou can create categories for your download to organize them. \n\nTo find the file you want, eMule offers a wide range of search possibilities which include: Servers (Local, and Global), web based (Jigle, and Filedonkey), and Kad (Still in Alpha). \n\neMule also allows you to use very complex Boolean searches that make the searches much more flexible. \n\nWith the messaging and friend system, you can send messages to other Clients and add them as friends. In your friend list, you can always see if a friend is online. \n\nWith the build in IRC client, you can chat with other downloaders and chatters around the globe.\n\n\n\nThis is the complete changelog since the eMule 0.49c release:\n\n\neMule 0.50a BETA1\n-----------------------\n- Mar, 8. 2010        -\n-----------------------\n.: Fixed a bug which caused the &quot;Add files to download in paused mode&quot; otpion to not work properly in all cases\n.: Fixed a visual glitch on taksbar notifiers when using the Aero theme [gureedo]\n\n-----------------------\n- Mar, 3. 2010        -\n-----------------------\n.: Added Windows 7 taskbar goodies:\n   - Global progress bar in the eMule taskbar button, progress colors: green when downloading, red when a download is errorous, yellow otherwise\n   - Taskbar Buttons: when hovering over the eMule taskbar button (connect/disconnect/throttle/unthrottle/open preferences)\n   - Overlay icon:    Overlay icon on the eMule taskbar button indicating active up- and downloads (disabled by default, enable by ini entry &quot;ShowUpDownIconInTaskbar=1&quot;). \n\n-----------------------\n- Mar, 1. 2010        -\n-----------------------\n.: Tweaked uploadcode to significantly increase the possible uploadspeed per slot especially on LANs, making eMule more suitable for those\n.: The number of maximal open upload slots has been decreased to 100\n.: Fixed a bug which caused the &quot;Add files to download in paused mode&quot; otpion to not work properly in all cases\n\n-----------------------\n- Feb, 28. 2010       -\n-----------------------\n.: Fixed a problem with the sharedfiles list when deleting a shared files [dolphinX]\n.: Fixed minor possible memory/ressource leak in the archive recovery and ipfilter [dolphinX]\n.: Fixed possible problem when wrong incoming directory due to categories in certain cases [dolphinX]\n\n-----------------------\n- Feb, 19. 2010       -\n-----------------------\n.: Fixed a bug in Kad which would not enforce the search tolerance in certain cases\n.: Changed Kad to work better in small LANs. If Kad detects it is running on a LAN (only LAN IPs in the routing table), it will assume beeing open and not behind a NAT/Router without trying to verfiy (which would fail in a small LAN),\n        and also doesn't enforces several security features like flood detection for LAN IPs. Now even a small Kad LAN of 2 nodes works well without any setup issues\n(To create such a Kad LAN, make sure all clients have Options-&gt;Extended-&gt;&quot;Filter server and client LAN IPS&quot; disabled, delete the existing nodes.dat if necessary, go to the Kad dialog and enter the IP+Port of one other client (which is either connected or in connecting mode for Kad) to the bootstrap box - done)\n\n-----------------------\n- Jan, 25. 2010       -\n-----------------------\n.: The connection wizzard is no longer shown after finishing the first start wizzard (it's deprecated)\n.: The first start wizzard is only shown on first starts and no longer after updates\n\n-----------------------\n- Jan, 21. 2010       -\n-----------------------\n.: Added a new graph to the Kad window, which lets you watch each Kad lookup in detail. For non-Devs this is just for fun, you don't need to worry about anything shown there. A detailed explanation of the graph can be found in the onlinehelp.\n.: Added &quot;Automatically show active searches&quot; option to the context menu of the new graph which lets it switch to active lookups automatically (instead having to select it in the list). Now you can watch Kad working for hours without a click! :)\n\n-----------------------\n- Jan, 12. 2010       -\n-----------------------\n.: Added a new dockable toolbar to the transfer dialog. The buttons resemble the context menu options, but making them accessible easier and faster. The toolbar can be removed by right clicking on it and shown again by selecting context menue option of the downloadlist\n\n-----------------------\n- Jan, 10. 2010       -\n-----------------------\n.: The context menu in of the downloadlist allows now directly assign a file to a new category (instead of having to create it separately first)\n.: The &quot;Unassign&quot; category context menu entry is now only available if a file actually has a category\n\n-----------------------\n- Dec, 7. 2009        -\n-----------------------\n.: Fixed missing setting saving after automatic adapting incoming folders of categories due to changed main incoming folder\n.: Fixed a bug with overwriting the nodes.dat on times we actually don't want to write it [Nissenice]\n.: Added a quick intermediate fix to make certain Kad lookups more reliable, improving the (search/source-) results in some cases [based on research from http://www-users.cs.umn.edu/~hopper/kad.pdf]\n\n-----------------------\n- Nov, 28. 2009       -\n-----------------------\n.: Switched the eMule fileidentifiers from ED2k-Hash + Size to ED2k-Hash + AICH-Hash + Size. This means eMule is now using two hashing algorithms combined (based on MD4 and SHA1) to verify if a received part (and eventually the comlete files) is not corrupt\n   This change is necessary due to weaknesses in the MD4 algorithm and enables eMule to make sure to never complete a corrupt files for the next decade\n   All changes are backwards compatible, so no clients or files will be exluded from the network\n.: AICH part hashsets are build out of existing AICH recovery hashsets, no rehashing is done\n.: AICH verification is enabled when using an ed2k link with included AICH hash, or when searching and downloading a file from Kad when certain requirements are met (this will only start to work once the majority of nodes update)\n.: The AICH hash can be seen in the search results list for kad searches if available\n.: ed2k links can no longer be created without the AICH Hash, except if it is not available. ed2k links without AICH hash are considered deprecated, but are still accepted by eMule for now\n\n-----------------------\n- Nov, 15. 2009       -\n-----------------------\n.: The shared files list now shows files in root directories properly [dolphinX]\n.: Fixed a bug with determining if the filesystem can handle large files when using categories [dolphinX]\n.: Added preferences.ini-only option &quot;KeepUnavailableFixedSharedDirs&quot; (&quot;eMule&quot;-Section) which lets eMule keep shared directories on fixed drives even if they are not found anymore\n.: Fixed minor memleak on kad searches [tHeWiZaRdOfDoS]\n-----------------------\n- Oct, 13. 2009       -\n-----------------------\n.: Added preferences.ini-only option &quot;ForceSpeedsToKB&quot; (&quot;eMule&quot;-Section), which will make eMule display all speed values in KB/s (instead of B/s to TB/s depending on the speed)\n\n-----------------------\n- Aug, 7. 2009        -\n-----------------------\n.: The shared files dialog has now a tab selector, letting you choose to view the statistics,(reduced versions of) the content, ed2k-link or metadata info for the selected file(s)\n.: The statistics page on in the shared files dialog also has the following new entries: Popularity rank (ranking all your shared files based on Requests), On Queue (clients on queue for the selected file) and Uploading (current bandwidth used to upload the selected file)\n.: The new tabs in the shared files dialog can be closed or restored by an arrow button on the right side\n\n-----------------------\n- Aug, 3. 2009        -\n-----------------------\n.: Fixed possible resource leaks in ZIP file decompression [tHeWiZaRdOfDoS]\n.: Fixed sorting bug in Shared Files window [moloko+]\n\n-----------------------\n- Aug, 2. 2009        -\n-----------------------\n.: Fixed bug with downloading files via the built-in webserver [Stulle]\n.: Fixed double/single click behaviour in search results window [tHeWiZaRdOfDoS]\n.: Fixed bug in user hash validation [ilmira]\n.: Fixed bug with space characters in ED2K URLs [moloko+]\n\n-----------------------\n- Jul, 25. 2009       -\n-----------------------\n.: Fixed a bug which made search tabs in certain cases invisible after you closed one\n\n-----------------------\n- Jul, 20. 2009       -\n-----------------------\n.: Cleand up options dialog a bit:\n   The following settings have been removed and are now preferences.ini-only: &quot;BeepOnError&quot;, &quot;DontRecreateStatGraphsOnResize&quot;, &quot;UpdateQueueListPref&quot;, &quot;MessageFromValidSourcesOnly&quot; (Section &quot;eMule&quot;) and &quot;EnabledDeprecated&quot; (section &quot;PeerCache&quot;)\n.: The exit conformation messagebox has now a &quot;Don't ask me again&quot; option\n.: Added &quot;Pause on when preview possible&quot; option to the downloadlist context menu. Only visible when &quot;advanced mode controls&quot; is enabled\n\n-----------------------\n- Jul, 09. 2009       -\n-----------------------\n.: Improved storing AICH hashsets after a download has finished - should be much faster now if you share many files\n.: Sparse files are available on Windows7 again, Vista stays the only version were they are disabled\n\n-----------------------\n- Jun, 12. 2009       -\n-----------------------\n.: Added basic checks and user warnings for wrong operator usage (like using OR on the first keyword) in Kad. Earlier version just delivered wrong/incomplete results in such cases.\n\n-----------------------\n- Jun, 10. 2009       -\n-----------------------\n.: Fixed a bug in Kad with setting the proper searchkeywords when searching for exact phrases with quotes\n.: Fixed a bug with rearranging quoted keywords on kad searches\n\n-----------------------\n- Jun, 2. 2009        -\n-----------------------\n.: Kad1 is no longer supported and we will no longer answer or request any packets from Kad1 nodes (the last eMule Kad1 version was release about 4 years ago)\n\n-----------------------\n- Mar - May 2009      -\n-----------------------\n.: eMule Summer of Non-Code :)\n\n\nED2K Link:\ned2k://|file|eMule0.50a_BETA1-Installer.exe|3382198|A25087410B0B737AB1D6ED03DAB579ED|h=DU2TG3BPHBZHA5HZWCH2WOQJRLSOUZD4|/\n\n\n\nComments from the uploader (olofolleola4):\nHere is some links if you cannot download it through this torrent:\nupload box  .  com  /  files  /  bb16ac7a4a\nrapid share  .  com  /  files  /  362385420  /  eMule0.50a_BETA1-Installer.exe","torrent":{"xt":"urn:btih:2d33d839da2c286cce593dafeaf7546da21f3247","amp;dn":"eMule+0.50a+BETA1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d33d839da2c286cce593dafeaf7546da21f3247","infoHashBuffer":{"type":"Buffer","data":[45,51,216,57,218,44,40,108,206,89,61,175,234,247,84,109,162,31,50,71]},"announce":[],"urlList":[]}}