{"title":"i.am.legend.{Dutchsubs-changeable}{2009}{1080p-dts}-Closedeye","uid":5247565,"size":7422489123,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:2d4593555e6f478d7a95ad27316342861f622447&amp;dn=i.am.legend.%7BDutchsubs-changeable%7D%7B2009%7D%7B1080p-dts%7D-Closedeye&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Closeye","files":-1,"time":1262220542,"description":"Closedeye presents I am legend 2007 Changeable dutch subs\n---------------------------------------------------------\n---------------------------------------------------------\nVideo: avc1\nResolution: 1920x1080\nfps: 23.976215\n\naudio1: dts\nchannels: 3f2r/LFE\nsample rate: 48000 Hz\nbitrate: 1536 kb/s\n\naudio2: a52\ndescription: AC3\nchannels: 6channels\nsample rate: 48000Hz\n\nDr. Robert Neville (Will Smith) is driving down one of the overgrown streets in a Ford Mustang when a herd of deer suddenly dart out from behind a building. He guns the engine and chases them through the streets, singling one out until it leaps over a blockade with dozens of cars blocking the road. Neville screeches to a halt, looks at Sam, his German shepherd companion, and steps out with his M4 rifle to track down the deer. Silently making his way through the tall grass growing between the cars, he spots the deers tail and takes aim just as it goes around a bus and under an overpass. Cursing, Neville lowers his rifle and begins to walk around the other side, Sam at his heel. As he approaches the corner he raises the scope to his eyes and edges around, catching sight of the deer through an abandoned car. Carefully edging his way around the car for a clear shot, Neville takes aim and A lioness leaps out from behind a car on the other side of the deer, grabbing it and wrestling it to the ground. Neville holds the rifle to his and looks as though he is going to shoot the lioness, but he lowers it as a lion and two cubs come into view. He seems torn until his watch starts beeping. Turning off the alarm, Neville glances at the sun, which is beginning to makes its way down the horizon. He turns to Sam and tells him its time to go.\n\n\n\nVerenigde Staten\nActie / Science-Fiction\n100 minuten\n\ngeregisseerd door Francis Lawrence\nmet Will Smith, Alice Braga en Charlie Tahan\n\nJaren nadat Dr. Alice Krippin een genezing voor kanker lijkt te hebben gevonden, heeft een mysterieus virus de hele wereld in zijn greep. Veel mensen zijn gestorven aan het virus en een ander deel is getransformeerd in een groep bloeddorstige vampiers. In de stad New York leeft enkel nog kolonel en wetenschapper Robert Neville, die druk op zoek is naar een geneesmiddel. 's Middags is de stad verlaten en alleen Robert en zijn hond Sam begeven zich dan op straat. Maar zodra het donker wordt komen de vampiers te voorschijn en gaan op zoek naar vers bloed.","torrent":{"xt":"urn:btih:2d4593555e6f478d7a95ad27316342861f622447","amp;dn":"i.am.legend.%7BDutchsubs-changeable%7D%7B2009%7D%7B1080p-dts%7D-Closedeye","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d4593555e6f478d7a95ad27316342861f622447","infoHashBuffer":{"type":"Buffer","data":[45,69,147,85,94,111,71,141,122,149,173,39,49,99,66,134,31,98,36,71]},"announce":[],"urlList":[]}}