{"title":"Bernhard Schavuit van Oranje alles op 1 DVD 2Lions-Team","uid":5315410,"size":4496758464,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2dc843d2b565c31e0cc340c4dd04410713a436a9&amp;dn=Bernhard+Schavuit+van+Oranje+alles+op+1+DVD+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Pioen","files":-1,"time":1264696422,"description":"Bernhard Schavuit van Oranje alles op 1 DVD       \n\n\n\n\n \n \nBernhard - Schavuit van Oranje is een vierdelige serie over meer dan alleen het turbulente leven van een prins-gemaal. Het is een meeslepend drama over een man die zich probeert te ontworstelen aan een keurslijf, die zijn eigen weg zoekt en diepe crisissen moet overleven om erachter te komen wat Ware Liefde werkelijk betekent.\n\nBinnen de Koninklijke familie is er eigenlijk geen spraakmakender figuur te bedenken dan Prins Bernhard. Of het nu gaat om Greet Hofmans, buitenechtelijke affaires en dochters, of Lockheed, er zijn vele schandalen in zijn leven geweest. Tegelijkertijd was - en is - Prins Bernhard een geliefd figuur, die door velen als oorlogsheld op handen gedragen wordt. Een man van extremen.\n\nIn vier delen vertelt Bernhard het verhaal van zijn leven. Niet alleen aan de kijker, maar vooral ook aan prinses MÃƒÂ¡xima. Zij zal straks immers als koningin naast Willem-Alexander eenzelfde positie innemen als Bernhard. Uit hun gesprekken en discussies blijkt hoezeer zij verschillen, maar ook hoezeer zij hetzelfde zijn. Voor MÃƒÂ¡xima is dat soms erg confronterend.\n\nHet verhaal sleept ons vanaf Soestdijk onder meer langs het Duitse Reckenwalde, Berlijn, Londen, ArgentiniÃƒÂ« en Canada. Het schetst een tijdsbeeld van de wereld van de jaren dertig van de twintigste eeuw tot het begin van de eenentwintigste eeuw.\n\n\n\nBedankt luisje om alles op een dvd te zetten met Menu\n\n\n\n\nSpotinformatie \nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail\n \nOndertitels : Geen\n \nGenre : TV Shows/Series \n\nWeblink : http://weblogs.vpro.nl/bernhard\n\n*****************************************\n\nBrought to you by \n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n\n\n\n******************************************\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n\n\n\n\n \n \n \n","torrent":{"xt":"urn:btih:2dc843d2b565c31e0cc340c4dd04410713a436a9","amp;dn":"Bernhard+Schavuit+van+Oranje+alles+op+1+DVD+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2dc843d2b565c31e0cc340c4dd04410713a436a9","infoHashBuffer":{"type":"Buffer","data":[45,200,67,210,181,101,195,30,12,195,64,196,221,4,65,7,19,164,54,169]},"announce":[],"urlList":[]}}