{"title":"Inside the Kremlin","uid":5240944,"size":165238096,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2e503c55f45eb1f432caa0ed39492ddb6af2a5bb&amp;dn=Inside+the+Kremlin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"darkerix","files":-1,"time":1261757995,"description":"Ravi Shankar, the figurehead of world music, was invited in 1988 to work with Russian musicians on a concert to mark the end of an Indian Festival in the Soviet Union. This recording was made on July seventh of that year, with over 140 musicians present: Shankar's Indian Ensemble, the Russian Folk Ensemble, the Government Chorus of Ministry of Culture of USSR, and the chamber orchestra of the Moscow Philharmonic. Shankar composed all seven of the pieces here as a melding of the musics of India and Russia. &quot;Prarambh,&quot; the opening piece, is an ethereal sort of sound created by the amalgamation of Indian and Russian instruments both playing ragas. &quot;Shanti-Mantra&quot; is based on Raga Devagiri Bilawal, as well as the Shanta Ras, from the Bharatanatyasastra (oldest work of Indian music theory), and is performed by both the Indian vocalists, as well as the Government Choir. Three ragas are based on Raga Hemavati, Raga Kirwani, and Raga Basant Mukhari, and are performed solely by the Moscow Philharmonic musicians. &quot;Tarana&quot; makes use of a Punjab form of singing that utilizes nonsense syllables to great effects of rhythmic wonder. &quot;Sandhya Raga,&quot; based on Raga Yaman Kalyan, is &quot;basic&quot; Indian classical music, without any Russian additions, and &quot;Bahu-Rang&quot; is the finale of the concert. It is based on Raga Mishra Pilu and has five movements, the first being instrumental, the second being call and response with the drums, the third being improvised thumri singing, and the fourth element being a folk portion that leads to the climax, a song &quot;Unity of Friendship and Love&quot; by Shankar. While the synthesis of Indian and Russian musics could leave a listener wary before hearing the album, Shankar remained almost solely with Indian music, though the performers may have been Russian. The album is definitely worthwhile, as the backing Russian chorus can add something to the music, though leaving Indian classical solely in the hands of foreigners can be a dangerous matter, as is proven on three ragas. Throughout, though, it's quite a nice album, worthy of the Shankar name being placed upon it. ~ Adam Greenberg, All Music Guide","torrent":{"xt":"urn:btih:2e503c55f45eb1f432caa0ed39492ddb6af2a5bb","amp;dn":"Inside+the+Kremlin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e503c55f45eb1f432caa0ed39492ddb6af2a5bb","infoHashBuffer":{"type":"Buffer","data":[46,80,60,85,244,94,177,244,50,202,160,237,57,73,45,219,106,242,165,187]},"announce":[],"urlList":[]}}