{"title":"Kevin Smith - Chasing Amy (1997)","uid":5318265,"size":1744636870,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2ef2f743793ba3a3e37545b22fab3b5128533bd8&amp;dn=Kevin+Smith+-+Chasing+Amy+%281997%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"lord_terabyte","files":-1,"time":1264783412,"description":"Kevin Smith - Chasing Amy (1997)\n\nLanguage\tEnglish dual audio with commentary\nSubtitles\tEnglish CC sub/idx &amp; srt\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0118842&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0118842&lt;/a&gt;\n &lt;a href=&quot;\nhttp://img476.imageshack.us/img476/3162/75box348x490gc7.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img476.imageshack.us/img476/3162/75box348x490gc7.jpg&lt;/a&gt;\n\n[QUOTE]``Chasing Amy'' is a romantic comedy about people who write comic books for a living, and whose most passionate conversations can center on the sex lives of Archie and Jughead. Kevin Smith, who wrote and directed the movie--the third installment in his Jersey trilogy--makes these characters intense and funny. It's all in the writing.\n\nWe meet his Gen X heroes at a comic book convention, where they're autographing copies of their hit cult comic ``Bluntman &amp; Chronic.'' Holden (Ben Affleck) and Banky (Jason Lee) have been best friends for years, live together, and take their art so seriously that when an obnoxious fan says ``an inker is only a tracer,'' there's a fight. Then Holden meets Alyssa (Joey Lauren Adams), another comic book artist, and during a long dart game in a nearby pub, they find that their minds are well matched; Holden assumes that where the minds go, the bodies should follow, but what he doesn't realize is that Alyssa is a lesbian.\n\nThis could be the setup for an empty-headed sexcom, but Smith is more ambitious and subtle. While the surface of his film sparkles with sharp, ironic dialogue, deeper issues are forming, and ``Chasing Amy'' develops into a film of touching insights. Most romantic comedies place phony obstacles in the way of true love, but Smith knows that at some level there's nothing funny about being in love: It's a dead serious business, in which your entire being is at risk. (That's why lovers can be so funny for the rest of us.) For Kevin Smith, ``Chasing Amy'' represents a big step ahead into the ranks of today's most interesting new directors. Smith, a New Jersey native, is the legendary guerrilla filmmaker who made the comedy ``Clerks'' (1994) on a budget of $24,000; his heroes, who worked behind the counters of a convenience store and the video store next door, talked endlessly about sex, life and videotapes. Because Smith was such a gifted creator of dialogue, the movie worked, despite its bargain-basement production values.\n\nHis next film was ``Mallrats'' (1995), a disaster (Smith actually apologized for it at the 1996 Independent Spirit Awards). His mistake was to try to direct an action comedy with stunts and special effects, when in fact his real gifts are as a writer. Smith's direction is clunky and basic: He tends to arrange his characters, aim the camera, and let them talk. Visual grace is not yet his strong point, but in a movie like ``Chasing Amy'' that is absolutely all right. His strength is the ability to create characters and give them dialogue that's alive and charged.\n\nLike Quentin Tarantino, he is willing to follow his characters into the subjects that obsess them, even if they seem to be straying from the plot. Here we get, for example, a hilarious speech at the Comicon about the racism and white imperialism of ``The Holy Trilogy'' (``Star Wars''), delivered by a wonderful character named Hooper (Dwight Ewell)--a gay black man whose militant anger is partly a put-on and partly real pain, masked in irony.\n\nThere are also well-written speeches of surprising frankness about sex (the plumbing as well as the glory). ``Chicks never tell you what to do,'' Holden complains. He thinks they should handle sex ``like CNN or the Weather Channel--providing constant updates.'' The main line of the story involves Holden's discovery that Alyssa is gay, and his even more inconvenient discovery that he loves her, anyway--loves her, and her wit and personality and throaty, chuckling voice with an intensity that reveals to him the vacuity of all his previous loves. He is desperate. And so is Banky, his best friend, who also may be secretly in love with him.\n\nThe movie's sneaky in the way it draws us in. We expect the characters to exist at a certain comic level, and they do, but then important things happen to them (love, friendship and happiness are all threatened--along with all the adjustments of self-image that are necessary if romance is going to be able to leap across the straight/gay divide). Even the most simple characters can be eloquent when their lives are at issue, and these characters aren't simple. Like the clerks in Smith's first film, they're verbal, passionate and poetic.\n\nIn this film's many touching dialogue scenes, Alyssa and Holden spill out their secrets. In a lesser movie, that would be that. ``Chasing Amy'' has more up its sleeve. The closing scenes, which I will not reveal, spring deeper psychological surprises, and there is a three-way meeting among Holden, Alyssa and Banky that is moving and yet written with the skill of a screwball comedy.\n\nAs Alyssa, Joey Lauren Adams is a discovery. She has the kind of deep voice and conspiratorial smile that make you think she could be a buddy as well as a lover. Ben Affleck's role is tricky--emotionally, his character makes the biggest changes--and he always makes us believe him. Jason Lee's sidekick is good at not showing us all his cards; at the end, when it's important to know how he really feels, he doesn't make it easy for us. And Kevin Smith himself appears as Silent Bob, the character he's played in all three of his films. This time, Silent Bob opens up, with a heartfelt parable that explains who Amy was, and why she was being chased.[/QUOTE]\n &lt;a href=&quot;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/Clipboard01-28.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/Clipboard01-28.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/Clipboard02-27.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/Clipboard02-27.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/Clipboard03-27.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/Clipboard03-27.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/Clipboard04-25.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/Clipboard04-25.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/Clipboard05-21.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/Clipboard05-21.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/Clipboard07-3.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/Clipboard07-3.png&lt;/a&gt;\n\n----my rip from untouched DVD9----\n\n~~~~~~ Chasing Amy.avi ~~~~~~                                     \n                                                             \n\nFile Size (in bytes):...........................1,677,465,600                     \n                                                                              \n\n--- Video Information ---                                                       \nVideo Codec Name:...............................XviD ISO MPEG-4              \nDuration (hh:mm:ss):............................1:53:39                \nFrame Count:....................................163470             \nFrame Width (pixels):...........................672                  \nFrame Height (pixels):..........................368                  \nAspect Ratio:...................................1.826                     \nFrames Per Second:..............................23.976          \nVideo Bitrate (kbps):...........................1634                 \n......MPEG-4......B-VOP........................                    \nQuality Factor (bits/pixel)/frame:..............0.276&quot;                     \n\n                                                                                \n\n--- Audio Information ---                                                       \nAudio Codec:....................................0x2000 (Dolby AC3) AC3                   \nAudio Sample Rate (Hz):.........................48000             \nAudio Bitrate(kbps):............................192                 \nAudio Bitrate Type (&quot;CBR&quot; or &quot;VBR&quot;):............CBR            \nAudio Channel Count:............................6   \n\n********************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n &lt;a href=&quot;\nhttp://freakyflicks.proboards54.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://freakyflicks.proboards54.com&lt;/a&gt;\n\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE ","torrent":{"xt":"urn:btih:2ef2f743793ba3a3e37545b22fab3b5128533bd8","amp;dn":"Kevin+Smith+-+Chasing+Amy+%281997%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ef2f743793ba3a3e37545b22fab3b5128533bd8","infoHashBuffer":{"type":"Buffer","data":[46,242,247,67,121,59,163,163,227,117,69,178,47,171,59,81,40,83,59,216]},"announce":[],"urlList":[]}}