{"title":"0 A.D. Widget","uid":5238181,"size":438254,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:30b25a63da3e581b2c3d6b78e337ed5edaba3f2c&amp;dn=0+A.D.+Widget&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"easybtn","files":1,"time":1261628079,"description":"0 A.D. Widget\nÃ‚Â© Wildfire Games\n\n====== DESCRIPTION ======\n\n0 A.D. is a new freeware real-time strategy title currently under development by Wildfire Games. The full-featured game will showcases six unique classical civilizations, each depicted at their peak of economic growth and military prowess. Developed using a ground-breaking new game engine custom built to suit our needs, 0 A.D. will give players a rich and entertaining real-time gaming experience, peppered with historical authenticity.\n\nMac OS X users now have an easy way to keep up-to-date with 0 A.D. news and forum updates with the release of the 0 A.D. Widget! The application features a simple, user-friendly interface and dual-RSS feed support, displaying both new forum posts (listed as topics) and all news updates posted to the 0 A.D. homepage. The widget displays the 4 most recent news posts and the 12 most recent forum posts in public access forums.\n\n====== INSTALLATION ======\n\nOnce you have downloaded the ZIP archive, simply open the archive and double click on the 0 A.D. Widget icon and a window will appear asking if you wish to install the 0 A.D. widget. If you have installed the widget, but no 0 A.D. widget appears on your dashboard, simply click the plus icon in the lower-left corner of the screen and drag the 0 A.D. icon into the dashboard area. To get rid of the widget, hold ALT and hover over the widget in the dashboard and then click on the X icon that will appear in the upper-left corner.\n\nIf at any time you wish to uninstall the widget, click the plus icon in the lower-left corner of the dashboard and click 'Manage Widgets...' and find the 0 A.D. Widget in the list that will appear. Click the red icon with the minus symbol to move the 0 A.D. widget to the trash.","torrent":{"xt":"urn:btih:30b25a63da3e581b2c3d6b78e337ed5edaba3f2c","amp;dn":"0+A.D.+Widget","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30b25a63da3e581b2c3d6b78e337ed5edaba3f2c","infoHashBuffer":{"type":"Buffer","data":[48,178,90,99,218,62,88,27,44,61,107,120,227,55,237,94,218,186,63,44]},"announce":[],"urlList":[]}}