{"title":"The Goldebriars - 1964 Folk","uid":5363308,"size":57135148,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:30cf4ef1dc9fd84dacc15aeb740a1aa9ae87740b&amp;dn=The+Goldebriars+-+1964+Folk&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"k7sparky","files":13,"time":1266177505,"description":"The Goldbriars\n\n1.\tRailroad Boy \n2.\tHe Was a Friend of Mine \n3.\tCome Walk Me Out \n4.\tAlabama Bound \n5.\tPretty Girls and Rolling Stones \n6.\tA Munblin' Word \n7.\tOld Time Religion \n8.\tLong Time Trabellin' \n9.\tShenandoah \n10.\tNo More Auction Block \n11.\tSing out Terry O'Day \n12.\tVoyager's Lament \n13.\tShenandoah [Mono Single Version] \n14.\tPretty Girls and Rolling Stones [Mono Single Version] \n\nThe Goldebriars Biography:\n\nThe Goldebriars made a couple of obscure pop-folk albums for Epic in 1964. The group is notable not for their pleasant yet lightweight music, but for the inclusion of a few members who subsequently went on to much more significant projects in rock after the band broke up. The most prominent of these was Curt Boettcher, producer and performer of some of the most highly esteemed California sunshine pop of the '60s with the Association, Sagittarius, and the Millennium. Future Music Machine drummer Ron Edgar was also in the Goldebriars briefly in their final days, although he did not play on either of their albums. \nVocally, the Goldebriars were built around two sisters, Dotti Holmberg and Sherri Holmberg. At one point, the Goldbriars had three women and Boettcher singing, which, according to the liner notes for their second and final album, &quot;made the group sound very much like the Lennon sisters doing work songs.&quot; That's not the kind of selling point anyone would want to push too hard and the non-sister female vocalist left the group, though that might not have corrected the female-male imbalance too much, given Boettcher's own higher-than-average male vocals. Boettcher played guitar and arranged for the Goldebriars, and some hints of the stratospheric vocal blends he would specialize in on his later pop/rock productions can be heard in the group's harmonies. The two Goldebriars LPs, however, are twee period commercial folk music from the tail end of the folk revival, the vocals and arrangements sounding inventive at times, but gratingly precious at others. As was often the case on such folk-pop efforts, there was an almost desperate variety show eclecticism of repertoire, including original material, ethnic songs, protest tunes, traditional folk songs, and spirituals, given a somewhat whitebread treatment. \nAs some other obscure circa 1964 LPs did, there were oh-so-vague hints of a rock rhythm on some of the Goldebriars' material, particular on their second album, Straight Ahead!, which actually had some lightly stroked drums. Ron Edgar has recalled that Boettcher wanted to make the Goldebriars an electric folk-rock group, at a time when the Byrds' &quot;Mr. Tambourine Man&quot; had yet to become a hit and codify the style. In fact, toward the end of their life, the group did have an electric bass player, lead guitarist, and drummer (Edgar), and made an unreleased album using electric rock instrumentation. Until or unless that material gets released, however, it won't be possible to judge how innovative that incarnation of the band was. After Edgar left the Music Machine, he did collaborate with Boettcher again on recordings by the Millennium and Sagittarius later in the 1960s. ~ Richie Unterberger, All Music Guide\n","torrent":{"xt":"urn:btih:30cf4ef1dc9fd84dacc15aeb740a1aa9ae87740b","amp;dn":"The+Goldebriars+-+1964+Folk","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30cf4ef1dc9fd84dacc15aeb740a1aa9ae87740b","infoHashBuffer":{"type":"Buffer","data":[48,207,78,241,220,159,216,77,172,193,90,235,116,10,26,169,174,135,116,11]},"announce":[],"urlList":[]}}