{"title":"Vitalij Kuprij Discography (FIXED)","uid":5275294,"size":672713703,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:32284980603e5c3505e8eed3141d955bde5eab37&amp;dn=Vitalij+Kuprij+Discography+%28FIXED%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rippercg","files":100,"time":1263356513,"description":"This is the FIXED version of the previous homonimous torrent, which had some problems during seeding. Sorry for the inconvenience, folks. This one is perfectly fine. Shred on!\n\n\nBIO\n\n\nVitalij Kuprij (born 1974) is a Ukrainian-American pianist and composer, and keyboardist in the neo-classical progressive metal band Artension. He has been the recipient of numerous awards and prizes.\n\nKuprij has been the recipient of numerous awards and prizes. He won the prestigious first prize as the youngest person to compete in the All Union Chopin Competition held in the Republic of Kazan, Soviet Union; the gold medal in the Kiev Conservatory Competition and the Poltawa, Ukraine Mykola Lyssenko Competition. In addition he received first prize in the Geneva Duo Competition for Violin and Piano as well as the gold medal in the Piano 80 and Swiss Youth Competition; the Chicago Piano Competition; the New York Piano Competition; and the Cleveland Piano Competition. \n\nSince graduation from the Curtis Institute Mr Kuprij has been concertizing around the world. He recently was heard in Italy and Mexico where he played Chopin's 1st Piano Concerto and the most beloved Beethoven's 4th Piano Concerto to rave reviews with major orchestras. \n\nVitalij recently had his solo Carnegie Hall debut where he played two encores to an almost capacity crowd. From this event he was featured in a two page spread in the New York Times by Arts and Entertainment writer, Dan Wakin. \n\nThere is another side to this multi-faceted young man....Unlike most classically trained musicians Vitalij's cross-over capability into the neo-classical world evidences him as a leading force in the alternative rock and musical exploration as we know it today. He has numerous albums out under the Marquee Avalon and Yamaha labels. After moving to &quot;Number Two&quot; on the Japanese charts he has received offers from promoters for a world tour. He has been seen on the college scene to outstanding raves and has been heard giving incredible Master Classes and workshops in institutions and various venues throughout the United States including recent sessions in theTower Record stores in Japan. Here he has a tremendous following evidenced from the latest polls and charts. \n\nPresently, Vitalij is in negotiations with the Kiev Philharmonic to record the Rachmaninoff 2nd Piano Concerto. This will bring him back to his roots where as a child posters of Vitalij were seen throughout Russia and the Ukraine. \n\nMr Kuprij, when he is not touring, is working on his most challenging and requiring project to date in writing and composing his own piano concerto. Those who have heard the beginnings of this tremendous project are already feeling it to be a masterpiece that will be recognized in years to come. Mr Kuprij plans to dedicate his Concerto to the memory of his late father and mentor who was a professor of trombone and music theory in a conservatory in the Ukraine. ","torrent":{"xt":"urn:btih:32284980603e5c3505e8eed3141d955bde5eab37","amp;dn":"Vitalij+Kuprij+Discography+%28FIXED%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32284980603e5c3505e8eed3141d955bde5eab37","infoHashBuffer":{"type":"Buffer","data":[50,40,73,128,96,62,92,53,5,232,238,211,20,29,149,91,222,94,171,55]},"announce":[],"urlList":[]}}