{"title":"Audio Book : Bill Koon - Hank Williams, So Lonesome","uid":5310384,"size":87590837,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:328feed10c045accec31be2953a644008bebcaf0&amp;dn=Audio+Book+%3A+Bill+Koon+-+Hank+Williams%2C+So+Lonesome&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"LetThemEatCake","files":7,"time":1264540256,"description":"Taken From Amazon\n\n Hank Williams (1923--1953) is revered in the top tier of the country-music pantheon, and his forlorn ballads are classics in the country songbook. An inspired, natural genius, Williams was the complete country balladeer. Though he knew almost nothing about the technicalities of music, his plaintive songs--&quot;Cold, Cold Heart,&quot; &quot;Your Cheatin' Heart,&quot; and &quot;I'm So Lonesome I Could Cry&quot;--affirm that he knew everything about its heart.\nWilliams was to country music what Elvis Presley was to rock 'n' roll. With his legend already firmly established, he was only twenty-nine when he died on New Year's Day 1953 (or, perhaps, New Year's Eve 1952) in the back seat of his baby-blue Cadillac on the way to a concert in Canton, Ohio. Interest in Williams is unflagging, and myths and tall tales about his life and death continue to grow with every passing year.\nAlthough the fascinating trail of Williams's career has been a favorite subject for biographers, Hank Williams, So Lonesome winnows away the myths and hearsay while recounting this Alabama boy's blazing rise to stardom. This close look at Williams moves beyond other books by providing new research, evaluations, and interviews with friends, family, and band members. Of the many biographies this one comes closest to being truly accurate.\nIt focuses also upon the music itself, confirming that Williams was a natural songwriter and performer like none other. This new assessment analyzes the Williams legacy by reviewing both the printed and recorded music and by thorough exploration of the Williams bibliography and discography.\nBill Koon, a professor of English at Clemson University, is the editor of Classic Southern Humor. \n\nA brief search reveals little about the author other then the above.\n","torrent":{"xt":"urn:btih:328feed10c045accec31be2953a644008bebcaf0","amp;dn":"Audio+Book+%3A+Bill+Koon+-+Hank+Williams%2C+So+Lonesome","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"328feed10c045accec31be2953a644008bebcaf0","infoHashBuffer":{"type":"Buffer","data":[50,143,238,209,12,4,90,204,236,49,190,41,83,166,68,0,139,235,202,240]},"announce":[],"urlList":[]}}