{"title":"1999-07-25","uid":5426548,"size":370602631,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:33bb598c7685180e0ae9063dc696f471e094a9b2&amp;dn=1999-07-25&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ptdotd2","files":19,"time":1268270459,"description":"Set 1: Meat, My Friend, My Friend  -&gt; My Left Toe -&gt; Whipping Post[1]  &gt; Makisupa Policeman[2] &gt; Happy Birthday to You[3], Makisupa Policeman, Saw It Again, Boogie On Reggae Woman, Cavern\n\nSet 2: Birds of a Feather[4] -&gt; Walk Away, Run Like an Antelope, Suzy Greenberg[5], Hold Your Head Up[6] &gt; Purple Rain[7] &gt; Hold Your Head Up, You Enjoy Myself[8]\n\nEncore: Loving Cup\n\n[1] Trey on vocals instead of the usual Fishman.\n[2] Key words were &quot;gooballs, brownies, stink, kind nugs... keef!&quot;\n[3] Instrumental from Trey and then &quot;rasta style&quot; sung (with a We're gonna get you so wasted tonight after the show&quot; lyric), Mike took a bass solo, Fishman also sung a verse in a mock Jamaican accent (with a &quot;you roll up a big spleef and you don't pass it with no one&quot; lyric). Kuroda then took a one-minute light solo.\n[4] Unfinished; contained a My Left Toe tease.\n[5] Stash tease.\n[6] I Wish teases and a syncopated jam based around Page.\n[7] Fishman forgot the words and subsequently thanked the crowd for supporting his vacuum cleaner habit.\n[8] Boogie On Reggae Woman jam.\n\nNotes: Whipping Post was played for the first time since August 10, 1996 (207 shows) and featured Trey on vocals instead of the usual Fishman. The Makisupa key words were &quot;gooballs, brownies, stink, kind nugs... keef!&quot; Happy Birthday was first played by Trey instrumentally over Makisupa before he announced Chris Kuroda's birthday and asked the crowd to join in as he sung the song &quot;rasta style&quot; (with a &quot;We're gonna get you so wasted tonight after the show&quot; lyric). Mike subsequently took a bass solo and Fishman sung a verse solo in a mock Jamaican accent (with a &quot;You roll up a big spliff and you don't pass it to no one!&quot; lyric). Chris took a silent light board solo (see also April 18, 1990) at Trey's request before Makisupa resumed. The second set featured multiple teases and jams, including the unfinished Birds (My Left Toe tease), Antelope (Stash tease), Suzy (I Wish teases and a syncopated jam based around Page) and YEM (Boogie On Reggae Woman jam). In Purple Rain, played for the first time since August 6, 1996 (209 shows), Fishman forgot the words and subsequently thanked the crowd for supporting his vacuum cleaner habit.","torrent":{"xt":"urn:btih:33bb598c7685180e0ae9063dc696f471e094a9b2","amp;dn":"1999-07-25","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33bb598c7685180e0ae9063dc696f471e094a9b2","infoHashBuffer":{"type":"Buffer","data":[51,187,89,140,118,133,24,14,10,233,6,61,198,150,244,113,224,148,169,178]},"announce":[],"urlList":[]}}