{"title":"Angels of Debauchery 8 (2010)","uid":5397574,"size":1459634176,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:3466ccafaa90e656dae2ba1b4eafad9fefabba6e&amp;dn=Angels+of+Debauchery+8+%282010%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"webchella","files":2,"time":1267292662,"description":"Angels of Debauchery 8 (2010)\n &lt;a href=&quot;\nhttp://www.imagengratis.org/images/angelsofde.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imagengratis.org/images/angelsofde.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://www.jadedvideo.com/Evil_Angel/Angels_of_Debauchery_8_DVD.5-56584.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.jadedvideo.com/Evil_Angel/Angels_of_Debauchery_8_DVD.5-56584.html&lt;/a&gt;\n\nStudio  Evil Angel \nRelease Date  Feb 18, 2010 \nCategory  Gonzo, All Sex, HD - Shot In High Def \nDirector  Jonni Darkko \nStarring  Monique Alexander, Misty Stone, Prince Yahshua, Sadie West, Andy San Dimas, Emy Reyes, Katie St. Ives, Mark Ashley, Sean Michaels \n\nJonni Darkko delivers again with a new edition of his award-winning series, Angels of Debauchery. This installment features more of the same - the sexiest girls in porn teasing and posing, only to then get fucked silly. The movie starts with ...    Full Descriptionformer contract starlet Monique Alexander, sporting some new tattoos and a cock-hungry look on her face. Mark Ashley fucks her pussy in numerous positions with his enormous dick, and finally cums on her waiting tongue. Next up is Andy San Dimas, who takes Prince Yahshua's big black dick deep into both her throat and pussy. Prince finishes by throat-fucking her until he drops a huge load right in her eager mouth. Mark Ashley returns in the next scene, this time to service two pussies, both ready for action. Those pussies belong to sultry Latina Emy Reyes, and stunning black girl Misty Stone. The girls take turns passing Mark's tongue and dick between their waiting holes, until Emy jerks his load onto their side-by-side smiles. Dirty-mouthed sexpot Sadie West is up next, as she pairs with Mark on a sweat-filled, off-the-wall fuckfest. He pounds her pussy in countless positions, before she gobbles his long-awaited load. Finally, newcomer Katie St. Ives is welcomed by Sean Michaels, as he works his tongue all over her body, before plunging his black cock deep in her waiting pussy. He fucks her tight hole until he comes all over her nubile face.\n\n","torrent":{"xt":"urn:btih:3466ccafaa90e656dae2ba1b4eafad9fefabba6e","amp;dn":"Angels+of+Debauchery+8+%282010%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3466ccafaa90e656dae2ba1b4eafad9fefabba6e","infoHashBuffer":{"type":"Buffer","data":[52,102,204,175,170,144,230,86,218,226,186,27,78,175,173,159,239,171,186,110]},"announce":[],"urlList":[]}}