{"title":"RDesc 2.26 - Auto download from popular file hosting website.","uid":5238679,"size":875453,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:346bdb801a62c595bf1f400dd94f0967397e5084&amp;dn=RDesc+2.26+-+Auto+download+from+popular+file+hosting+website.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"nat327","files":1,"time":1261654860,"description":"What is RDesc? \n\n\nRDesc is a freeware utility that is the automated download of files from multiple hosts direct download in both free and premium version. This automates the entire process of waiting and downloading files from these hosts to users with or without premium account. This allows the download of a list of links without further intervention by the user that you add that list to the program. \n\n\n\nHost supported in free version: \nEasy-Share, Gigasize, HotFile, Depositfiles, zShare, Netload,FileFactory, Storage.to, SendSpace,Badongo, Megarotic, Megaporn, Freakshare, Ziddu. \n\n\n\nHost supported in Premium version: \n\n\n  \nIts main characteristics are: \n- Allows you to download files from several hosts automatically and simultaneously. \n- The program allows a download links to both servers sharing, downloading all the files automatically and without repeating any of them. \n- Multi-language program available in 12 different languages. (English, Spanish, Catalan, Galician, Brazilian Portuguese, Iberian Portuguese, German, Croatian, Korean, Turkish, Romanian and French). \n- Has option to add all links that contains a web page just by typing the URL of the page. \n- Allows use an application to reconnect the router if any of the downloads returned a timeout for the next download. \n- Start just some of the links we have listed. \n- Has option to shutdown PC automatically at the end of the links that were initiated (not all complete list). \n- Keep a record of all links downloaded (there is an option that is cleared each time you close the program). \n- Added text box to search web download direct through the taskbar. \n- Keep statistics on the number of links downloaded, time spent, average speed etc, of all downloads. \n- Set up to post links to Flashgot RDesc. \n\n\n\nPlatform and requirements: \n- RDesc runs under Windows XP, Windows Vista and Windows 7. \n- To function RDesc requires installed Microsoft. NET Framework version 3.5 or higher, which can be downloaded for free from this link to the Microsoft site. \n","torrent":{"xt":"urn:btih:346bdb801a62c595bf1f400dd94f0967397e5084","amp;dn":"RDesc+2.26+-+Auto+download+from+popular+file+hosting+website.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"346bdb801a62c595bf1f400dd94f0967397e5084","infoHashBuffer":{"type":"Buffer","data":[52,107,219,128,26,98,197,149,191,31,64,13,217,79,9,103,57,126,80,132]},"announce":[],"urlList":[]}}