{"title":"From.Mexico.With.Love.2009.DVDRip.H264[REQ]","uid":5346503,"size":327454006,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:347ef82cef6f3e38c4b3e332127b00fb69f0101f&amp;dn=From.Mexico.With.Love.2009.DVDRip.H264%5BREQ%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"twentyforty","files":1,"time":1265656468,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0457355&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0457355&lt;/a&gt;\nDirected by Jimmy Nickerson.\n With AngÃƒÂ©lica AragÃƒÂ³n, Steven Bauer, Kuno Becker. \nAction | Drama \n\nPLOT:Hector Villa, physically tough, but emotionally self-destructive, is one of the millions of illegal migrant workers vying for a new life in the U.S., and will do everything he can to rise above picking fruit in the dirt. Hector dreams of being a boxer, like his father before him, but finds he has to fight just to survive the grim reality of living on a Texas Ranch. During the day Hector works long hours under the scorching sun. But at night, he trades his work gloves for boxing gloves, fighting in the surrounding bars and converted barns, where a five dollar entrance fee and a few rounds in a makeshift ring can score the winner more than a days pay in the sweltering fields.\n\n *** Small-sized 2-pass re-encode of DVD rip for computers (PC, Mac), PS3 or Xbox, portable and mobile devices (Ipod, Itouch) . ***\n*** Video is 480x272 H264; audio is 44.1 kHz/stereo AAC LC and container is MP4. ***\n\nI recommend CoreCodec for H264 (avc1, x264) video-playback, free DivX 7 for AAC sound-playback (and .mkv with AAC), Haali splitter (free, comes with CoreCodec) as the fastest and best combination for Windows Media Player. This is what I use.\nVLC player (free), mplayer (free) and KMplayer (free) are available as alternative for all platforms (operating systems) out there and have BUILT-IN codecs and MP4 capabilities. But, video quality is approx. 10-15% lower, blurrier at least on system I have.\nOne can try CCCP matroska codec pack, where ffdshow codec/filter packs and Haali splitter comes in one package and support MP4 playback - but extra caution is required during the install process.\nQuickTime of course, supports H264/AAC natively.\nPS3 + HDMI cable + newer TV have been reported as best combination.\nAnd please, do not watch it with a nose in the screen, take proper distance to the monitor or TV (as advised in TV manuals).Many of movies I encode have embedded subtitles. So far, only VLC player is able to use them correctly.\n\n&quot;Home&quot; of my torrents (for Bookmark/Favorites in your browser) &lt;a href=&quot;\nhttp://thepiratebay.se/user/twentyforty&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/twentyforty&lt;/a&gt;\n","torrent":{"xt":"urn:btih:347ef82cef6f3e38c4b3e332127b00fb69f0101f","amp;dn":"From.Mexico.With.Love.2009.DVDRip.H264%5BREQ%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"347ef82cef6f3e38c4b3e332127b00fb69f0101f","infoHashBuffer":{"type":"Buffer","data":[52,126,248,44,239,111,62,56,196,179,227,50,18,123,0,251,105,240,16,31]},"announce":[],"urlList":[]}}