{"title":"Fallen_Angel-the_Outlaw_Larry_Norman","uid":5224583,"size":1486333447,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:34db26a30fa7afe7a9c928ed5ee5fae39e21f404&amp;dn=Fallen_Angel-the_Outlaw_Larry_Norman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"NoDeity","files":3,"time":1261069742,"description":"If you could combine the onstage magnetism of Mick Jagger, the lyrical brilliance of Bob Dylan and the personal fragility of Brian Wilson, you would only have begun to scratch of the surface of Larry Norman. FALLEN ANGEL: The OUTLAW LARRY NORMAN recounts the rise of the father of Christian rock music as the rock 'n' roll Billy Graham' of the 1970s through to the height of success as the visionary behind Solid Rock Records before a personal meltdown and subsequent fall from grace exiled him to the margins of the Christian subculture he helped create.\n\nA study in polar contrasts, Larry Norman's story presents the viewer with a complex character grappling with the price of genius, the struggle made all the more difficult because Norman chose to make his mark within a religious subculture struggling to define its place within the world. Too religious for the rock 'n' rollers but too rock 'n' roll for the religious crowd, Larry Norman is the perpetual outsider, ultimately imploding under the weight of trying to fuse his position as the musical voice of the Jesus movement with his desire for '70s rock superstar status. Is he the misunderstood musical prophet of the Christian world? Is he an outlaw conning the faithful? Larry Norman is a walking contradiction, partly truth and partly fiction.\n\nTold mainly from the perspective of those who worked with him and loved him during the height of his success, feel the power of the music he created as refracted through the inconsistencies of the life he led. Experience the forgiveness offered by those most hurt and witness a glimmer of grace against the backdrop of moral failure. Fallen Angel is a rock n' roll epic of biblical proportions.","torrent":{"xt":"urn:btih:34db26a30fa7afe7a9c928ed5ee5fae39e21f404","amp;dn":"Fallen_Angel-the_Outlaw_Larry_Norman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34db26a30fa7afe7a9c928ed5ee5fae39e21f404","infoHashBuffer":{"type":"Buffer","data":[52,219,38,163,15,167,175,231,169,201,40,237,94,229,250,227,158,33,244,4]},"announce":[],"urlList":[]}}