{"title":"Need For Speed ProStreet [PAL] [WiiTorrentZ]","uid":5305819,"size":4442409471,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:3617f73410778b63e9010c376b479ee1a0656e30&amp;dn=Need+For+Speed+ProStreet+%5BPAL%5D+%5BWiiTorrentZ%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ecabuk","files":-1,"time":1264382106,"description":"NAME: Need for Speed: Prostreet\nREGI: PAL\nLANG: ENG\nGENR: Racing &amp; Flying &gt; Car\nSIZE: 4.13GB\n\nProduct Description\nNeed For Speed: Prostreet Wii Compete at the Highest Level of Street Racing! Compete at the highest level of street racing with Need for Speed ProStreet. It's no longer good enough to simply rule your local neighborhood; you need to dominate on a global stage. Build the ultimate battle machine, take it to multi-disciplinary showdowns and pit your skills and reputation against the world's best street racers. Every dent, every scratch and every crumpled body panel is a battle scar, proof of your commitment and competitive mettle. This is your chance to prove that you have what it takes to be crowned the next Street King. Need for Speed ProStreet is the realization of the raw power, visceral aggression and intense rivalry that embodies street racing culture.\n&gt;Real, Adrenaline-Fueled Racing Experience the raw power of street racing with a brand new physics engine, and intuitively refined AI. Dominate Across All Racing Disciplines Prove yourself in four distinct styles of racing: Drag, Drift, Grip, and the all-new Speed Challenge.\n&gt;Ride the Edge of Disaster One wrong move, and witness the consequences of your mistakes via truly advanced and comprehensive damage capturing technology.\n&gt;Performance Drives ResultsChoose from hundreds of real-world, aftermarket parts and see the impact of visual Autosculpt technology on performance -- all in real time.\n&gt;Redefining Competitive Social Play Redefined online features amp the spirit of competition and create for the ultimate showdown.\n&gt;Share your Tuning Capabilities with the World The all-new Blueprints feature allows you to upload your visual and performance customization settings online. You'll be credited each time your design is used to dominate a race.","torrent":{"xt":"urn:btih:3617f73410778b63e9010c376b479ee1a0656e30","amp;dn":"Need+For+Speed+ProStreet+%5BPAL%5D+%5BWiiTorrentZ%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3617f73410778b63e9010c376b479ee1a0656e30","infoHashBuffer":{"type":"Buffer","data":[54,23,247,52,16,119,139,99,233,1,12,55,107,71,158,225,160,101,110,48]},"announce":[],"urlList":[]}}