{"title":"Baby Felix en zijn vriendjes - DVD-Box - (DUTCH) 2Lions-Team","uid":5394413,"size":9501629296,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:371d67b6f5583b7ed1bfa4c1750df3d45663ff22&amp;dn=Baby+Felix+en+zijn+vriendjes+-+DVD-Box+-+%28DUTCH%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Pioen","files":-1,"time":1267181835,"description":"Baby Felix en zijn vriendjes - DVD-Box - 4 dvd's      \n\n \n  DVD 1\n\nBaby Felix is een ondeugende kater, zo eentje die niet terugdeinst voor avontuur en een neusje heeft voor problemen. Samen met zijn vriendjes Baby Kitty, Mookie, Mimi, Skippy en Tattoo beleeft hij allerlei kleurrijke avonturen. En of ze nu samen gaan kamperen of een buitenaards wezen ontmoeten, Felix en zijn magische tas zorgen er altijd voor dat het spannend blijft tot het einde. Ga je mee naar de wereld van 'Baby Felix en zijn vriendjes'?\n\nEnglish\n\n\nBaby Felix is a naughty cat, as one who is not afraid of adventure and a nose for trouble. Together with his friends Baby Kitty, Mookie, Mimi, Skippy, and Tattoo he experiences many colorful adventures. And whether they go camping together or meet an alien, Felix and his magic bag always make sure that it stays exciting until the end. Are you coming to the world of Baby Felix and his friends?\n\nAflefering 1\nDromen van honkbal - Wie is de eerste? - Van wie is dit kado? - Laat dat maar aan baby Felix over!\nAflevering 2\nIk wil die tovertas! - Dromen van de tovertas - Ik hou van mijn tovertas! - Geen babytas meer!\nAflevering 3\nHier is de professor! - Baby Felix ontsnapt! - Wie paktde tovertas? - Operatie chocola!\n\n DVD 2\n\n\nAflevering 4\nWe gaan kamperen - Vissen op zijn Mookie's - De bodfee? - Een slaapliedje\nAflevering 5\nZeven jaren ongeluk - Wie van de twee is Mimi? - Kristal helder! - We gaan naar huis!\nAflevering 6\nAvonturen in het oude kasteel - avontuur aan zee - Pas op voor Pirateneiland - Wegwezen!\n\nDVD 3\n\nAflevering 7\nMarty het ondeugende marsmannetje - Allen aan boord van de ruimtebus - Marty doet een goede daad - Tot ziens Marty!\nAflevering 8\nWie is die heks? - Ze heer Esmeralda - EEnbezem met uitzicht - Tor zien Wsmeralda\nAflevering 9\nBoor race - Hop hop hop - Karting Race! - Sjate boaard gekte\n\n DVD 4\n\n\nAflevering 10 \nHey Pointexter - De zonne-energie robot - He! Ik wil mijn chocola - Stout is niet lief!\nAflevering 11\nIk ben dol op chocoladetaart - Met kleine stapjes - Red de Robot! - Wat een grote aansteller!\nAflevering \n12 Een slag in de lucht! - Geef ze cake! - Ninja Baby - Tel maar uit!\n\n\n\nNederlands gesproken!\nDe Cover en Label : Yes\n\n\nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail\n \nOndertitels : Geen\n \nGenre : Animatie\nKinderfilm \n\nThanks :  albertina \n\n*****************************************\n\nBrought to you by\n2Lions Team \n\n\n\n\n\n2Lions-Team for all your Dutch MOVIES and more \n\n***************************************** \n\nDON T HIT AND RUN Niet gelijk afhaken als de CD binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n\n  \n \n \n","torrent":{"xt":"urn:btih:371d67b6f5583b7ed1bfa4c1750df3d45663ff22","amp;dn":"Baby+Felix+en+zijn+vriendjes+-+DVD-Box+-+%28DUTCH%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"371d67b6f5583b7ed1bfa4c1750df3d45663ff22","infoHashBuffer":{"type":"Buffer","data":[55,29,103,182,245,88,59,126,209,191,164,193,117,13,243,212,86,99,255,34]},"announce":[],"urlList":[]}}