{"title":"The Pacific 2010 HDtv RIP","uid":5438857,"size":574491077,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:38835744ff25cc6ee24e2c6cb51ed5f00f78ddb6&amp;dn=The+Pacific+2010+HDtv+RIP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"vsigns","files":-1,"time":1268818279,"description":"torrent downloaded from &lt;a href=&quot;\nhttp://www.007torrentz.co.uk/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.007torrentz.co.uk/&lt;/a&gt;\nspeed quality \nNo fakes\n\n\n\n\n\nDescription:\n'Genre: Drama \nYear: 2010\nCountry: USA\nRuntime: 60+ min\nDirectors: Tim Van Patten, David Nutter, Jeremy Podeswa, Graham Yost, Carl Franklin, Tony Torn\nProducers: Steven Spielberg (executive), Tom Hanks (executive), Gary Goetzma\nWritten by: Bruce McKenna, Robert Schenkkan, Graham Yost, George Pelecanos, Larry Andries, Michelle Ashford\nCinematography by: Remi Adefarasin, Stephen F. WindonrnrnCast: Isabel Lucas, William Sadler, Rami Malek, Joseph Mazzello, Jon Bernthal, Brenden Fletcher, James Badge Dale, Jon Seda,\nPlot :The Pacific is based primarily on two memoirs of U.S. Marines: With the Old Breed by Eugene Sledge and Helmet for My Pillow by Robert Leckie. The series will tell the stories of the two authors and Marine John Basilone, as the war against the Empire of Japan rages. Additional material for The Pacific is provided from the books Red Blood, Black Sand (Chuck Tatum), and China Marine (Eugene B. Sledge).rnrnrnrnGiven the literary sources mentioned above, the series will feature well-known battles involving the 1st Marine Division, such as Guadalcanal, Cape Gloucester, Peleliu, and Okinawa, as well as Basilone's involvement in the Battle of Iwo Jima.rnrnrnrnHugh Ambrose has authored the official tie-in book to the series, which follows the stories of the three men featured in the series as well as stories of their fellow Marines.  BY SABBYrn rnrnrn&quot;The Pacific&quot; (2010) rnrnSeasons:1 rnrnGenresrama, War rnrnRating:9.7/84 (Votes) rnrnCountry:USA rnrnLanguages:English rnrnPlot Outline:rnA 10-part mini-series from the creators of &quot;Band of Brothers&quot; telling the intertwined stories of three Marines during America's battle with the Japanese in the Pacific during World War II.rnrnrnrnrnrnill get the rest when out '\nCategory:\tTV &gt; Episodes","torrent":{"xt":"urn:btih:38835744ff25cc6ee24e2c6cb51ed5f00f78ddb6","amp;dn":"The+Pacific+2010+HDtv+RIP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38835744ff25cc6ee24e2c6cb51ed5f00f78ddb6","infoHashBuffer":{"type":"Buffer","data":[56,131,87,68,255,37,204,110,226,78,44,108,181,30,213,240,15,120,221,182]},"announce":[],"urlList":[]}}