{"title":"FIFA 2010 [PAL] [WiiTorrentZ]","uid":5270049,"size":4599464925,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:396c1e3e8ad1f053d40067ded23ccb28f5d759b5&amp;dn=FIFA+2010+%5BPAL%5D+%5BWiiTorrentZ%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ecabuk","files":-1,"time":1263026948,"description":"NAME: FIFA 2010 [PAL]\nLANG:ENG\nREGION:PAL\nSIZE: 99mb x 44\n      30mb x 1\n      \n      Total:4.28GB\n\nProduct Description\n\nLast year's game topped the league and now the all-new FIFA 10 is looking to defend its title as the number one football action game. More realistic than ever, this latest sequel has greatly improved artificial intelligence, ball physics and graphics.\n\nBrand new this year is the 360 degree dribbling system, giving you the most precise control ever. There are also changes to how the defensive line is formed, as well as improvements to crosses, freekicks and goalkeepers (who can now receive red cards).\n\nNaturally the game retains its hugely successful on and offline multiplayer modes, with new options and better stability for online play. The manager mode has also seen a massive update to make it just as deep and complex as the main game. With all these new features and more EA Sports are betting on FIFA remaining the champions for a long time to come. \n\nKey Features\n\nLeagues better: The world's most successful football sim gets even better with improvements across the board, including physics, controls and multiplayer options.\nDynamic dribble: New 360 degree dribbling control system allows for pixel perfect control of the ball at all times\nFootball focus: Newly improved artificial intelligence ensures teammates and opponents always move with a purpose and stay focused on the ball at all times\nBeautiful game: Massively improved graphics, including better player likenesses, new crowd animations and new rain and snow effects that really affect the gameplay.\nMaster manager: Greatly expanded manager mode, with a revamped experience point system and staff upgrades, a new interface and the chance to edit kit numbers.","torrent":{"xt":"urn:btih:396c1e3e8ad1f053d40067ded23ccb28f5d759b5","amp;dn":"FIFA+2010+%5BPAL%5D+%5BWiiTorrentZ%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"396c1e3e8ad1f053d40067ded23ccb28f5d759b5","infoHashBuffer":{"type":"Buffer","data":[57,108,30,62,138,209,240,83,212,0,103,222,210,60,203,40,245,215,89,181]},"announce":[],"urlList":[]}}