{"title":"Left 4 Dead Aim bot v1.4","uid":5235233,"size":299067,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:39c8c75d46066f51af37e646ee8a336d2060acce&amp;dn=Left+4+Dead+Aim+bot+v1.4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Pwnsteam","files":1,"time":1261503957,"description":"Game: Left 4 Dead 2 and Left 4 Dead 1 ( original )\nAnti-Cheats: VAC, VAC2, Steambans\nFeatures: Aimbot, ESP, Wallhack, Visuals, Nametags, Removals\nCompatibility: Windows XP / Vista / Windows 7\n\n\nThis hack is compatible with both Left 4 Dead 2 and Left 4 Dead 1. For left 4 dead 2, we added additional options such as anti boomer bile, grenade launcher distance checker and support for the new monsters (charger, jockey, spitter )\n\n\nFeatures:\n\n\n\nAimbot:\n\nAuto Aim/Auto Shoot\nChoose from Customizable activation key.\nChoose from different Hitboxes to aim for; Head/Neck/Chest/Waist\nChoose to aim through walls or not\nChoose how to aim at targets- By distance to you or how close they are to your crosshair\nHumanized Aiming - Even though your using a aimbot, it looks legit as a human is aiming\n\n\nESP:\n\nZombie ESP See the position of all regular zombies\nSpecial Zombie ESP See the position of all special zombies (Tank, Boomers, hunters, etc..)\nEntity ESP See where all items are (Health, Weapons, Pickups)\nHealth Tags, Show health of all humans and zombies.\nVisual Tags, Shows an icon or frame around enemies to give away their position, even behind walls.\nDistance Tags, Show the distance between you and all humans and zombies..\n\n\nVisual Options:\n\nCrosshair, Select from three different custom crosshairs to make manual aiming easier.\nRadar, Render a an on-screen minimap showing all enemies.\nChamz, paints a bright color skin, visible through walls, on both humans and zombies.\n\n\nRemovals:\n\nSelect varying degrees of No Spread or No Recoil\nCauses all shots fired to be confined to the exact point where your crosshair lies.\nNoRecoil : Removes all recoil from your gun, so that it doesn't pull up anymore on pistols, etc...\nNoSpread : Removes all bullet spread, so your bullets all go in the same spot, even on full auto\n\n\nMisc:\n\nBunny Hop, Hold down space bar to automatically jump continuously.\nAuto Pistol, Hold down L-Mouse button or your firing key to turn your pistol into a fully automatic pistol.\nTrigger Bot, Lets you be more discreet by only firing when your crosshair hovers over the enemy.","torrent":{"xt":"urn:btih:39c8c75d46066f51af37e646ee8a336d2060acce","amp;dn":"Left+4+Dead+Aim+bot+v1.4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39c8c75d46066f51af37e646ee8a336d2060acce","infoHashBuffer":{"type":"Buffer","data":[57,200,199,93,70,6,111,81,175,55,230,70,238,138,51,109,32,96,172,206]},"announce":[],"urlList":[]}}