{"title":"Chris Brown - Crawl  (2nafish)","uid":5230534,"size":166371332,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:3a573074d095b298ae37df4318a6d7af7c7f5d82&amp;dn=Chris+Brown+-+Crawl++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":1,"time":1261315493,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 4000 Kb/s\nAudio: Linear PCM, 48000 Hz, Stereo, 1536 kbps\n\n\nThis video has no logo.\n\n\n&quot;Crawl&quot; is the second single off Chris Brown's third album Graffiti. The song was co-written by Nasri, Adam Messinger, and Luke James, and was produced by The Messengers.\n\nThe music video was directed by Joseph Kahn, who also worked with Brown on the I Can Transform Ya and Forever videos. He predicted the visuals to &quot;Crawl&quot; will make as much of an impact as the song.  But Brown told MTV News that the song actually isn't just about his own relationships. He said &quot;Crawl&quot; is more of a universal message dedicated to moving on past any type of heartache. The video for &quot;Crawl&quot; features R&amp;B artist and model Cassie. The video premiered on the Wendy Williams Show on Friday, November 13, 2009.\n\nAt the beginning of the video, we see Brown sitting on his bed with his heart being seen through his shirt as he starts to sing the first verse. The scene then changes to the street where we see load of paparazzi taking photos of Cassie and Chris standing there hoping she will notice him, but she does not so Chris walks away. The scene changes and Cassie walks into a shop where Chris is standing but he walks out singing which gets Cassie's attention. Then they are both seen walking towards each other where they meet in the middle.\n\nThe &quot;Crawl&quot; features Brown pensively singing about a relationship that has slipped out of his hands. &quot;When I heard the whole concept and everything I was like, 'Yo, this is crazy,&quot; Brown said about the track. He also said that it could be the best record he's ever done. It is also speculated that the song could be referring to Brown's failed relationship with Rihanna, though Brown has confirmed that the track isn't just about her but has more of a universal message.\n\nThe song premiered at U.S. radio on October 21, 2009. The song became available as a Digital Download on November 24, 2009. It will officially be sent to U.S. radio on December 8, 2009.\n\nAfter premiering the song on MechanicalDummy.com, the song made its official debut on the R&amp;B/Hip-Hop Songs chart at #99. On the week ending December 12, 2009, &quot;Crawl&quot; also debuted on the Billboard Hot 100 at #68 and has risen to #60.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:3a573074d095b298ae37df4318a6d7af7c7f5d82","amp;dn":"Chris+Brown+-+Crawl++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a573074d095b298ae37df4318a6d7af7c7f5d82","infoHashBuffer":{"type":"Buffer","data":[58,87,48,116,208,149,178,152,174,55,223,67,24,166,215,175,124,127,93,130]},"announce":[],"urlList":[]}}