{"title":"4winds music mod for Medieval 2 Total War","uid":5278833,"size":1250430304,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3acf6537d8077afa05710239bef6fbd506573449&amp;dn=4winds+music+mod+for+Medieval+2+Total+War&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Kladdey","files":1,"time":1263476682,"description":"****** IT IS NOT MY MOD, JUST A REUPLOAD FOR TPB **************\n\n4Winds, a well respected member of M2TW modding community has created a pack, which adds immersive effects to Medieval 2 gameplay. Music here includes lots of movies soundtracks fitting Medieval theme. Must have for every M2TW fan.\n\n\n***************************************************************\n\nQuoting readme :\n\n\n\n-------------------------------------------------------\n&quot;4WINDS&quot; - A M2TW MUSIC MOD by Grand Duke Vytautas@TWC\n-------------------------------------------------------\n\n***Version 1.2*** (much improved than previous :))\n\nChangelog 1.2\n\n*corrected an error with the mute arabic track\n*removed some annoying tracks\n*added most tracks from Kingdoms expansion\n*reassignment of some tracks for cultures\n*over 20 new tracks from movies and games\n*fixed stuff in this readme\n\nChangelog 1.1\n\n*Fixed some mp3s volume (db) problems (too quiet) with Mp3Gain\n*Cut some parts of tracks to make them shorter (~3 min) to balance variety\n*Changed some songs in tension, mobilize, battle categories to better fit the mood\n*Added ~40+ very cool themes\n*Corrected couple of tracks that won't load (typo errrors in descr_sounds_music.txt)\n*expanded readme\n\n*************\nINTRODUCTION\n*************\nHello everybody,\n\nThis is my first mod and a gift to TWC community - M2TW music mod &quot;4winds&quot;. So give me a little respect lol\nIt adds many new music tracks to M2TW game. Imo music of the game is really important\nas it immerses you into the atmosphere/era of the game and adds that additional variety.\n\nI feel that I must somehow thank and pay tribute to the modders and members of this awesome TWc site\nfor their mods, hard work and efforts of improving an amazing M2TW game, thus as a thank I release this mod.\n\nWhy did I name it &quot;4winds&quot; you might ask. Well it's because M2TW campaign\nand battle music is divided into roughly 4 areas:\n\n*northern european (scotland, england, france, hre, denmark)\nThis music immerses you into a dark and cruel classical western medieval world\n*eastern european (poland, hungary, russia)\nsimilar to western style, but has that eastern and steppe flavour and a bit quicker tempo tracks.\n*southern european (spain, portugal, italian factions, byzantium)\nhot and fast tracks lets you relive medieval southern temperament\n*middle east (moors, egypt, turks)\nvery adventurous and arabic music surrounds you with truly unique atmosphere\n\nDownload 3 parts/files. \nThis mod requires M2TW version 1.3 (it should work on v1.1 or 1.2 too i think)\n\n**************************\nINSTALATION INSTRUCTIONS:\n**************************\nMake sure you follow them carefully\n\n1. First backup your events.dat, event.idx, Music.dat, and Music.idx files (in M2TW/data/sound)\nin case smth goes wrong.\n2. Extract all music folder mp3s to M2TW/data/sounds (so that all downloaded mp3s are in M2TW/data/sounds/music folder)\n3. Extract sound txt files (you may wanna backup them first) to M2TW/data\n4. Delete events.dat, event.idx, Music.dat, and Music.idx files in M2TW/data/sounds\n5. Very important!!!! Before you launch the game if you haven't unpacked the game put\n&quot;[io]\n file_first = true&quot;\ncommand (without quotes) in your config file (medieval2.preference.cfg - open with notepad). (I've unpacked so it works without it)\n6. Launch vanilla M2TW (Medieval2.exe) and wait a couple of minutes for the game to rebuild its music files\n7. Optionally: you can then delete M2TW/sounds/music folder (or backup in case for listening when not playing) if you see that the game has rebuilt music.dat file (which should be approx the same size as music folder) - in case you're runnin low on hdd space.\n8. If you use a mod (which doesn't change music) you only need to copy events.dat, event.idx, Music.idx files to yourmodname/data/sound\n*If you use Xenophonia mod you only need to copy (from sound txt files) descr_sounds_music.txt into M2TW/data.\n*If you play Stainless Steel mod contact me at TWC and I'll tell you how to incorporate this music.\n9. Enjoy the epic medieval music\n*********************************\n\n++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\nFinally if this stuff gets closed cuz of so-called copyright issues,\n(but damn I'm giving you a gift, sharing with you, you should be happy about it)\nthen feel free to PM me at TWC (Grand Duke Vytautas) and I'll give you a new download link\n++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n\n \n_____________________________________________________________________\n4winds music mod consists of these main pieces: (whole mod has ~300 mp3s including M2TW ost (75 tracks)\n\n*M2TW original tracks - well of course they totally get you into medieval mood, esp norhtern european's &quot;duke of death&quot; and &quot;solenka&quot; - those 2 are my fav\n*MTW ost - what an awesome war classics, remember those good old MTW times\n*some tracks from Alexander movie for Byzantines + Darth Vaders cool byz mobilize theme\n*RTR soundtrack, very nice music\n*Braveheart makes me cry everytime\n*RTW Chivalry mod music has some great themes\n*civilization 4 medieval music fits so good for campaign map\n*some tracks from CC-light music mod from RTW\n*few themes from Europa Universalis for campaign map\n*King Arthur movie music is so panoramic and epic\n*Kingdom of Heaven ost - this is a must have - epic, christian themed music, great for crusades. \n*Lord of the Rings - words can't express the grandeur of this masterpiece, totally epic\n*2 epic tracks from Chronicles of Narnia. \n*Stronghold+crusader music - who can forget such a cute medieval game and immense music?\n*MTW Vikings Invasion tracks make me all berserk inside\n*MTW XL has nice 3 tracks\n*some tracks from RTW EB\n*corvus corax medieval band music - very immersive\n*music from Knights of Honor game - very nice and fit perfectly for medieval period\n*couple of themes from Crusader Kings\n*music from upcoming MMP game &quot;Age of Conan&quot;\n*2 best tracks from &quot;300&quot; - that rocks so hard\n*more stronghold1+crusader+lotr+braveheart tracks \n*+ other medieval music I've found on net\n*new 1.2 has even more tracks adding Kingdoms ost and more from movies and games that provide medieval atmosphere.\n______________________________________________________________________\n\nHave great medieval music experience!\nDon't forget to give me feedback and maybe rep :) at TWC!\n\nSee you on the total war battlefields!\n\nGrand Duke Vytautas @TWC\n\n******************************************************************\n\nKladdey, a  guarantee of awesome torrents !","torrent":{"xt":"urn:btih:3acf6537d8077afa05710239bef6fbd506573449","amp;dn":"4winds+music+mod+for+Medieval+2+Total+War","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3acf6537d8077afa05710239bef6fbd506573449","infoHashBuffer":{"type":"Buffer","data":[58,207,101,55,216,7,122,250,5,113,2,57,190,246,251,213,6,87,52,73]},"announce":[],"urlList":[]}}