{"title":"El diluvio. En busca de la Atlantida.(Docu).(Spanish).","uid":5226847,"size":728952832,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3c7bb510aa2748c2987f714523d15ac541cc7f51&amp;dn=El+diluvio.+En+busca+de+la+Atlantida.%28Docu%29.%28Spanish%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"cholo24","files":1,"time":1261160233,"description":"El diluvio. En busca de la Atlantida\n\nÃ‚Â¿Sabemos de donde nace la civilizacion?\n\nÃ‚Â¿Fue el diluvio biblico un mito o realidad?\n\nÃ‚Â¿Porque cientos de culturas del mundo antiguo sin relacion ni contacto entre si , tienen versiones practicamente iguales del Diluvio universal, del Arca de Noe y de una una unica familia de supervivientes que acabo repoblando el mundo con su fauna y flora?\n\nÃ‚Â¿Porque tienen un gran porcentaje de momias egipcias grandes cantidades de cocaina y tabaco en sus restos si se supone que estas plantas son originarias de America y los Egipcios nunca estuvieron alli?\n\nÃ‚Â¿Porque los geologos aseguran que hay evidencias CONCLUSIVAS de que la esfinge es por lo menos el doble de antigua de lo que los egiptologos dicen y que por tanto no pudo ser contruida por los egipcios?\n\nÃ‚Â¿Quien la construyo? \n\nÃ‚Â¿Y las piramides de Giza?\n\nÃ‚Â¿Porque en todas las culturas del mundo antiguo hay tantas similitudes en escritura, contruccion, piramides, tecnologia y conocimiento en general cuando se supone que jamas estuvieron en contacto?\n\nÃ‚Â¿Acaso existio una civilizacion anterior a todo lo conocido, increiblemente sofisticada (mas que la nuestra) que es fue madre de todas las culturas del mundo antiguo?\n\nSi es asi, como las evidencias parecen sostener, Ã‚Â¿que sucedio con ella? Ã‚Â¿Fue acaso exterminada de la faz de la tierra por un cataclismo de escala global que estuvo a punto de acabar con la raza humana?\n\nTodo esto y mucho mas en es EXTRAORDINARIO documental, narrado por las mentes mas brillantes en lo cientifico de la historia alternativa, como Graham Hancock, John Anthony West, Robert Bauval, Colin Wilson etc...\n\nSegun mi opinion uno de los documentales mas descorcentantes de la historia.\n","torrent":{"xt":"urn:btih:3c7bb510aa2748c2987f714523d15ac541cc7f51","amp;dn":"El+diluvio.+En+busca+de+la+Atlantida.%28Docu%29.%28Spanish%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c7bb510aa2748c2987f714523d15ac541cc7f51","infoHashBuffer":{"type":"Buffer","data":[60,123,181,16,170,39,72,194,152,127,113,69,35,209,90,197,65,204,127,81]},"announce":[],"urlList":[]}}