{"title":"Brute Force (Burt Lancaster) [1947] @ .avi","uid":5263687,"size":490818654,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3d121f59300dcaee87db535109fc0ef028bacf2d&amp;dn=Brute+Force+%28Burt+Lancaster%29+%5B1947%5D+%40+.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"alien99","files":1,"time":1262817525,"description":"\n\nUser Rating:   7.8/10\n\nGenre:   Crime | Drama | Film-Noir | Thriller\n\nRelease Date:   30 June 1947 (USA) \n\nIMDB Tag:   tt0039224\n\n\n\tBurt Lancaster\t... \tJoe Collins\n\tHume Cronyn\t... \tCapt. Munsey\n\tCharles Bickford\tGallagher\n\tYvonne De Carlo\t... \tGina Ferrara\n\tAnn Blyth\t...     Ruth\n\tElla Raines\t... \tCora Lister\n\n\nIn the Westgate Penitentiary, the Warden A. J. Barden (Roman Bohnen) is a weak man, and the institution is actually ruled by the ambitious and sadistic Captain Munsey (Hume Cronyon), who uses violence, fear and treachery to control the prisoners. After the suicide of Tom Lister (Whit Bissell), one of the inmates of cell R17, provoked by Captain Munsey, the prisoners loses their privileges and rest of the group of cell R-17 leaded by Joe Collins (Burt Lancaster) is sent to hard and insalubrious work in the drain pipe. Joe uses a successful strategy of war trying to escape, attacking the tower of the penitentiary from the outside with his men, and from inside with the team leaded by the leader Gallagher (Charles Bickford). However, the plan fails, ending in a bloodshed.\n\nSixty years after the original release date, &quot;Brute Force&quot; is still a great movie of prison. The story is very well constructed, with flashbacks showing the connection of three inmates with his women. The violence is not explicitly disclosed like in the present days, but the cruelty of Captain Munsey can be understood even by the most naive viewer. The direction of Jules Dassin is outstanding with many memorable scenes. Yvonne De Carlo has a minor participation, but a strong role. The moralist message in the end, when Dr. Walters (Alt Smith) tells that nobody can escape from penitentiaries, does not spoil this great movie. My vote is eight.\n\n\n\n","torrent":{"xt":"urn:btih:3d121f59300dcaee87db535109fc0ef028bacf2d","amp;dn":"Brute+Force+%28Burt+Lancaster%29+%5B1947%5D+%40+.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d121f59300dcaee87db535109fc0ef028bacf2d","infoHashBuffer":{"type":"Buffer","data":[61,18,31,89,48,13,202,238,135,219,83,81,9,252,14,240,40,186,207,45]},"announce":[],"urlList":[]}}