{"title":"The Pussycat Dolls - When I Grow Up  (2nafish)","uid":5398884,"size":205199364,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:3df79e4ddf3aecce5859455eba02a77dc74c13d8&amp;dn=The+Pussycat+Dolls+-+When+I+Grow+Up++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1267348581,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no extra logos or titles.\n\n\n&quot;When I Grow Up&quot; is a dance-pop song written by American songwriters Rodney Jerkins, Theron Thomas and Timothy Thomas, and produced by Rodney &quot;Darkchild&quot; Jerkins for the Pussycat Dolls' sophomore studio album Doll Domination. Released as the album's lead single on May 27, 2008, the song has peaked at number nine on the Billboard Hot 100 chart, giving the group their fifth top ten single on the chart. The music video won the award for &quot;Best Dancing in a Video&quot; at the 2008 MTV Video Music Awards, and was nominated for an additional five awards, including &quot;Video of the Year&quot;. &quot;When I Grow Up&quot; was recently covered by Pop Punk band Mayday Parade, and is going to be released on Fearless Records's upcoming compilation album Punk Goes Pop 2. &quot;When I Grow Up&quot; is going to be one of the songs in Dance Dance Revolution 2009, as a small part of the video was shown in Konami 2009 Dance Dance Revolution presentation.\n\nIn an interview, the Pussycat Dolls stated that they would be shooting the music video for &quot;When I Grow Up&quot; after the MTV Movie Awards. The video was directed by Joseph Kahn. The shoot took place on June 3 and 4th, with exterior shots being filmed on Wilcox Avenue in Hollywood. Behind the scenes clips and an official preview became available on the Internet June 11. Britney Spears made a cameo appearance in the video, but according to MTV, her cameo was axed from the final version of the video. The music video uses an alternate version of the song which features vocals from all the Dolls, the third for a Pussycat Dolls single (&quot;Don't Cha&quot; was the first, &quot;Wait A Minute&quot; was the second), and has a dance break in the middle.\n\nThe music video premiered in the US on the new MTV video show FNMTV, which was hosted by Fall Out Boy bassist Pete Wentz, on June 13. The video premiered in other countries quite a long time after this, such as in the UK where it premiered on July 30 on Channel 4.\n\nIn the video the Dolls sit in a car in traffic, where Nicole flashes a ring that says 'famous'. They sing the introduction in the car before jumping out. When the chorus kicks in the girls leave the car and stand on the roofs of the other cars and start dancing a routine. The Dolls then walk down a street of HollyWood stars with bubbles floating all around them as they walk down the street and they stop to sing on a bench. James Rhine was featured here, standing at a restaurant, shirtless, checking out the girls as they walk by. When the next chorus starts, the Dolls climb scaffolding and begin to dance. During Scherzinger's solo, she stands in a small area with the Pussycat Dolls logo to the left and a mirror to the right, with lights flashing. The Dolls then dance in the breakdown section with the logo behind them, complete with Kimberly's signature move: standing oversplit, and the camera zooms out to reveal filming equipment and playback screens.\n\nThe video won for Best Dancing in a Video and was nominated for Best Video of the Year, Best Choreography in a Video, Best Art Direction in a Video, Best Direction in a Video, and Best Cinematography in a Video at the 2008 MTV Video Music Awards.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:3df79e4ddf3aecce5859455eba02a77dc74c13d8","amp;dn":"The+Pussycat+Dolls+-+When+I+Grow+Up++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3df79e4ddf3aecce5859455eba02a77dc74c13d8","infoHashBuffer":{"type":"Buffer","data":[61,247,158,77,223,58,236,206,88,89,69,94,186,2,167,125,199,76,19,216]},"announce":[],"urlList":[]}}