{"title":"[Ebook-Ita-Pdf-Horror]Stephen King - Shining[SoM]","uid":5321433,"size":4531674,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3ef2ee395bd2b7f17332dc1f3f8a79c815a13459&amp;dn=%5BEbook-Ita-Pdf-Horror%5DStephen+King+-+Shining%5BSoM%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"misafor","files":1,"time":1264872915,"description":"\n\nKing in quest'opera narra un'intrigante e allo stesso tempo spaventosa vicenda che ha come protagonista una famiglia americana; vicenda che nel corso del libro viene appunto animata da macabri episodi che portano i personaggi ad avere paura l'uno dell'altro.\nLa storia ÃƒÂ¨ ambientata nell'inverno del 1976-77. Jack Torrance, che ha perso il proprio lavoro d'insegnante dopo aver aggredito uno studente e cerca di portare a termine una commedia alla quale lavora da tempo, accetta un lavoro offertogli dall'amico Al Shockley: trasferirsi come guardiano invernale all'Overlook Hotel, un imponente albergo, costruito nel dopoguerra, che domina le alte montagne del Colorado. Jack accetta la proposta e porta con sÃƒÂ© la moglie Wendy e il figlio Danny di cinque anni. La famiglia spera di ritrovare nell'albergo un periodo di serenitÃƒÂ , correndo il rischio perÃƒÂ² di rimanere isolati da tutto il mondo esterno a causa della neve che li bloccherÃƒÂ  durante tutto l'inverno. Appena arrivati Jack ha un colloquio col direttore dell'albergo, Ullman, che lo informa che molti anni prima Delbert Grady, guardiano invernale di quell'anno, impazzÃƒÂ¬ e si uccise dopo aver fatto a pezzi la moglie e le figlie. Quello ÃƒÂ¨ stato solo uno dei tanti omicidi avvenuti nell'albergo.\nDurante il colloquio Danny conosce il cuoco Dick Hallorann con cui ha in comune dei poteri extra-sensoriali, la cosiddetta &quot;aura&quot; che gli permette di vedere fatti accaduti o che accadranno. Dick dice a Danny che se mai avrÃƒÂ  bisogno d'aiuto basterÃƒÂ  chiamarlo con la forza del pensiero e lui lo sentirÃƒÂ .\nCon il passare del tempo la famiglia si ritrova subito in un'atmosfera sinistra e Danny, grazie ai suoi poteri e all'aiuto dell'amico immaginario Tony, avverte il peso degli orribili avvenimenti passati che si materializzano davanti a lui, come il delitto della stanza 217, ma impara anche ad opporsi ad essi e a smascherare le false presenze.\nJack, che rovistando nel sotterraneo ha scoperto dei documenti compromettenti sulla storia dell'albergo, diviene prigioniero delle presenze del passato e non puÃƒÂ² sfuggire ad esse che lo controllano e lo portano all'irrefrenabile impeto di uccidere Wendy e Danny volendo prolungare cosÃƒÂ¬ la spirale di delitti e orrori.\nMadre e figlio capiscono che Jack non ÃƒÂ¨ piÃƒÂ¹ lo stesso e Wendy trova il coraggio di ferirlo, ma ciÃƒÂ² non lo ferma e cosÃƒÂ¬ Danny in preda al panico chiama Dick che accorre con un gatto delle nevi e mette in salvo la famiglia lasciando Jack nell'albergo che dopo poco va a fuoco a causa dell'esplosione della caldaia, la cui pressione non veniva scaricata ormai da troppi giorni.\n","torrent":{"xt":"urn:btih:3ef2ee395bd2b7f17332dc1f3f8a79c815a13459","amp;dn":"%5BEbook-Ita-Pdf-Horror%5DStephen+King+-+Shining%5BSoM%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ef2ee395bd2b7f17332dc1f3f8a79c815a13459","infoHashBuffer":{"type":"Buffer","data":[62,242,238,57,91,210,183,241,115,50,220,31,63,138,121,200,21,161,52,89]},"announce":[],"urlList":[]}}