{"title":"STILL GAME-SERIES TWO-EPISODES 1-5 IN XVID BY WINKER@KIDZCORNER","uid":5379737,"size":2192203080,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3f04684ecf0a073c343f6f828e5c05060378b827&amp;dn=STILL+GAME-SERIES+TWO-EPISODES+1-5+IN+XVID+BY+WINKER%40KIDZCORNER&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"alanwatson","files":-1,"time":1266693260,"description":"IF NO ONE SEEDS THESE BACK I WILL NOT UPLOAD THE REST OF THE COLLECTION PEEPS ITS SIMPLE\n\n4 DAYS I HAD TO RE SEED THE FIRST 2 :\n\nBE KEWL AND RE SEED\n\n\n\nGairden - The residents of Craiglang are being terrorised by the local neds, but the pensioners have had enough and decide to make their own haven they can escape to. Meanwhile Jack and Victor check on old Ronnie who has been recently committed to the sanatorium after being found dancing in George Square in his underwear.\n\n* English Translation- Garden\n\n\n\nWummin' - Jack and Victor are concerned for old friend Bert Findley who is deeply depressed following the death of his wife. Winston is having his own troubles with a less than sympathetic home help.\n\n* English Translation- Women\n\n\n\n\nDoacters - Jack and Victor are amazed at the dynamic vitality of their friend Stuart who has a found a zest for life after being prescribed a new &quot;yankee&quot; wonder drug and they plan a strategy to obtain a supply for themselves. Meanwhile, both Tam and Winston try to impress the new librarian, Frances.\n\n* English Translation- Doctors\n\n\n\n\nBrief - Victor buys a new car hoping it will give him the freedom he always wanted, but it ends up that he is the one being taken for a ride. Meanwhile, Winston tries his hardest to encourage Tam not to be tight-fisted.\n\n* English Translation- Local slang for car\n\n\n\n\nTappin' - A money lender appears in Craiglang and soon finds customers. Isa thinks Jack and Victor have borrowed money when she notices they have more than usual, in fact they are spending some extra money they had saved. Tam and Winston are enjoying a round of golf at Craiglang golf course until they are interrupted by the neds.\n\n* English Translation- Tapping (borrowing money)","torrent":{"xt":"urn:btih:3f04684ecf0a073c343f6f828e5c05060378b827","amp;dn":"STILL+GAME-SERIES+TWO-EPISODES+1-5+IN+XVID+BY+WINKER%40KIDZCORNER","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f04684ecf0a073c343f6f828e5c05060378b827","infoHashBuffer":{"type":"Buffer","data":[63,4,104,78,207,10,7,60,52,63,111,130,142,92,5,6,3,120,184,39]},"announce":[],"urlList":[]}}