{"title":"Climate.Summit.Junket.-.CBS.News.Video.WebRip.XviD-BiLDeRBeRG","uid":5275425,"size":25893983,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3f4d3e71feeb633a6c25624acfc43a0e98df052e&amp;dn=Climate.Summit.Junket.-.CBS.News.Video.WebRip.XviD-BiLDeRBeRG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"k3nd00d","files":2,"time":1263361746,"description":"Video: Xvid 512x384 29.97fps 961Kbps\nAudio: MPEG Audio Layer 3 44100Hz mono 128Kbps\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n &lt;a href=&quot;\nhttp://www.cbsnews.com/stories/2010/01/11/cbsnews_investigates/main6084364.shtml&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.cbsnews.com/stories/2010/01/11/cbsnews_investigates/main6084364.shtml&lt;/a&gt;\n\n\n\n\nWASHINGTON, Jan. 11, 2010\n\nCopenhagen Summit Turned Junket?\n\nExclusive: At Least 20 Members of Congress Made the Trip to Climate Change Conference in Copenhagen Last Month\n\nBy Sharyl Attkisson\n\n\n(CBS)  Few would argue with the U.S. having a presence at the Copenhagen Climate Summit. But wait until you hear what we found about how many in Congress got all-expense paid trips to Denmark on your dime. \n\nCBS investigative correspondent Sharyl Attkisson reports that cameras spotted House Speaker Nancy Pelosi at the summit. She called the shots on who got to go. House Majority Leader Steny Hoyer, and embattled Chairman of the Tax Committee Charles Rangel were also there. \n\nThey were joined by 17 colleagues: Democrats: Waxman, Miller, Markey, Gordon, Levin, Blumenauer, DeGette, Inslee, Ryan, Butterfield, Cleaver, Giffords, and Republicans: Barton, Upton, Moore Capito, Sullivan, Blackburn and Sensenbrenner. \n\nThat's not the half of it. But finding out more was a bit like trying to get the keys to Ft. Knox. Many referred us to Speaker Pelosi who wouldn't agree to an interview. Her office said it &quot;will comply with disclosure requirements&quot; but wouldn't give us cost estimates or even tell us where they all stayed. \n\nSenator Inhofe (R-OK) is one of the few who provided us any detail. He attended the summit on his own for just a few hours, to give an &quot;opposing view.&quot; \n\n&quot;They're going because it's the biggest party of the year,&quot; Sen. Inhofe said. &quot;The worst thing that happened there is they ran out of caviar.&quot; \n\nOur investigation found that the congressional delegation was so large, it needed three military jets: two 737's and a Gulfstream Five -- up to 64 passengers -- traveling in luxurious comfort. \n\nAdd senators and staff, most of whom flew commercial, and we counted at least 101 Congress-related attendees. All for a summit that failed to deliver a global climate deal. \n\nAs a perk, some took spouses, since they could snag an open seat on a military jet or share a room at no extra cost to taxpayers. Rep. Gabrielle Giffords (D-AZ) was there with her husband. Rep. Shelley Moore Capito (R-WV) was also there with her husband. Rep. Ed Markey (D-MA) took his wife, as did Rep. Jim Sensenbrenner (R-WI). Congressman Barton -- a climate change skeptic -- even brought along his daughter. \n\nUntil required filings are made in the coming weeks, we can only figure bits and pieces of the cost to you. \n\n + Three military jets at $9,900 per hour - $168,000 just in flight time. \n + Dozens flew commercial at up to $2,000 each. \n + 321 hotel nights booked - the bulk at Copenhagen's five-star Marriott. \n + Meals add tens of thousands more. \n\nSteve Ellis of Taxpayers for Common Sense, wasn't against a U.S. presence. But he said, &quot;Every penny counts. Congress should be shaking the couch cushions looking for change, rather than spending cash for everybody to go to Copenhagen.&quot; \n\nNobody we asked would defend the super-sized Congressional presence on camera. One Democrat said it showed the world the U.S. is serious about climate change. \n\nAnd all those attendees who went to the summit rather than hooking up by teleconference? They produced enough climate-stunting carbon dioxide to fill 10,000 Olympic swimming pools. \n\nWhich means even if Congress didn't get a global agreement - they left an indelible footprint all the same.\n\n","torrent":{"xt":"urn:btih:3f4d3e71feeb633a6c25624acfc43a0e98df052e","amp;dn":"Climate.Summit.Junket.-.CBS.News.Video.WebRip.XviD-BiLDeRBeRG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f4d3e71feeb633a6c25624acfc43a0e98df052e","infoHashBuffer":{"type":"Buffer","data":[63,77,62,113,254,235,99,58,108,37,98,74,207,196,58,14,152,223,5,46]},"announce":[],"urlList":[]}}