{"title":"Need For Speed II Iso this time with the correct Glide Wrapper","uid":5367000,"size":573221105,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4010896c031fd2a924e4d48624eb6eafc3ebdf48&amp;dn=Need+For+Speed+II+Iso+this+time+with+the+correct+Glide+Wrapper&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Da5t3r","files":-1,"time":1266294369,"description":"Need For Speed 2 SE iso plus glide wrapper\n\n(The Glide Wrapper included is the Zechensack wrapper that I have found to be the most complete glide wrapper which also supports a wide range of other glide games) \n\nUsing the Glide Wrapper to run this game you're basically running a emulator with the wrapper emulating the glide instruction set for the game and making the translation to D3d for the graphics hardware to understand. So basically the faster your system the better this will run.\n\nWith NeedForSpeedIISE to run the game in 3DFX mode you need to locate the NFS2SEA.exe on the CD and copy it to the games main directory this is after you have finished installing the game and then use this to run the game. Using the games default exe in the start menu or desktop icon will run the game without 3d acceleration. Also if you are running this game on anything other than a 3DFX graphics card you will need the Glide Wrapper to run the game in 3D accelerated mode. \n \nIn XP/Vista run NFS2SEA.exe in 95 or 98/ME compatibility mode\nIn Vista also set NFS2SEA.exe to run as Administrator\nto access these options right click on the NFS2SEA.exe and select Properties then select Compatibility tab and tick/select options required...\n\n\nIf you'd like the game to run faster then you could try using the Compatibility Administrator, download the Microsoft Compatibility toolkit 5.0 from here....\n &lt;a href=&quot;\nhttp://www.microsoft.com/downloads/details.aspx?FamilyId=24DA89E9-B581-47B0-B45E-492DD6DA2971&amp;displaylang=en&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.microsoft.com/downloads/details.aspx?FamilyId=24DA89E9-B581-47B0-B45E-492DD6DA2971&amp;displaylang=en&lt;/a&gt;\n\nRun Compatibility Administrator from Start Menu.\nGo to Custom Database / New Database.\nClick 'Fix' button.\nType the name of the game, vendor, and browse to NFS2SEA.EXE file. If it is not in NFS2SE folder on your hard drive yet, then copy it manually from CD.\nClick Next, Select None, Next.\nToggle following positions on:\n\n- EmulateSlowCPU &lt;-Optional\n- CorrectFilePath\n- EmulateGetDiskFreeSpace &lt;-This fixes insufficent memory error\n- GlobalMemoryStatusLie &lt;-and so does this\n- SingleProcAffinity &lt;-This is the Multi processor fix\n\nClick Next, Finish.\nSave your database preferably in game directory.\nNow click on NFS2SEA.EXE file in the right panel of Compatibility Administrator. Click Run button. The game should start.\n\nIf you want to play the game again you'll need to run Compatibility Administrator again, load your database, click on NFS2SEA.EXE file and Run button. Also Running the game this way does seem to cause some sound corruption.. (I think this is more a issue with the games internal timings than anything) But you do get a faster frame rate than with 95 compatibility but sadly the game is also less stable.. and slightly prone to crashes..though I'd have thought EmulateSlowCPU fix would have fixed this...\n\n\nBut i have found Compatibility Administrator to be a bit of a fiddle and 95 &amp; 98/ME compatibility options quicker to use, plus they already have the games fixes incorporated, in the 95 compatibility the frame rate is slower but there isn't any sound corruption and the game doesn't crash, 98/ME compatibility has a faster frame rate but there is slight sound corruption but still doesn't crash..\n\nWhen you goto close the game it may throw a error up but this is to do with the way the wrapper handles the games window...","torrent":{"xt":"urn:btih:4010896c031fd2a924e4d48624eb6eafc3ebdf48","amp;dn":"Need+For+Speed+II+Iso+this+time+with+the+correct+Glide+Wrapper","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4010896c031fd2a924e4d48624eb6eafc3ebdf48","infoHashBuffer":{"type":"Buffer","data":[64,16,137,108,3,31,210,169,36,228,212,134,36,235,110,175,195,235,223,72]},"announce":[],"urlList":[]}}