{"title":"Everybody Hates Chris - (dublado - PT.BR) .avi","uid":5435860,"size":21264132096,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:40b4f904b67c2503ae746fe1e561099706cf97ec&amp;dn=Everybody+Hates+Chris+-+%28dublado+-+PT.BR%29+.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":5,"uploader":"Prathero","files":88,"time":1268760380,"description":"Everybody Hates Chris foi uma sitcom americana exibida entre Setembro de 2005 e Maio de 2009 pela emissora de televisÃƒÂ£o  The CW.\n\nO enredo da sÃƒÂ©rie foi baseado na infÃƒÂ¢ncia e adolescÃƒÂªncia de Chris Rock, comediante e ator americano, criador, produtor, narrador e ator da sÃƒÂ©rie.[1] E foi por esse motivo que a rede de TV americana decidiu cancelar a sÃƒÂ©rie em Maio de 2009, alegando sair do enredo inicial, justamente porque a nova temporada seria focada no inÃƒÂ­cio da carreira humorÃƒÂ­stica de Chris, e na morte de seu pai, Julius, em 1988.\n\nSeu tÃƒÂ­tulo ÃƒÂ© uma referÃƒÂªncia ao tÃƒÂ­tulo de outra sÃƒÂ©rie de sucesso que acabou no ano em que esta estreou, Everybody Loves Raymond.\n\nEm Portugal ÃƒÂ© transmitida pelo RTP 2 com o tÃƒÂ­tulo Todos contra o Chris; no Brasil, pela Rede Record, com o tÃƒÂ­tulo Todo mundo odeia o Chris e pelo canal de televisÃƒÂ£o a cabo Sony Entertainment Television, onde ÃƒÂ© exibido legendado e com o tÃƒÂ­tulo original em inglÃƒÂªs.\n\nChris Rock, cÃƒÂ©lebre ator e comediante da televisÃƒÂ£o, narra histÃƒÂ³rias dele e sua famÃƒÂ­lia , vivÃƒÂªncias engraÃƒÂ§adas e desventuras de sua adolescÃƒÂªncia durante a dÃƒÂ©cada de 1980, a comeÃƒÂ§ar pela luta que teve de travar para encontrar seu espaÃƒÂ§o num colÃƒÂ©gio frequentado por brancos, a duas horas de sua casa. Como o mais velho de trÃƒÂªs irmÃƒÂ£os no bairro de Bed-Stuy, no distrito do Brooklyn, na cidade de Nova York, tambÃƒÂ©m precisou manter os mais novos na linha e superar os testes de sua escola , quanto ao preconceito e as dificuldades da ÃƒÂ©poca.\n\nEm 1982 Chris completa 13 anos e, ao entrar na adolescÃƒÂªncia, descobre que ela nÃƒÂ£o era o que esperava. Em meio ÃƒÂ  responsabilidade de ter de cuidar dos irmÃƒÂ£os mais novos, Drew (baseado no seu irmÃƒÂ£o Andrew Rock) e Tonya, enquanto seus pais trabalham, Chris amadurece rapidamente e percebe que jÃƒÂ¡ faz parte do universo adulto, mesmo sem ter idade para isso.","torrent":{"xt":"urn:btih:40b4f904b67c2503ae746fe1e561099706cf97ec","amp;dn":"Everybody+Hates+Chris+-+%28dublado+-+PT.BR%29+.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40b4f904b67c2503ae746fe1e561099706cf97ec","infoHashBuffer":{"type":"Buffer","data":[64,180,249,4,182,124,37,3,174,116,111,225,229,97,9,151,6,207,151,236]},"announce":[],"urlList":[]}}