{"title":"Denis Leary - Merry F#%$in' Christmas  (2nafish)","uid":5199604,"size":60119044,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:40d43a987d85f887fdb7c6d0404740083d6b4d18&amp;dn=Denis+Leary+-+Merry+F%23%25%24in%5C%27+Christmas++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1260095636,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nSome lyrics in this video are censored.\n\n\nMerry F#%$in' Christmas is a 2004 comedy album released by actor/comedian Denis Leary. It runs for 20 minutes and includes unreleased sessions recorded for his previous 1997 album Lock 'n Load and two tracks previously released on that album (&quot;Deaf Mute Cocktail Party&quot; and &quot;Insane Cowboy (In Africa)&quot;).\n\nSince the holiday season of 2005, Comedy Central has periodically aired Denis Leary's Merry F#%$in' Christmas, an hour-long (with commercials) Christmas special featuring Leary and several celebrity guests, including Charlie Murphy, Carmen Electra, William Shatner, and the Barenaked Ladies. The song &quot;Merry F#%$in' Christmas&quot; is the title theme of the special, set to a parody of Rankin/Bass' signature &quot;Animagic&quot; stop-motion animation; no other tracks from the album appear in the special (though the cast performs a new live version of the title theme).\n\nDenis Colin Leary (born August 18, 1957) is an American actor, comedian, writer, and director. He is known for his often biting comedic style and his chain smoking. Leary is the star and co-creator of the television show Rescue Me now in its fifth season.\n\nLeary started his career as a comedian in the Boston comedy scene of the 1980s, where he hosted his own show at the underground club &quot;Play It Again Sam's&quot;. He also wrote and appeared on a local comedy series, Lenny Clarke's Late Show, hosted by his friend Lenny Clarke and written by Boston comedy writer Martin Olson. Leary and Clarke both spoke about their early affiliations and influences in the Boston comedy scene in the documentary film When Standup Stood Out (2006). It was during this time that he developed his stage persona. He also appeared in skits on the MTV game show Remote Control, playing such characters as Keith Richards of the Rolling Stones, the &quot;brother&quot; of co-host Colin Quinn, and artist Andy Warhol.\n\nLeary first earned fame when he ranted about R.E.M. in an MTV sketch. Several other commercials for MTV followed, in which Leary would rant at high speeds about a variety of topics. He has released two records of his stand-up comedy: No Cure for Cancer (1993) and Lock 'n Load (1997). In late 2004, he released the EP Merry F#%$in' Christmas, which included a mix of new music, previously unreleased recordings, and some tracks from Lock 'n Load.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:40d43a987d85f887fdb7c6d0404740083d6b4d18","amp;dn":"Denis+Leary+-+Merry+F%23%25%24in%5C%27+Christmas++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40d43a987d85f887fdb7c6d0404740083d6b4d18","infoHashBuffer":{"type":"Buffer","data":[64,212,58,152,125,133,248,135,253,183,198,208,64,71,64,8,61,107,77,24]},"announce":[],"urlList":[]}}