{"title":"LeToya - Regret  (2nafish)","uid":5337219,"size":143147012,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:41a263e68dec445ca474710c471681176462b703&amp;dn=LeToya+-+Regret++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1265360381,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Regret&quot; is the third single from LeToya Luckett's sophomore solo album, Lady Love (2009). It features rapper Ludacris. So far it has peaked at #8 on U.S. Billboard's Hot R&amp;B/Hip-Hop Songs chart , her fourth top twenty hit on that chart and #78 on the Billboard's Hot 100 chart, becoming her second chart entry on the Hot 100, despite no music video having been released. The song has so far peaked at #42 on Billboard's Radio Songs chart. On October 15, 2009, LeToya herself and her official website LeToyaOnline.com confirmed that music video for &quot;Regret&quot; is going to be released. The song has become the most successful song from her second album without the accompanying video's release and the most successful of her career behind her debut single &quot;Torn&quot;.\n\nAn official remix has been recorded with new vocals, new lyrics, new beat and new verse from rapper Missy Elliott.\n\nThe music video premiered on 106 &amp; Park on November 11, 2009. It features Ludacris and Luckett, who notably wears the same jacket as Alicia Keys did in Keys' video for &quot;Try Sleeping with a Broken Heart&quot;. The video ranked at #23 on BET: Notarized: Top 100 Videos of 2009 countdown.\n\nOn the week ending October 17, 2009, &quot;Regret&quot; debuted on the Billboard Hot 100 at #100. The following week, it fell off the chart, but it re-entered at #96 the week after that and has since moved up to #78.\n\nLady Love is the second studio album by American R&amp;B recording artist LeToya originally scheduled for release several times in 2008. After corporate restructuring at Capitol Records the album was released on August 25, 2009 in the United States.\n\nOn the album Luckett has worked with a wide variety of collborators including Ne-Yo, Chris Brown and Bryan-Michael Cox. Featured guests include Ludacris, Estelle and Mims whilst some versions of the album will also have a bonus track which also features Bun B, Killa Kyleon, and Slim Thug.\n\nThe album's first single &quot;Not Anymore&quot; was released February 3, 2009 having been written by Ne-Yo and produced by Bei Maejor. In the US it reached number 7 on the Billboard Bubbling Under Hot 100 chart. It also peaked at #18 on the U.S. Billboard U.S. Billboard R&amp;B chart. &quot;She Ain't Got...&quot; was released as the second single on May 26, 2009 peaking at #49 on the Japan Hot 100, has so far peaked at #20 on the U.S. Billboard Hot Dance Club Play chart and has also started charting on the U.S. Billboard Rhythmic Top 40 and the U.S. Billboard Pop 100 Airplay charts. Regret was released as the third single. The song features rapper Ludacris and has so far peaked at #8 on the U.S. Billboard R&amp;B chart, #78 on Billboard's Hot 100 chart and at #42 on Billboard's Radio Songs chart (also known as the Billboard Hot 100 Airplay chart).\n\nAccording to Nielsen Sound Scan &quot;Lady Love&quot; debuted at #12 on the U.S. Billboard 200 Chart and at #1 on the U.S. Billboard R&amp;B/Hip-Hop Albums Chart.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:41a263e68dec445ca474710c471681176462b703","amp;dn":"LeToya+-+Regret++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41a263e68dec445ca474710c471681176462b703","infoHashBuffer":{"type":"Buffer","data":[65,162,99,230,141,236,68,92,164,116,113,12,71,22,129,23,100,98,183,3]},"announce":[],"urlList":[]}}