{"title":"Wrong.Side.Of.Town.2010.DVDRip.XviD-VoMiT","uid":5368995,"size":761121373,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:42e7c88ca36fefb852430dac11a18f1fd6308905&amp;dn=Wrong.Side.Of.Town.2010.DVDRip.XviD-VoMiT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"BDSMers","files":55,"time":1266360953,"description":"Ex-Navy Seal Bobby Kalinowski lives a quiet, peaceful\n\nlife as a landscape architect in an LA suburb with his\n\nwife Dawn and 16 year old daughter Brianna. Tonight they\n\nare invited out for an evening on the town by new\n\nneighbors clay and Elise Freeman to a happening club\n\ndowntown. Little did they know that this would be the\n\nstart of a life or death ordeal for the group. While at\n\nthe club, Dawn is accosted by one of the club owners\n\nEthan Bordas. When Bobby intervenes and accidentally\n\nkills Ethan defending his wife, his enraged older\n\nbrother, Seth, puts a one hundred thousand dollar bounty\n\non his head. Now Bobby must escape LA while being pursued\n\nby every criminal, wise guy and thug in the city. Bobby\n\ndecides to separate from his wife and neighbors and\n\nrevert to his Navy Seal training to survive. To\n\ncomplicate matters, Seth has a corrupt police sergeant\n\npreventing Bobby from getting any help from the law!\n\nHowever, they all underestimate the fighting skills and\n\nabilities of Bobby Kalinowski who battles through an army\n\nof thugs to finally make it back home. But, relentless\n\nSeth doesn't stop there. He targets Bobby's family next\n\nand kidnaps his daughter. His plan is successful and he\n\nlures Bobby to his seedy warehouse complex for the final\n\nshowdown\n\n\ndownloaded from TorrentDay","torrent":{"xt":"urn:btih:42e7c88ca36fefb852430dac11a18f1fd6308905","amp;dn":"Wrong.Side.Of.Town.2010.DVDRip.XviD-VoMiT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42e7c88ca36fefb852430dac11a18f1fd6308905","infoHashBuffer":{"type":"Buffer","data":[66,231,200,140,163,111,239,184,82,67,13,172,17,161,143,31,214,48,137,5]},"announce":[],"urlList":[]}}