{"title":"GoodSync v 8.1.1.5","uid":5265635,"size":9549180,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:443f1cd17493c8f6be1c504c60d095a95624e105&amp;dn=GoodSync+v+8.1.1.5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"powermat","files":1,"time":1262877252,"description":"GoodSync is an easy and reliable file backup and file synchronisation software. It automatically analyzes, synchronizes, and backs up your emails, precious family photos, contacts, MP3s, financial documents, and other important files locally - between desktops, laptops, servers, external drives, and Windows Mobile devices, as well as remotely through FTP, SFTP, WebDAV, and more.\n\nNEW: GoodSync for Mac OS X Alpha has been released.\n\nNever Lose Your Emails, Photos, MP3s, etc...\nGoodSync file synchronisation software combines bulletproof reliability with an extremely easy to use interface to compare, synchronise, and backup your emails, contacts, photos, MP3s, and other important files.\n\nAutomatically Sync or Back Up to Multiple Devices\nAutomatically synchronize and back up your important files between desktops, laptops, servers, and external drives over local network or the Internet. GoodSync file sync software is years ahead of the pack when it comes to file synchronisation because it uses an innovative synchronisation algorithm.\n\nEasy and Automated\nKeep your files backed up and up-to-date with one click and most importantly begin enjoying your peace of mind, knowing that you'll always have multiple copies of your files available. File synchronisation and backup could not be easier.ware.\n\nEnjoy","torrent":{"xt":"urn:btih:443f1cd17493c8f6be1c504c60d095a95624e105","amp;dn":"GoodSync+v+8.1.1.5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"443f1cd17493c8f6be1c504c60d095a95624e105","infoHashBuffer":{"type":"Buffer","data":[68,63,28,209,116,147,200,246,190,28,80,76,96,208,149,169,86,36,225,5]},"announce":[],"urlList":[]}}