{"title":"DJ MENTZIK - MIXAMIX_2009","uid":5423852,"size":141467365,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:446fcbc64fe56b2fa53af33e174739b20075c19d&amp;dn=DJ+MENTZIK+-+MIXAMIX_2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mentzik","files":31,"time":1268175180,"description":"A few words about MIXAMIX 2009\n\nDear music and trip lovers. \n\n2009 was a very busy year with lack of free time,attractive new sounds from the electronic music scene and finally less inspiration.Unfortunately, last year's great summer forest fires destroyed many of the places I used to drive around refreshing my mind and energy,draining my party mood.\n\nThis mix started on January of 2009 and finished on December of the same year so it took me quite long to finish.\nSo due to the lack of inspiring new music I had to turn a bit back into time but with a fresh view. \n\nSo new a version of Children is hugging the Armnin's In and Out of love, just to prove that Armin is so inspired by this all time classic. Apoptygma Berzerk takes us to the more Progressive trance part of the mix which peaks with Astral Projection's - Mahadeva! Trying then to be a bit more oldshool I use breakbeat sounds toI get upto Art of Noise's - Instrument of Darkness. A track I first heard in a PC demo in my early computer days back in the 90s.\n\nIIO - Rapture is a track I have used before in my mixes but I felt it would fit in here too. DJ shadow keeps the beat up and takes as to Infinity. The track that returned from the 80s to conquer 2009! And what is best than its company the Kraftwerk version of Popcorn.\nFrom then on, I try to be a bit in the mainstream side. I 've used songs that my gf likes (Akcent - Thats My Name). Since on the mainstream side I wanted so much to use Sakis Rouvas - This is our night. Last year's Eurovision greek song. Still waiting for a better mix for that. It has so much potential. \n\nI know this mix does not have the consistency of my previous ones, but consider it a seasonal mix and if you hear closely enough you will understand\nthe time marks! As always I the songs are mixed in a way that I can create something new out of them! I hope you will enjoy this mix riding you wild horses as much as I do! \n\nSince the beginning of this year I am gathering much more interesting tracks and I hope I will be able to release I new MixAMix soon!\n\nKeep traveling, sharing music and have fun!\n\n\t\n\t\n27 tracks in playlist, average track length: 2:51\nPlaylist length: 1 hour 17 minutes 8 seconds \n\nPlaylist files:\n\n1. Martin Roth &amp; Alex Bartlett - Off The World (MRs Exclusive Intro Mix) (1:28)\n2. Dave Darell - Children (Ron Van Den Beuken Remix) (3:52)\n3. Armin van Buuren feat. Sharon den Adel - In And Out Of Love ( Chill &amp; Breaks) (3:36)\n4. Tatana Vs. Tyas Presents T and T - Children 2007 (4:20)\n5. Apoptygma Berzerk - Tuning in again (0:56)\n6. Johann Bley - Great Eastern (3:07)\n7. ASTRAL PROJECTION - MAHADEVA 99 (3:42)\n8. Crazy Malamute - Free To Ride (Resistance D. Mix) (2:53)\n9. Soda Inc - Cross the Ocean (2:45)\n10. Azzido Da Bass - Dooms Night (Lexy &amp; K-Paul Remix) (3:00)\n11. Art Of Noise - Instruments Of Darkness (1:17)\n12. Vaiio - Rapture (Deep Dish Remix) (3:14)\n13. DJ Shadow - GDMFSOB (UNKLE Uncensored) feat. Roots Manuva (3:28)\n14. Guru Josh Project - Infinity 2008 (Calvertron Remix) (2:54)\n15. Guru Josh Project - Infinity 2009 (2:20)\n16. Kraftwerk - POPCORN (3:32)\n17. Bump - Im Rushing (Dave Spoon Remix) (1:29)\n18. Timo Maas - First Day (1:48)\n19. Amy Winehouse - Back to Black (3:13)\n20. David Guetta - GRRRR (2:02)\n21. Timbaland feat. OneRepublic - Apologize (Inspired By Daft Punk Mix) (3:34)\n22. Lifelike - High On (3:02)\n23. Sakis Rouvas - This is our night (2:45)\n24. Akcent - Thats My Name (original mix) (2:24)\n25. Utah Saints - Something Good 08 (E-Squire Remix) (2:46)\n26. Elenh Tsaligopoulou - To Feggari Kanei Bolta (4:04)\n27. Dublex Inc - Tango Forte (3:37)\n\nHave a nice time and lovely journeys! \nDj Mentzik (http://www.musicalgalaxy.com)","torrent":{"xt":"urn:btih:446fcbc64fe56b2fa53af33e174739b20075c19d","amp;dn":"DJ+MENTZIK+-+MIXAMIX_2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"446fcbc64fe56b2fa53af33e174739b20075c19d","infoHashBuffer":{"type":"Buffer","data":[68,111,203,198,79,229,107,47,165,58,243,62,23,71,57,178,0,117,193,157]},"announce":[],"urlList":[]}}