{"title":"XYplorer v8.80.0000","uid":5244347,"size":2245545,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:44d483cc2739995c94eac5cb4411abc04b492a27&amp;dn=XYplorer+v8.80.0000&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"limit6","files":5,"time":1261929205,"description":"XYplorer is an Advanced File System Explorer targeting everybody who is looking for a real alternative to the Windows Explorer. It has the following features: Created Date, Last Accessed Date and Attributes are shown right in the file list. Extended file find supporting NT-only features, and including binary string search. Multiple location search (find files in all selected directories). Generates various sorts of file system reports (to clipboard, file, and printer -- were talking about one-click directory print-outs here). Export extended file informations of whole directories (or even directory trees) to CSV-formatted files. [new in 3.21] Column Width Auto-Adjustment. Highly customizable display formats for file size and date information. For each file and folder, the (real!) disk space used is immediately displayed. Remembers last folder location and sort order. Browser-like history functionality. Can define favorite folders.\n\nOther Features:\n Thumbnails of image files can be shown right in the details view\n Preview of TGA (Targa), DNG, and NEF files\n Instant Font Preview of installed and uninstalled TrueType and Type-1 font files\n Instant Preview of Office files, and of HTML, MHT, PHP files with printing option\n Instant display of complete file/version Information for each selected file\n Support of Icon Overlays\n File Info Tips and MP3 Info Tips\n Instant ID3v1.1-tag view and edit, plus automatic filename to ID3v1.1-tag routine\n Instant Raw View (ASCII and HEX) for all files, including text extraction from binaries\n Generate various sorts of file system Reports\n Export extended file information of whole directories to CSV-formatted files\n On-the-fly Font Sizing\n Excellent Windows shell integration\n Highly customizable display formats for file size and date information\n Support for showing directory sizes\n Optionally, for each file and folder, the real disk space used is immediately displayed\n Start Where You Stopped\n Can define favorite folders and files\n Icon-extraction, multi-file time-stamping and attribute-stamping\n Full support for drag-n-drop and wheel mouse\n Made to handle heavy-duty jobs\n Small, fast, and RAM-friendly\n","torrent":{"xt":"urn:btih:44d483cc2739995c94eac5cb4411abc04b492a27","amp;dn":"XYplorer+v8.80.0000","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44d483cc2739995c94eac5cb4411abc04b492a27","infoHashBuffer":{"type":"Buffer","data":[68,212,131,204,39,57,153,92,148,234,197,203,68,17,171,192,75,73,42,39]},"announce":[],"urlList":[]}}