{"title":"Trebuchet - The bear and the Moon (2009) MP3 192kbps","uid":5353448,"size":162490877,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4592398bd97fbfab1298e3f0f80a8d29cafb14c6&amp;dn=Trebuchet+-+The+bear+and+the+Moon+%282009%29+MP3+192kbps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"menlatin","files":26,"time":1265857735,"description":"About the Band\n\nThis epic, double-disc album is a culmination of 4 years worth of writing, composing, and playing; as well as a year and a half's worth of recording, mixing, frustration and waiting. Done in the band's own studio, &quot;Bear and the Moon&quot; is the epitome of DIY ambition, and symbolizes a &quot;suggestion&quot; of a new path for not only rock music, but the &quot;sound&quot; of rock music and the way one might &quot;receive&quot; it. \n\nTrebuchet has decided to distribute their album via Bit Torrent FREE OF CHARGE. Send it to your friends, burn it and redistribute it to your hearts content.  \n\nIf you like the sounds, you can purchase individual songs or the full album from :\n &lt;a href=&quot;\nhttp://www.cdbaby.com/cd/trebuchet&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.cdbaby.com/cd/trebuchet&lt;/a&gt;\n\nYou can follow the band on myspace, twitter and facebook \n &lt;a href=&quot;\nhttp://twitter.com/TrebucheTBand&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://twitter.com/TrebucheTBand&lt;/a&gt;\n\nFor Booking inquiries,  Aaron Eubanks -\n\n\n# Bobby Lotfipour:  drums, percussion\n# Dustin Fleming: guitar, vocals\n# John Yett: bass, vocals\n# Justin Hawkins: guitar, lead vocals\n# Keith Naylor: guitar, vocals\n\n\nInfluences\n\nPink Floyd, Led Zeppelin, Tool, The Mars Volta, Deftones, Failure, Year of the Rabbit, The Earl Harvin Trio, Charlie Parker, Pantera, Atmosphere, Yes, Toadies, Van Halen, Beatles, Santana, Wilco, Miles Davis, Jack Wilkens, Bird, Johnny Cash, Hank Williams SR, Hank Williams Jr, Hate Breed, Metallica, Seven Dust, Bjork, ZZ Top, Alice N Chains, Stone Temple Pilots, At The Drive In, Jimmy Eat World, The Who\n\n\nReviews\n\nThey have been called everything from prog-metal to post modern rock and roll, and this five-piece band from Denton loves every bit of it. The truth is that Trebuchet defies most standard classifications so don't try to squeeze them into a single type or genre, rather just listen to their debut album The Bear and The Moon and enjoy the tour of hard rock music that the band takes you on. It expands through two disks and nearly two hours and by the time it is over you will realize that Trebuchet is quite different from most other acts is DFW. Detectable is the band's eclectic taste in influences, which is put on display throughout the entire album. One major influence for this group has been the world immediately surrounding them in Denton.\n\nPerhaps only in Denton can you find a metal band that is this hard rocking, that has this amount of Jazz influence incorporated into its sound. But an even more literal influence from the town can be heard on the second disk of the album, which should take no time at all to recognize if you have ever seen a show at Rubber Gloves before.\n\nTrebuchet has created a reputation for themselves through incredible show after incredible live show, as one of the most entertaining groups in the area. And that is saying a lot in this town. But Trebuchet is not like most of the other artists in Denton. They have a sound that is unique to them alone and have staked out a corner of the local music scene and are keeping it for themselves. And as more time passes, and the hard work of the group starts to pay off, more and more people will be visiting that corner in the very near future.\n\nEven the skeptics and traditionalists who may think that a metal-ish band can only thrive down in Dallas will take a second thought after hearing the many sided sound of Trebuchet. The more exposure this band gets, the sooner that fact will become more evident.\n\nLook for Trebuchet to be playing shows all over the metroplex in the coming weeks and months before they get back into the studio to record their sophomore album, which they hope will be out by the end of 2009.\n\nto follow the band on My Denton Music:\n\nwww.mydentonmusic.com/userinfo.php?user=trebuchet\n\nby MDM Writer Josh Hogan\n\n\nCheck out their video interview with Sarah Chrisman from The Chrisman Show\n &lt;a href=&quot;\nhttp://www.pegasusnews.com/news/2009/aug/24/video-trebuchet-sarah-crisman-show-my-denton-music/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.pegasusnews.com/news/2009/aug/24/video-trebuchet-sarah-crisman-show-my-denton-music/&lt;/a&gt;\n\n\n\nTrebuchet \nThe Bear and the Moon (2009)\n192 kbps\n\nDisk 1 \t\t\n\nBlack Beard\t\t\t\t04:34\nThe Powers of Speech\t\t\t03:32\nWhite Noise \t\t\t\t01:00\nCanis Feminina\t\t\t\t08:49\nIntelligent Design\t\t\t06:07\nSo Many Feet\t\t\t\t06:34\nShut This Thing off\t\t\t04:14\nLadies\t\t\t\t\t03:02\nAn Ominous Ode to the Hiils, Pt.1\t05:58\nEgo trip\t\t\t\t05:18\nSonic the Chairdog\t\t\t06:09\nMy Machines\t\t\t\t05:41\n\n\nDisk 2\n\nClocktower Blues\t\t\t00:30\nTrain\t\t\t\t\t03:26\nWaffles and Pancakes\t\t\t04:22\nCollision\t\t\t\t04:16\nSingle File\t\t\t\t04:50\nThe Instance of Play\t\t\t04:01\nObjects Unclean\t\t\t\t05:25\nLeft in E Flat\t\t\t\t02:30\nAn Ominous ode to the Hills, Pt2\t03:06\nN.P.C\t\t\t\t\t09:32\nThe Walking Dead\t\t\t09:35","torrent":{"xt":"urn:btih:4592398bd97fbfab1298e3f0f80a8d29cafb14c6","amp;dn":"Trebuchet+-+The+bear+and+the+Moon+%282009%29+MP3+192kbps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4592398bd97fbfab1298e3f0f80a8d29cafb14c6","infoHashBuffer":{"type":"Buffer","data":[69,146,57,139,217,127,191,171,18,152,227,240,248,10,141,41,202,251,20,198]},"announce":[],"urlList":[]}}