{"title":"Guitar Hero Aerosmith (NTSC/USA.PS2.ESR-Pre Patched)","uid":5201704,"size":4685070336,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:4627f181e3470308953b130862c71ef121107831&amp;dn=Guitar+Hero+Aerosmith+%28NTSC%2FUSA.PS2.ESR-Pre+Patched%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"CivicScootin","files":-1,"time":1260201795,"description":"Civic/Scootin Proudly Presents:\n\n\nGame: Guitar Hero Aerosmith\n\nSystem: PS2\n\nRegion-Country: NTSC-USA\n\nESR Patched: Yes\n\nDVD-5 Ready: Yes\n\nWorks via HDL: Yes\n\nDescription:\nOne of Activision's most successful franchises joins forces with one of rock's most enduring bands in Guitar Hero: Aerosmith. The series, known for making gamers feel like rock stars, first put real rock stars into games with the inclusion of guitar gods Slash and Tom Morello as boss characters in Guitar Hero III: Legends of Rock, but Guitar Hero: Aerosmith lets players follow the legendary Boston-based quintet's ascension from the tiny Nipmuc High School auditorium to center stage at the Super Bowl XXXV halftime show.\n \nMore of a healthy, Aerosmith-themed expansion of Guitar Hero III than a completely new entry in the series, Guitar Hero: Aerosmith nevertheless offers more than 40 new rock songs to which gamers can shred. The track list is heavy with Aerosmith classics like &quot;Dream On,&quot; &quot;Sweet Emotion,&quot; and &quot;Rag Doll,&quot; but the game also features songs from groups that have influenced or toured with the band, including Mott the Hoople, New York Dolls, and The Black Crowes.\n \nGamers can begin as familiar characters from Guitar Hero III like Axel Steel and Midori, but eventually they'll be able to jam as guitarists Joe Perry and Tom Hamilton. New outfits become available as players progress through the six venues, and for the first time in the series, all five members of the group will be on stage at once. Lead singer Steven Tyler spent a month shooting motion capture video, while Perry, Hamilton, and Brad Whitford shred on dozens of real guitars from their personal collection, all of which can be unlocked.\n \nThough Guitar Hero: Aerosmith features standard issue rhythm-based gameplay, the single-player difficulty level has attenuated, and gamers are only confronted by one boss battle. Co-op career mode has been removed, but gamers can still go head-to-head or unlock songs cooperatively in the regular career mode.\n\n...................................\n\nWhere all leachers in the end~But for once-How about seeding so others can get this as well..\nWith that please seed at least 150% of the files givin..\n\nThank you for downloading\n\nLater,\nCivic/Scootin","torrent":{"xt":"urn:btih:4627f181e3470308953b130862c71ef121107831","amp;dn":"Guitar+Hero+Aerosmith+%28NTSC%2FUSA.PS2.ESR-Pre+Patched%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4627f181e3470308953b130862c71ef121107831","infoHashBuffer":{"type":"Buffer","data":[70,39,241,129,227,71,3,8,149,59,19,8,98,199,30,241,33,16,120,49]},"announce":[],"urlList":[]}}