{"title":"Final-Destination{2009}3D.DVDrip{vice}","uid":5266388,"size":554386549,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4661274cf2a7f95b80650a73fdb3e8761201e768&amp;dn=Final-Destination%7B2009%7D3D.DVDrip%7Bvice%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"vicerock","files":-1,"time":1262897032,"description":"THE FINAL DESTINATION 4 2009 DVDrip IN 3D\n\nVIDEO CODEC Xvid\nformat Avi\nsize/res 640x528[wide screen]\nrun-time 01:21:46\nvideo bitrate 512\nvideo framerate 25\nXvid profile asp5\n\nAUDIO CODEC mp3\naudio bitrate 128\nsample rate 44100\na/v sync basic\n\nCAST\n\nBobby Campo\nShantel VanSanten\nHaley Webb\nMykelti Williamson\nNick Zano\nKrista Allen\n\nPlot\n\nThe film is set 10 years after the explosion of Flight 180, 9 years after the pile-up on Route 23, and 4 years after the derailment of the Devil's Flight roller coaster. Nick O' Bannon (Bobby Campo) is at the McKinley Speedway watching a race with his friends Hunt Wynorski (Nick Zano), Janet Cunningham (Haley Webb) and his girlfriend Lori Milligan (Shantel VanSanten). Nick has a premonition of the cars crashing and debris flies into the stands, killing all of his friends and others in the 180 section of the stadium. He persuades his friends to leave, while others follow him to argue. Nadia Monroy (Stephanie Honore) says &quot;Have you all lost your minds!?&quot; but is crushed by a tire in front of her boyfriend Andy Kewzer (Andrew Fiscella).\n\nAfter a few weeks, the survivors go to the memorial of the crash. Carter Daniels (Justin Welborn), a racist, goes to George Lanter (Mykelti Williamson), a fellow survivor, to burn a cross in front of his home, but is burned alive while being dragged by his tow truck. Then, Samantha Lane (Krista Allen) and her children go to a salon. After a few accidents including a faulty chair and a can of hair spray exploding when heated by straightening irons, Samantha leaves, but her children don't move. A omen to her death is that she says &quot;I've got my eye out on you&quot; just before a lawnmower catches a rock, sending it to Samantha's eye, killing her in front of the staff and her children, this is presumed to be one of the same rock she scolded her children for throwing moments before entering the salon. Nick hears about their deaths on the news, but saw omens before they occurred. As Nick increasingly worries of himself because of his abilities to have premonitions and reading signs, compels him and Lori to do research to understand them. They discover that there were people, like Nick, who each had premonition of a disaster and saved themselves and others who were with them, but died shortly afterward after a series of improbable accidents (including the events of the last three films) and some claimed that an unseen personification of Death was aftering them before they died. Disturbed of what they've discovered, Nick and Lori meeting George when they return to the speedway to remember the orders on the premonition and convince him that Death is haunting them. Later on, the gang visit Andy, but witness him get his back sliced to chunks by a chain-link fence when a nitrous bottle is fired towards him pushing him into the fence. Then, Hunt is at the pool when he drops his lucky coin into it. He dives into the pool to retrive it, but becomes sucked onto the drain, which then violently sucks his organs out of his body. Janet is saved before getting skinned alive by a washer in a car wash. Before this, Nick saw a sign Clear Rivers Water, which indicated how Hunt and Janet would have died, from water (with the name Clear Rivers being an obvious reference to Ali Larter's character in the first Final Destination film).\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1144884/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1144884/&lt;/a&gt;\n\nPLEASE SEED AND ENJOY THANKS\n\nscreen shots\n &lt;a href=&quot;\nhttp://img63.imageshack.us/img63/7290/fd3dviceavi.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img63.imageshack.us/img63/7290/fd3dviceavi.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img85.imageshack.us/img85/2218/vlcsnap2010010420h54m48.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img85.imageshack.us/img85/2218/vlcsnap2010010420h54m48.png&lt;/a&gt; &lt;a href=&quot;\nhttp://img687.imageshack.us/img687/2464/vlcsnap2010010420h54m58.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img687.imageshack.us/img687/2464/vlcsnap2010010420h54m58.png&lt;/a&gt; &lt;a href=&quot;\nhttp://img687.imageshack.us/img687/3217/vlcsnap2010010420h55m06.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img687.imageshack.us/img687/3217/vlcsnap2010010420h55m06.png&lt;/a&gt;","torrent":{"xt":"urn:btih:4661274cf2a7f95b80650a73fdb3e8761201e768","amp;dn":"Final-Destination%7B2009%7D3D.DVDrip%7Bvice%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4661274cf2a7f95b80650a73fdb3e8761201e768","infoHashBuffer":{"type":"Buffer","data":[70,97,39,76,242,167,249,91,128,101,10,115,253,179,232,118,18,1,231,104]},"announce":[],"urlList":[]}}