{"title":"AutoViewer 2.0","uid":5201093,"size":674199,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:46f03d3e2727885a6a4877b36071a08bea4adeb4&amp;dn=AutoViewer+2.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dvhrld","files":1,"time":1260167425,"description":"--==AutoViewer==--\nCreated by Dave Harold\n\n--==About==--\nThis program will browse the selected urls in a minimized, invisible, Internet Explorer browser window. Each url will be opened up in its own tab. It will browse the 4 urls the amount of time you set, close, and start again using a different proxy, if you want to use a proxy.\n\n--==Setup==--\n1. Enter the desired urls into the input box, press add ,save the urls if you wish by clicking the corresponding button.\n2. Under the &quot;Settings&quot; tab, set the amount of time you wish to browse the urls for in seconds. Recomended setting is between 30 and 60 seconds\n3. Also under the &quot;Settings&quot; tab choose if you want to use proxies and if you want to log bad ones.\n4. Add valid HTTP proxies using the format given (123.123.123.123:444), save the proxies if you wish by clicking the corresponding button.\n   If you decide not to use proxies leave the &quot;Use Proxy?&quot; Unchecked.\n5. Click &quot;Start&quot; to earn some cash. \n6. When you are done CHECK the box marked &quot;Check to stop&quot;\n\n-NOTE-\nManually editing the ini file may cause problems, do so at your own risk.\n\n-Proxy Note-\nProxies do not last forever, some may last weeks while others a couple minutes. You can view the log.txt file for proxies that are no longer good. Error codes can be found beside the bad proxies and can be matched up with explanations found in the &quot;Error Code&quot; section here or googled.\n\n\n--==Disclaimer==--\nUse this program at your own risk, I will not be held responsible for anything. If you have any questions, comments, or suggestions you can direct them to me on the AutoClickers forum.\n\n--==History==--\nv2.0\n  *almost a complete revamp\n  *unlimited urls can be in the list now\n  *shortened code with improved efficiency\n  *fixed some crashes\n  *probably other improvements that I can't remember now\t\nv1.8\n  *Semi-automatic update added\n  *added settings tab with some new features\n  *added clear proxy list button\n  *no need to pack ini (it will be created upon first run) \n  *crash fix\nv1.7\n  *fixed a bug where the proxy might not be enabled\n  *added logging for bad proxies (explanation for error codes available on website)\n  *if a proxy is bad it will skip it and move to the next in the list\n  *minor bug fixes\nv1.6\n  *added feature &quot;add from clipboard&quot;\n  *adding a blank proxy will no longer clear the list\n  *proxy inputbox will automatically clear after addition\n  *start button fix\nV1.5\n  *rewrote program with GUI\nV1.4\n  *hopefully increased efficiency again.\nv1.3\n  *added website link.\n  *rewrote the code to be more efficient.\n  *ini file no longer needs the &quot;proxy&quot;x prefix.\n  *now supports infinite proxies.\n  *you can see how many proxies you are using by selecting &quot;Number of Proxies&quot; in tray.\n  *will now only use proxy for 3 minutes so some proxies won't tag you as abusive.\n\nv1.2\n  *removed duplicate entry in .ini file.\n  *you can now see what proxy you are using in the tray by selecting &quot;Current Proxy&quot;.\n\nv1.1\n  *added all CAPS to yes or no input box.\n  *added menu to tray icon.\n  *on exit will now kill the iexplorer process.\n\nV1.0\n  *first public release.\n\n\nOfficial Website   &lt;a href=&quot;\nhttp://youbot.nl.eu.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://youbot.nl.eu.org&lt;/a&gt;","torrent":{"xt":"urn:btih:46f03d3e2727885a6a4877b36071a08bea4adeb4","amp;dn":"AutoViewer+2.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46f03d3e2727885a6a4877b36071a08bea4adeb4","infoHashBuffer":{"type":"Buffer","data":[70,240,61,62,39,39,136,90,106,72,119,179,96,113,160,139,234,74,222,180]},"announce":[],"urlList":[]}}