{"title":"Jaci Velasquez - Un Lugar Celestial (English Version)(2nafish)","uid":5411773,"size":139057156,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:47eb1bc0a1adc9de99932aa558999bc01eff3de0&amp;dn=Jaci+Velasquez+-+Un+Lugar+Celestial+%28English+Version%29%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1267778435,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\nJacquelyn Davette Velasquez (born October 15, 1979) is an American multi-Award winning &amp; nominated Contemporary Christian Latin Pop singer in both English &amp; Spanish.\n\nHeavenly Place is Jaci Velasquez's debut album, released in 1996 on Myrrh Records.\n\nJaci has sold over 4 million albums, garnered three RIAA certified Platinum recordings, three RIAA certified Gold recordings, sixteen #1 radio hits, and has graced more than 50 magazine covers. Her resume includes ad campaigns for Pepsi, Doritos, Target, Frizz-Ease, and Helzberg Diamonds.\n\nVelasquez grew up in an Evangelical church where her parents were singers, evangelists and pastors. She is of Mexican, Spanish and French ancestry. When she was ten years old, her parents leased their Houston home and dedicated themselves to touring the United States with their Christian music and evangelism. It was while on the road that she was discovered by a representative of Myrrh Records.\n\nVelasquez released her third album &quot;Heavenly Place&quot; in 1996 and five of the songs on that CD became #1 hits (she had two previous independent records). The album was later certified Platinum. She has since released six English-language albums, two of which were certified Gold. She has produced sixteen #1 Christian radio hits and six other top-10 singles, and has won seven Dove awards, including New Artist of the Year and two Female Vocalist of the Year wins.\n\nIn 1998, she signed to Sony Latin and was introduced to Rudy Perez, who produced her first Spanish-language crossover album Llegar a Ti. After that, Velasquez was able to achieve the crossover appeal she desired, building a fan base among Hispanics as well as other Americans. Her first single, &quot;Llegar a Ti,&quot; topped the Billboard Hot Latin Tracks and became the first Christian song to top the chart. The song also gave her a Latin Grammy Award nomination for Best Pop Female Vocal Performance, which finally went to Colombian singer Shakira.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:47eb1bc0a1adc9de99932aa558999bc01eff3de0","amp;dn":"Jaci+Velasquez+-+Un+Lugar+Celestial+%28English+Version%29%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47eb1bc0a1adc9de99932aa558999bc01eff3de0","infoHashBuffer":{"type":"Buffer","data":[71,235,27,192,161,173,201,222,153,147,42,165,88,153,155,192,30,255,61,224]},"announce":[],"urlList":[]}}