{"title":"The Legendary Strike 1978 DVDRip-TommyBlade English Audio, 608x3","uid":6312015,"size":837077570,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:48044dedcc0c3380e92c37dd521cb28c398249b5&amp;dn=The+Legendary+Strike+1978+DVDRip-TommyBlade+English+Audio%2C+608x3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"DeadlyVenomRelease","files":4,"time":1302576106,"description":"Release Title: The Legendary Strike 1978 DVDRip-TommyBlade English Audio, 608x338, DivxAVI, 798MB\n\n[center][img]http://ezpicshare.com/images/rad0a806le.jpg[/img][/center]\n\nOther titles : Iron Maiden (Int. Title)\nKung Fu Fighter (French Title)\nLa LÃƒÂ©gende de shaolin (French Title)  \n\n\nClip From Legendary Strike:\n[youtube]kkc_BdRGyBU[/youtube]\n\n\nPLOT:\nLegendary director Huang Feng directs the equally legendary CARTER WONG and ANGELA MAO in this action epic! When Prince Yung hires a Japanese guard to transport a rare and precious &quot;Dharma's Relic&quot;, all hell breaks loose as various fighters across the land compete for the Buddhist artifact. LEGENDARY STRIKE is one legendary battle of the kung fu titans you don't want to miss! \n\n\nREVIEW:\nTHE LEGENDARY STRIKE (1978) is a made-in-Taiwan kung fu film that takes a simple, timeworn premise and offers enough clever variations to put its solid cast through their paces and keep jaded kung fu fans entertained without exactly breaking any new ground. The plot deals with a search for a valuable pearl, dubbed the Buddha's Relic, which is sold to an unwitting Japanese emissary by a corrupt Ching Dynasty prince who seeks to steal it back for his own purposes. The plan goes awry and the pearl winds up inside the corpse of one of the prince's henchmen who is dressed as a Shaolin monk.\n\nA Ming rebel gets hold of the corpse and hides it, leading to an elaborate game of cat-and-mouse as the corrupt prince and other Ching officials put on plain clothes and join the hunt for the relic at an inn in the rural Chinese countryside run by a secretive man and his pretty daughter who have a network of tunnels and secret chambers hidden beneath the inn. An actual Shaolin monk seeking to return the pearl to the famed monastery allies with the prince, while a female fighter working for Korean agents enters the picture and sides with the Ming rebel.\n\nThe early scenes involving the switching of the pearl-laden corpse with that of the Japanese emissary in different coffins are quite clever and offer the opportunity for all sorts of confrontations, some quite amusing. Famous fighting femme Angela Mao, as the fighter working for the Koreans, first appears about 30 minutes in as the occupant of one of the coffins, having switched places with the corpse to throw off the pursuers. However, the scriptwriters run out of new ideas about half-way through and the film meanders to an inconclusive ending.\n\nMao, clad in a dramatic red costume, has a handful of good fight scenes, and her opponents include the always noteworthy kung fu stars, Carter Wong and Chen Sing, as the corrupt Ching nobles. Kam Kong puts on a good show as the Shaolin monk and familiar round-faced villain Chan Lung makes a crafty henchman. Unfortunately, the main heroic role of the Ming rebel is played by Chu Kong (THE BIG HEAT, THE KILLER), an adequate leading man but not much of a fighter. An acrobatic stunt man is an obvious fill-in for him in most long shots.\n\nThe film is shot almost entirely on picturesque Taiwan locations. Its rugged outdoor setting with varied characters converging on a single remote outpost recalls many similarly themed Hollywood westerns, except that the characters here fight with swords, fist and feet rather than guns. The western connection is further enhanced by the film's reliance on a dramatic music score, with lots of brass and a Chinese-language ballad retained on the English-dubbed soundtrack.\n\nThe film is no classic, nor does it contain the best work of Angela Mao (WHEN TAEKWONDO STRIKES), Carter Wong (THE 18 BRONZEMEN), or Chen Sing (THE MAGNIFICENT). But it is fast-paced and good to look at and rather better than average for Tai Seng's Martial Arts Theater old-school kung fu lineup, which ranges from the sublime (HITMAN IN THE HAND OF BUDDHA, EAGLE'S CLAW) to the ridiculous (72 DESPERATE REBELS, 99 CYCLING SWORDS). \n\n\n\nINFO:\nTiTLE......[ The Legendary Strike\nRUNTiME....[ 01:28:30\niMDB URL...[ [url]http://www.imdb.com/title/tt0077829/[/url]\n\nAUDiO......[ MP3 48000Hz 128 kb/s CBR (2 chnls)\nLANGUAGE...[ English Dubbed\nViDEO......[ 1,124 kbps Xvid 23.976 FPS \nQ. FRAME...[ 0.228 bits*pixel\nRESOLUTiON.[ 608 x 338\nSUBS.......[ None  \nFiLES......[ 1 \nSiZE.......[ 798 MB\nSOURCE.....[ DVD \n  \n\nSCREENS:\n[img]http://ezpicshare.com/images/vlcsna-1298937601.png[/img]\n[img]http://ezpicshare.com/images/vlcsna-1298937636.png[/img]\n[img]http://ezpicshare.com/images/vlcsna-1298937646.png[/img]\n[img]http://ezpicshare.com/images/vlcsna-1298937661.png[/img]\n[img]http://ezpicshare.com/images/vlcsna-1298937676.png[/img]\n[img]http://ezpicshare.com/images/vlcsna-1298937686.png[/img]\n[img]http://ezpicshare.com/images/vlcsna-1298937698.png[/img]\n[img]http://ezpicshare.com/images/vlcsna-1298937714.png[/img]\n[img]http://ezpicshare.com/images/vlcsna-1298937727.png[/img]\n[img]http://ezpicshare.com/images/vlcsna-1298937738.png[/img]\n\n\nCassnova Wong, Chen Sing, Carter Wong &amp; Angela Mao Brings A 4* Entertainment. Great Plot &amp; Wonderful Fast Pace Fight Scenes And A thrilling End Fight Brings You\nThe Legendary Strike. Really Enjoy The Top Quality Flick.\n\n\nNot All My Releases I Put Up Torrent ,You Can Find All My Releases At http://www.fuflixbulletin.net\nNeed An Invite Hit Up &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;237751465b55424d47424e634b4c574e424a4f0d404c4e&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;","torrent":{"xt":"urn:btih:48044dedcc0c3380e92c37dd521cb28c398249b5","amp;dn":"The+Legendary+Strike+1978+DVDRip-TommyBlade+English+Audio%2C+608x3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48044dedcc0c3380e92c37dd521cb28c398249b5","infoHashBuffer":{"type":"Buffer","data":[72,4,77,237,204,12,51,128,233,44,55,221,82,28,178,140,57,130,73,181]},"announce":[],"urlList":[]}}