{"title":"Indie 69 March 2010 New Music Indie Playlist","uid":5403356,"size":455816873,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4a2920c743aec650f5098a59893f7932ba85d7ae&amp;dn=Indie+69+March+2010+New+Music+Indie+Playlist&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"indie69","files":-1,"time":1267505561,"description":"One year and one month on and I'm still not tired of doing this thing. In January (in print, Feb) , Paste magazine published the &quot;Is Indie Dead?&quot; issue, which immediately begged the question &quot;what is Paste?&quot;. Well, at least the people I mentioned it to.  I guess the real question is &quot;has Paste run out of ideas?&quot; or &quot;Is Paste dead?&quot;. I kid, I kid. I like Paste and honestly the article was great and posed a lot of interesting (if not intentional) questions. But when it comes right down to it, whatever THIS is, it's certainly far from dead. And as I've said a thousand times, the minute music is unable to support itself to the point that no-one can afford to release CDs, tour, etc, guess what happens? Music will find a new way  to release CDs (or simply releases), tour, etc etc. In other words, it will always find a way back. I quote a friend here for clarity... &quot;If no-one published books anymore, someone would publish books&quot;, to put it quite bluntly. And that's about it, really. All the hand-wringing and brow sweat in the world will not END culture. It will always survive and prosper to varying degrees. And if it feels like it's not speaking to you anymore, perhaps you got old and didn't notice. May I suggest a mirror and some hair coloring? Does Dark Side of the Moon sound fresh and new to you? Do you think Phil Collins got a bad rap in the 80's-90's? Have the words &quot;that ISN'T MUSIC!!&quot; left your lips lately? Instead of ignoring or deleting that &quot;We make rock hard for girlfriend happy happy super medicine&quot; spam e-mail, did you click on it and read it? These could be signs that &quot;Indie is Dead&quot;. Embrace or ignore accordingly.\n\nEnd rant. March is going to be another great month for new music and I hope this playlist reflects that.  Some may wish they could put their finger on one trend or sound that seems to be taking off at the moment, an &quot;IT&quot; sound. But I like that this is becoming more and more difficult (at least for me) lately. And this month reflects that. One stand-out track is the track I posted a few days ago from Doyle and the FourFathers. I'm not even remotely tired of it and it's been in constant rotation along with their other tracks released HERE. I think it's going to be a very memorable album.","torrent":{"xt":"urn:btih:4a2920c743aec650f5098a59893f7932ba85d7ae","amp;dn":"Indie+69+March+2010+New+Music+Indie+Playlist","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a2920c743aec650f5098a59893f7932ba85d7ae","infoHashBuffer":{"type":"Buffer","data":[74,41,32,199,67,174,198,80,245,9,138,89,137,63,121,50,186,133,215,174]},"announce":[],"urlList":[]}}