{"title":"The Legend Of Zelda: The Hero Of Time[2010][DVDRIP]","uid":5271578,"size":680242509,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4a4c10253b4808dc78086d184bba0b92f86f288e&amp;dn=The+Legend+Of+Zelda%3A+The+Hero+Of+Time%5B2010%5D%5BDVDRIP%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"johnnyathm1","files":2,"time":1263264177,"description":"[ About the Movie ]\n\nThe Hero of Time is a full-length, independent movie being made by a small group of producers and film buffs called BMB Finishes. All of the people making the movie are big fans of the Zelda series, and they have put a ton of creativity and effort into this film.\n\nStarring:\nDavid Blane - Link\nHannah Fierman - Zelda\nAdam Boyer - Ganon\n\nThe movie is being directed and produced by Joel Musch. David Blane is also producing the film on top of starring as Link.\n\nThe movie's story is roughly based off that of The Legend of Zelda: Ocarina of Time. Link, who has been raised by the Kokiri, is sent to Hyrule City by the Great Deku Tree. Once there, he meets Princess Zelda who tells him what the Triforce symbol on his hand means and exactly who he is,\n\nMeanwhile, Ganon has arranged a banquet for the king, but this gesture, seemingly in good faith, is just a part of his evil scheme. At the banquet, the king is poisoned, and Ganon overthrows the kingdom. Link flees to the Temple of Time and takes the Master Sword, but is shocked when he finds he has suddenly traveled into the future. Link discovers that it is a bleak future, for Ganon has destroyed the land, and so he sets out to find Zelda. Along the way he meets Sheik, and learns that he will need the help of the sages to defeat Ganon. After he defeats demons that are guarding the sages, Link returns to Hyrule where he confronts donzens of Gerudo warriors and ultimately fights Ganon.\n\nAlong the way, other characters from the game make appearances, including Saria, Impa, Malon and Talon. ","torrent":{"xt":"urn:btih:4a4c10253b4808dc78086d184bba0b92f86f288e","amp;dn":"The+Legend+Of+Zelda%3A+The+Hero+Of+Time%5B2010%5D%5BDVDRIP%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a4c10253b4808dc78086d184bba0b92f86f288e","infoHashBuffer":{"type":"Buffer","data":[74,76,16,37,59,72,8,220,120,8,109,24,75,186,11,146,248,111,40,142]},"announce":[],"urlList":[]}}