{"title":"Fifty Dead Men Walking DVDR NTSC","uid":5261637,"size":4639659520,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:4bf8d97a2ef32b086a14c4f90f3e2ece174ab71f&amp;dn=Fifty+Dead+Men+Walking+DVDR+NTSC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"CuriousGeorge","files":-1,"time":1262753793,"description":"IMDB Review:\n\nIn the 1980s when the Irish civil conflict was at its most treacherous, 22 year old Martin McGartland was recruited by the British police to infiltrate and spy on the IRA. He lived his life under constant threat of exposure and subsequent guaranteed torture and death yet he continued because his information saved many lives. He enjoyed the buzz until one day he was discovered and had to escape against all odds. Inspired by a true story, to this day he is on the run.\n\nMarty McGartland is a 22-year-old street hustler from Ireland, living in the 1980s. He gets noticed by the Provisional Irish Republican Army|Irish Republican Army, but thinks their cruel justice is no good. The British want to use Marty as well, because of his connection to the community undetected. The British police want him to infiltrate and spy on the IRA. Marty decides to work for the police because of his IRA dislike. He soon forgets his political preferences when his powerful position takes over. Despite fearing that the IRA will find out about his spying, he builds up a new sense of self esteem. Afraid his family and friends will be murdered if they are informed, Marty starts to lead a double life. Even his new girlfriend Lara knows nothing of his work.\n\nThings start to take their toll when the British sell them out. They explain their system could fall down and reveal Marty was their bait all along. The IRA capture and torture Marty, but he is able to escape. His best friend and former British police colleague finds Marty and decides to help him hide. Marty knows the IRA will turn to his family and is forced to make a decision, saving himself or his beloved ones. \n\n--------------------------------------------------------------------------------\n\nFor some reason the DVD menu is in Portuguese. To watch the movie in English without subtitles, go to &quot;configuraÃƒÂ§ÃƒÂµes&quot; then select &quot;sem legendas.&quot;\nClick film and you're on your way!\n\n","torrent":{"xt":"urn:btih:4bf8d97a2ef32b086a14c4f90f3e2ece174ab71f","amp;dn":"Fifty+Dead+Men+Walking+DVDR+NTSC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4bf8d97a2ef32b086a14c4f90f3e2ece174ab71f","infoHashBuffer":{"type":"Buffer","data":[75,248,217,122,46,243,43,8,106,20,196,249,15,62,46,206,23,74,183,31]},"announce":[],"urlList":[]}}