{"title":"Ecoul","uid":5279922,"size":48642965,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4c22493fbdc7059198c7987df3e16e3bb36fbd4c&amp;dn=Ecoul&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ggrrigson17","files":15,"time":1263508894,"description":"IN SFARSIT, INREGISTRARILE DIGITALE\n\nMie imi place mult Ecoul. Ca orice om normal, am ascultat primele piese la Cenaclul Flacara, dupa care a aparut albumul Taina, prin nouazeci si ceva. &quot;Taina&quot; a aparut doar pe caseta si desi la vremea respectiva mi se parea ca se aude bine, perceptia s-a schimbat cand am trecut in era digitala. Am batut net-ul de sute de ori in cautarea inregistrarilor digitale, insa tot ce am gasit au fost transpuneri de pe caseta, mai mult sau mai putin reusite. Pana intr-o zi, cand cautand aproape din reflex, am gasit la un tip un folder Ecoul-Taina care continea 15 fisiere numite Track 1, 2,...15. Acest mic detaliu sugera un CD, care CD insa daca pe piata nu era nimic??!! Intrigat peste masura, am trecut la download. A mers foarte greu, dar am reusit sa le iau pe toate si ...surpriza! Sunt intr-adevar inregistrari digitale. I-am scris tipului un mesaj, dar nu mi-a raspuns; habar n-am ce si cum.\n\nFiind si eu muzician, mi-aduc aminte ca prin anii 90 se purta inregistrarea pe DAT, un fel de caseta mica insa digitala, de pe care faceai copii pe caseta normala analogica. Probabil artistele, cineva apropiat sau cineva din studio au pastrat DAT-ul si au facut un CD pentru &quot;uz intern&quot;. Din fericire, piesele au ajuns si pe net iar eu mi-am propus sa le promovez cat se poate de mult, caci mi se par niste comori autentice de care ar trebui sa se bucure toata lumea. O sa le tin in seed in permanenta, dar sunt zile cand nu deschid compu', asa ca mai bagati si voi.","torrent":{"xt":"urn:btih:4c22493fbdc7059198c7987df3e16e3bb36fbd4c","amp;dn":"Ecoul","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c22493fbdc7059198c7987df3e16e3bb36fbd4c","infoHashBuffer":{"type":"Buffer","data":[76,34,73,63,189,199,5,145,152,199,152,125,243,225,110,59,179,111,189,76]},"announce":[],"urlList":[]}}