{"title":"Gloria Estefan - This Christmas  (2nafish)","uid":5240112,"size":145203204,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:4e45704357c3027474bcd0c7e220d0488a70a3d9&amp;dn=Gloria+Estefan+-+This+Christmas++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1261721643,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;This Christmas&quot; is a well-known Christmas song originally recorded by R&amp;B singer/songwriter Donny Hathaway and released as an Atco single in 1970. Hathaway co-wrote the song (it is credited to Nadine McKinnor and &quot;Donny Pitts,&quot; the stage name Hathaway used as a young rap singer). Since Hathaway's original version, it has become something of a modern holiday standard, covered by a wide range of artists:\n\nChristmas Through Your Eyes is the fourth studio solo album released by Latin-American singer Gloria Estefan, and sixteenth overall, in 1993.\n\nFollowing the success of her multi-awarded Latin album, Mi Tierra, Estefan recorded a collection of all Christmas songs released in the autumn of 1993. The collection contains mostly traditional songs along with the title track, an original song written by Estefan and Diane Warren. The title track was previously released on Estefan's 1992 Greatest Hits album. The Spanish-language song called &quot;Arbolito de Navidad&quot; is also included.\n\nGloria Estefan, who had found worldwide success singing pop and dance songs, is accompanied by a Big Band on the song &quot;Let It Snow! Let It Snow! Let It Snow!&quot; and sings a Jazz-inspired rendition of &quot;This Christmas&quot;. Music videos were filmed and released for the songs, &quot;This Christmas&quot; and &quot;Silent Night&quot;, available on the video-collection Everlasting Gloria!.\n\nGloria Estefan (born Gloria MarÃƒÂ­a Fajardo GarcÃƒÂ­a; September 1, 1957) is a Grammy Award-winning Cuban-American singer and songwriter. She is in the top 100 best selling music artists with over 90 million albums sold worldwide, 26.5 million of those in the United States alone. She has won seven Grammy Awards, placing her among the most successful crossover performers in Latin music to date.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:4e45704357c3027474bcd0c7e220d0488a70a3d9","amp;dn":"Gloria+Estefan+-+This+Christmas++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e45704357c3027474bcd0c7e220d0488a70a3d9","infoHashBuffer":{"type":"Buffer","data":[78,69,112,67,87,195,2,116,116,188,208,199,226,32,208,72,138,112,163,217]},"announce":[],"urlList":[]}}