{"title":"[Q-CLONE 002] Prince Of Darkness (1987) UNCOMPRESSED DVD9 + ART","uid":5255035,"size":6225623819,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4efb90775b6109e58a4ee3148da9130a7662b6e0&amp;dn=%5BQ-CLONE+002%5D+Prince+Of+Darkness+%281987%29+UNCOMPRESSED+DVD9+%2B+ART&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Quidsane","files":-1,"time":1262519886,"description":"Relevant Info from Wiki:\n\nPrince of Darkness (also known as John Carpenter's Prince of Darkness) is a 1987 American horror film directed, written and scored by John Carpenter. The film is the second installment in what Carpenter refers to as his &quot;Apocalypse Trilogy&quot;, which began with The Thing and concludes with In the Mouth of Madness.\n\nThe idea for the film came about as Carpenter had been researching theoretical physics and atomic theory. He recalled, simply, that &quot;I thought it would be interesting to create some sort of ultimate evil and combine it with the notion of matter and anti-matter&quot;. This idea, which would eventually develop into the screenplay for Prince of Darkness, was to be the first of a multi-picture deal with Alive Pictures, where Carpenter was allocated $3 million per picture and complete creative control.\n\nExecutive producer Shep Gordon was also manager to singer Alice Cooper and suggested Cooper record a song for the picture. Carpenter also cast Cooper in the picture as one of the homeless zombies. Cooper also allowed the use of his 'impaling device' from his stage show to be used in the film in a scene where Cooper's character kills Etchinson. The song Cooper wrote for the film, also titled &quot;Prince of Darkness&quot;, can be heard briefly in the same scene playing through Etchinson's headphones, although the song was not released until a year later.\n\nCarpenter brought back to the film people that he had worked with previously, including Victor Wong and Donald Pleasance. Peter Jason, soon to become a Carpenter regular, was also in the film.\n\nThe film was shot through a slightly anamorphic lens, giving a subtle distortion to every scene.\n\nAlthough Carpenter wrote the screenplay, in the film's credits the writer is listed as Martin Quatermass, a homage repeated in the film with Kneale University. These were in reference to the British film and television writer Nigel Kneale and the famous fictional scientist he created, Professor Bernard Quatermass. The storyline features elements associated with Kneale (the ancient evil aspect of both Quatermass and the Pit and The Quatermass Conclusion, the idea of messages from the future from The Road, and the scientific investigation of the supernatural from The Stone Tape). Carpenter returned to the idea of clerical secrecy in Vampires.\n\nKneale, however, was irritated with this use of the character's name in the film's credits, as he feared that the impression may be given that he had something to do with the film. Previously, he had written the original screenplay for the 1982 film Halloween III: Season of the Witch for Carpenter, but had been so incensed with all of the changes director Tommy Lee Wallace had made to it that he had his name removed from the credits.\n\nIn Japan, the film was re-named John Carpenter's Paradigm and Spain released the film under the title El Principe de las tinieblas. Both countries created their own artwork for the film. The Spanish DVD has an extra not on the UK disc, a two minute feature with John Carpenter talking about the film.\n\nR1 America - (Universal - Reissue)\n\nExtras: Theatrical trailer\n\nSubtitles: French and Spanish\n\nAspect Ratio: 2.35:1\n\nPicture Format: ANAMORPHIC\n\nTV System: NTSC\n\nSoundtrack(s): English Dolby Digital 2.0 Surround\n\nCase type: Amaray (Keep) Case\n\nNo shrinkage of ANY kind.\nComes with ALL artwork. (Hi-Res .png files)\nNo HD-DVD or Blu-Ray version has been released.\nAFAIK, this is the best version available...","torrent":{"xt":"urn:btih:4efb90775b6109e58a4ee3148da9130a7662b6e0","amp;dn":"%5BQ-CLONE+002%5D+Prince+Of+Darkness+%281987%29+UNCOMPRESSED+DVD9+%2B+ART","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4efb90775b6109e58a4ee3148da9130a7662b6e0","infoHashBuffer":{"type":"Buffer","data":[78,251,144,119,91,97,9,229,138,78,227,20,141,169,19,10,118,98,182,224]},"announce":[],"urlList":[]}}