{"title":"NDS_Ghostbusters - The Video Game 2Lions-Team","uid":5206467,"size":67134953,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:4f4cf1b96630367c3ecf2098dd89a0a723490d21&amp;dn=NDS_Ghostbusters+-+The+Video+Game+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"PPvdRW","files":-1,"time":1260394278,"description":"Ghostbusters: The Video Game\n\nBeschrijving\nNa vele jaren van afwezigheid zijn de Ghostbusters eindelijk weer terug. Bill Murray, Dan Aykroyd en Harold Ramis hebben voor de game de stemmen van hun karakters ingesproken. Hier blijft het niet bij, want Aykroyd en Ramis hebben net zoals bij de twee voorgaande Ghostbusters films het script voor hun rekening genomen.\nGhostbusters: The Game is dan ook het officiÃƒÂ«le derde deel in de filmreeks. Het is vrij uniek dat een game wordt gebruikt om het verhaal van een populaire filmreeks voort te zetten. Ghostbusters: The Game speel je vanuit het perspectief van de derde persoon. Je krijgt vele wapens tot je beschikking om eens en voor altijd af te kunnen rekenen met de vele spoken die door de steden zwerven.\nIn Ghostbusters: The Game speel je niet ÃƒÂ©ÃƒÂ©n van de Ghostbusters. Je bent een 'rookie' die voor het eerst meeloopt met de Ghostbusters. Zo zal je langzaam maar zeker leren hoe het is om een echte Ghostbuster te zijn. Hierbij kom je zowel nieuwe spoken tegen als spoken die je ook in de films gezien hebt.\nSpeciaal voor deze versie van het spel hebben de ontwikkelaars gekozen om het spel er niet realistisch uit te laten zien. Om optimaal gebruik te maken van de krachten van de spelcomputer ziet het spel er juist uit als een animatiefilm.\nNew York City wordt geplaagd door een grote hoeveelheid spoken, en het is aan de Ghostbusters om de stad weer spook-vrij te maken. Je weet het nu wel... wie moet je bellen? Ghostbusters!\n\n\nPEGI-leeftijd   7\n \nIntroductie     november 2009 \nEAN             3546430144671 \n\n\n******************************************\n\nBrought to you by \n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt;\n\n******************************************\n\n\n******************************************************\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n\n***************************************************** \n","torrent":{"xt":"urn:btih:4f4cf1b96630367c3ecf2098dd89a0a723490d21","amp;dn":"NDS_Ghostbusters+-+The+Video+Game+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f4cf1b96630367c3ecf2098dd89a0a723490d21","infoHashBuffer":{"type":"Buffer","data":[79,76,241,185,102,48,54,124,62,207,32,152,221,137,160,167,35,73,13,33]},"announce":[],"urlList":[]}}