{"title":"American Pie (1999) DVD-R NTSC (WS) [hjsn1]","uid":5253995,"size":4666427392,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:4f76ff3a6c890c0ce64c91aba8c80b7a40eebcf0&amp;dn=American+Pie+%281999%29+DVD-R+NTSC+%28WS%29+%5Bhjsn1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"hjsn1","files":29,"time":1262471242,"description":"\n                  @@@   @@@@@@    @@@@@@    @@@@@@   @@@  @@@  \n                  @@@  @@@@@@@@  @@@@@@@   @@@@@@@@  @@@@ @@@  \n                  @@!  @@!  @@@  !@@       @@!  @@@  @@!@!@@@  \n                  !@!  !@!  @!@  !@!       !@!  @!@  !@!!@!@!  \n                  !!@  @!@!@!@!  !!@@!!    @!@  !@!  @!@ !!@!  \n                  !!!  !!!@!!!!   !!@!!!   !@!  !!!  !@!  !!!\n                  !!:  !!:  !!!       !:!  !!:  !!!  !!:  !!!  \n             !!:  :!:  :!:  !:!      !:!   :!:  !:!  :!:  !:!  \n             ::: : ::  ::   :::  :::: ::   ::::: ::   ::   ::  \n              : :::     :   : :  :: : :     : :  :   ::    :   \n                                                  \n\n\n                              Movie Information\n                   &lt;a href=&quot; http://www.imdb.com/title/tt0163651/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt0163651/&lt;/a&gt;\n\nIt's said that most American men think about sex once every two or three minutes, but this statistic would seriously underestimate the horniness of Jim (Jason Biggs), a high school senior in suburban Michigan. Jim is thoroughly obsessed with sex, a fact of which his parents become aware when they discover him performing the sin of Onan with a gym sock while watching scrambled pay-per-view porn. Jim's buddies Kevin (Thomas Ian Nicholas), Finch (Eddie Kaye Thomas), and Oz (Chris Klein) are no less anxious to relieve themselves of their virginity, so they all make a pledge: they will go to bed with a woman in the three weeks before senior prom or die trying. Kevin appears to have the advantage, since he already has a girlfriend, Vicky (Tara Reid), but before he ventures into the Final Frontier, Kevin is urged to consult &quot;The Bible,&quot; a hand-written how-to manual possessing erotic wisdom passed down through the ages. Oz is a good-looking jock who is actually a nice guy -- which is part of the problem, since he has his heart set on a nice girl, Heather (Mena Suvari), who does not seem the type to leap into bed within 21 days. Finch has no immediate prospects, though Jessica (Natasha Lyonne) is in a position to know if those rumors about him are true. And Jim is a truly hopeless case -- after his attempted seduction of beautiful Czech exchange student Nadia (Shannon Elizabeth) turns out to be a disaster, he ends up going to the prom with Michelle (Alyson Hannigan), an annoyingly chatty band geek who does, however, have a fascinating story about a flute. American Pie was the directorial debut of Paul Weitz, who, along with his brother Chris Weitz (who served as producer), previously wrote several screenplays, including Antz and Madeline (where they presumably worked all their wholesome ideas out of their system).\n\n\n                                Mpaa Rating++++++++++\n\n                         Rated R for strong sexuality, crude sexual dialogue, language and drinking, all involving teens\n\n\n                                Retail Release Date++++++++\n\n                        9 July 1999\n\n                                DVD Content++++++++++\n\n                             \n                 Main Movie+++++++++++++++\n\t              +Video- CCE Encoded - 5 passes\n\t              +Audio-English, French\n                          +Subs-French, Spanish\n\n\n                 Menu+++++++\n\t              +Yes\t\n              \n                 Extras/Special Features+++++\n\t              +Yes\n\n                 Removed++++++++++++++\n\t              FBI crap and trailers and all of the other annoying and useless stuff.\n\n\n\n                 Chapters++++++++++++++\n\n1. Illegal Channels [:21]\n2. Main Titles [1:16]\n3. The Virgins [2:04]\n4. Stifler's Party [:16]\n5. The Pale Ale [:05]\n6. The Pact [:51]\n7. A Father-Son Chat [:56]\n8. The Bible [:25]\n9. Just Like Pie... [:51]\n10. By the Book [1:25]\n11. Nadia on the Net [:50]\n12. Stifler's Revenge [1:58]\n13. Something More Important [:54]\n14. I'm Gonna Have Sex! [2:24]\n15. The Prom [:38]\n16. The Palace of Love [1:25]\n17. The Next Step [3:39]\n18. End Titles [:32]\n\nUploader Info ***: Thank you for choosing my release from others that are available on the internet already. I wanted to ask a small favor. After you have completely downloaded my release, please return back where you downloaded the movie and leave a comment. Let me know how the movie quality is &amp; give others who are going to be downloading my release better information about the upload. I actually do check the comments and I try to respond as much as possible.\nAlso DO NOT COMMENT OR PRIVATE MESSAGE asking me to upload a movie that is going to be released on DVD in the upcoming week or month. Feel free to comment and leave requests for older movies or movies that have been out for a while. I am going to upload movies that I feel people will enjoy so if you have a movie you want me to upload that I haven't done yet, comment and i'll check it. Upload information is available to you @ torrentbucket.info. I am helping djfred keep up with you guys. The site is updated almost every week. He has movies listed on the site for up to a month in advance. If you truly love this DVD, do actually buy and support the producers, writers, actors who made this movie possible. Thank You [J]  \n\n\n\n\nLinks ***********: Here are many of djfreds tutorials, Enjoy. \n\n**DVD Ripping (how to: advanced) \n\n**Rip DVD9 to DVD5 with CloneDVD2 \n\n**Rip with DVDShrink \n\n**Burn Video_TS files with NERO \n\n**Watch DVD Files with VLC Player \n\nLet him know how you like his tutorials! &lt;a href=&quot; http://torrentbucket.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://torrentbucket.com/&lt;/a&gt;\n\nDVD Release Dates. &lt;a href=&quot; http://torrentbucket.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://torrentbucket.com/&lt;/a&gt; \n\nFor Mac Users who cant burn &amp; get CSS Error &lt;a href=&quot; http://forum.videohelp.com/topic340322.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://forum.videohelp.com/topic340322.html&lt;/a&gt;\n\n\nPEOPLE WHO DOWNLOAD TORRENTS FROM DJFRED AND MYSELF, PLEASE SEED EVEN AFTER THEY ARE DONE DOWNLOADING. THAT WAY WE WILL BE ABLE TO GET MORE MOVIES UP. WHO KNOWS, THE NEXT ONE WE PUT UP MIGHT BE A REQUEST OF YOURS.\n\n\nChronicles of Narnia: The Lion, The Witch and the Wardrobe (2005) DVD-R NTSC (WS)[hjsn1]\n\nhjsn1, djfred","torrent":{"xt":"urn:btih:4f76ff3a6c890c0ce64c91aba8c80b7a40eebcf0","amp;dn":"American+Pie+%281999%29+DVD-R+NTSC+%28WS%29+%5Bhjsn1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f76ff3a6c890c0ce64c91aba8c80b7a40eebcf0","infoHashBuffer":{"type":"Buffer","data":[79,118,255,58,108,137,12,12,230,76,145,171,168,200,11,122,64,238,188,240]},"announce":[],"urlList":[]}}