{"title":"Flyleaf - I'm So Sick  (2nafish)","uid":5276326,"size":103444484,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:4fbb812b412fb442a2255c01d8100f8c4cda6413&amp;dn=Flyleaf+-+I%5C%27m+So+Sick++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1263390870,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;I'm So Sick&quot; is the first single by Flyleaf. It is also their second music video, and it has been shown on many mainstream television networks.\n\nThe introduction is played with a distorted bass guitar. Flyleaf vocalist Lacey Mosley once commented that she was surprised at how much her voice &quot;downshifted&quot; during the introductions.\n\nOn March 3, 2008, &quot;I'm So Sick&quot; was released in the UK and was played on Scuzz, Kerrang! and MTV2.\n\nThere is another version of this song which is the demo version(released on Flyleaf (EP), this version is longer and has more lyrics. The radio edit does not feature any screaming. The same was done to The Red Jumpsuit Apparatus song &quot;Face Down&quot;.\n\nThe video for &quot;I'm So Sick&quot; appears about 10 minutes into the 2007 action film Live Free or Die Hard. It appeared on a TV screen in Matthew Farrell's (Justin Long) apartment. A remix of this song is included on the Resident Evil: Extinction soundtrack. The remix was created by Legion of Doom.\n\nThe song has been featured in games. &quot;I'm So Sick&quot; is an unlockable bonus track in the video game Rock Band. An adapted version of this song is featured in the PC game The Sims 2\n\nFlyleaf is the Texas alternative metal band Flyleaf's debut full-length album. It was released on October 4, 2005, debuting at #88 on the Billboard 200.\n\nThe album was released on October 4, 2005. On October 30, 2007, the band re-released this album repackaged as a CD/DVD version. The album has the same tracks on it, but acoustic versions of &quot;Cassie&quot;, &quot;Fully Alive&quot;, &quot;I'm So Sick&quot; and more. The DVD has exclusive interviews with Flyleaf and music videos of &quot;All Around Me&quot;, &quot;I'm So Sick&quot; and &quot;Fully Alive&quot;. It also came with a free ringtone of &quot;All Around Me&quot; and a locker poster. The album was re-released in the UK on January 14, 2008, with only 3 additional acoustic tracks on the CD. For this release, the album was released on Polydor which is a Major Record Label in the UK.\n\nWhen A&amp;M teamed up with Octone records, the album was re-printed to show the new label. This version had Fully Alive at a length of 2:34 replacing the 2:48 version, and a different back artwork.\n\nThe album was hugely publicised on the website Purevolume. &quot;I'm So Sick&quot; appears in the game Rock Band, and &quot;Perfect&quot; appears on in the PC/Mac video game Guitar Praise. According to Rolling Stone Magazine, the band along with Paramore, are the 2008 breakout bands.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:4fbb812b412fb442a2255c01d8100f8c4cda6413","amp;dn":"Flyleaf+-+I%5C%27m+So+Sick++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4fbb812b412fb442a2255c01d8100f8c4cda6413","infoHashBuffer":{"type":"Buffer","data":[79,187,129,43,65,47,180,66,162,37,92,1,216,16,15,140,76,218,100,19]},"announce":[],"urlList":[]}}