{"title":"Legend Of Atlantis - Complete Doco Series","uid":5281685,"size":3691112872,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:51b6481e3b60ba92d4d9dd556f5ffc279e5bf749&amp;dn=Legend+Of+Atlantis+-+Complete+Doco+Series&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zippin","files":10,"time":1263572106,"description":"Dawn of the Gods (Part I)\nThe legend narrates: Thousands of years ago the gods came down to Earth from the stars to initiate a genesis. Human civilization was formed and reached a peak with Atlantis. A dark age began and the battle of Atlantean gods led to its fall. A secret brotherhood brought Atlantean secret teachings before the fall to Egypt. Through all civilizations and with inspiration from extraterrestrian guards the secret Atlantean brotherhood managed all political systems with an educational mission. The thrilling documentation shows for the first time the secret activities of a brotherhood in relations with invisible masters from Shambhala and Agharta and the secret about the hollow earth.\n\nThe Secret Brotherhood of Atlantis (Part II)\nFollowing the catastrophe in Atlantis all nations were dispersed. A part of the Atlantean brotherhood's secret knowledge survived in Egypt, in India and in Tibet.\nThe heirs of these secret brotherhoods led mankind during the dark age... throug Atlantean knowledge and through all ages. In modern times the Freemasons, Templers and Illuminati brotherhoods were formed. After World War I the Neutemplerorden and Thulesociety emerged in Munich and Vienna. New occult sects which saw 'satan' in the old Freemason lodges. With Hitler these occult sects came to power. This thrilling documentation shows for the first time the background of the Third Reich and its intellect which led to the catastrophy of World War II...\n\nThe Secret Prophecies of the Apocalypse (Part III)\nAtlantean secret knowlege tells us the legend of mankind and those souls, who have to undergo cycles. With the fall of Atlantis a gigh civilization cycle had ended.\nAll prophecies and more recent Earth changes point out that today's mankind has reached the end of the next experience cycle. Up to the year 2011 the most serious Earth and climate changes, earthquakes, social and political changes have been predicted. This thrilling documentation shows the prophecies of ELIA, the returned prophet and his message on the last days, Christ's return and the space Brotherhood.\n\nThe Return of the Atlantean Light Masters (Part IV)\nMilleniums have passed... since the high culture of Atlantis sank with a catastrophy through power abuse of some corrupt scientists. All humans of that time, who also experienced the descent into the dark age, are being reincarnated today. The thrilling documentation shows the return of the Atlantean light children and allows deep insight into the role of the light workers and brotherhoods of Atlantis. It shows why some souls reincarnate today and act as enviromental protectionists, therapists, artists, esoterics etc. for the healing of the earth. Addresses also the Space Brotherhood events - 11:11, the hollow earth, Shambhala and Agharta.\n\nThe Battle of Armageddon (Finding the Truth) (Part V)\nFor milleniums the secrets of creation were exclusively limited to an elite of secret societies. Now we have entered the so-called Last Days where these secret societies like the Freemasons and the secret political lodges lose their power. This exciting video documentation will reveal the Atlantean secret knowledge on the hollow world and their extraterrestrian civilizations. The secret of the pyramids, the Sphinx, world-wide underground tunnel systems, flight movement of the Nazis to the South Pole and much more allow the viewer to obtain an overview over the final secrets of the past and its connection with extraterrestrians.\n\n  ____                      _                      _   _       _\n / ___|___  _ __  ___ _ __ (_)_ __ __ _  ___ _   _| | | |_   _| |__\n| |   / _ \\| '_ \\/ __| '_ \\| | '__/ _` |/ __| | | | |_| | | | | '_ \\\n| |__| (_) | | | \\__ \\ |_) | | | | (_| | (__| |_| |  _  | |_| | |_) |\n \\____\\___/|_| |_|___/ .__/|_|_|  \\__,_|\\___|\\__, |_| |_|\\__,_|_.__/\n                     |_|                     |___/\n   ____\n  / ___|___  _ __ ___\n | |   / _ \\| '_ ` _ \\\n | |__| (_) | | | | | |\n(_)____\\___/|_| |_| |_|\n\n\nPLEASE KEEP SEEDED TO PASS ON THE MESSAGE.  PLEASE VISIT OUR SITE AND SHARE THE WORD!\nDOWNLOAD MAYBE SLOW BUT SURE! PLEASE ASSIST IN BANDWIDTH!\n\n* Don't Be Fooled Any Longer on Darwinism, Evolution, Global Warming Lies, Internationalism, etc.\n* Get The Message Out, Openly!\n","torrent":{"xt":"urn:btih:51b6481e3b60ba92d4d9dd556f5ffc279e5bf749","amp;dn":"Legend+Of+Atlantis+-+Complete+Doco+Series","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51b6481e3b60ba92d4d9dd556f5ffc279e5bf749","infoHashBuffer":{"type":"Buffer","data":[81,182,72,30,59,96,186,146,212,217,221,85,111,95,252,39,158,91,247,73]},"announce":[],"urlList":[]}}