{"title":"Stargate SG-1 S01 D5 Pal 2lions-Team","uid":5309061,"size":4681367003,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:52854c5715c25fbb27c4fe378e16cb608366707b&amp;dn=Stargate+SG-1+S01+D5+Pal+2lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"wietseherman","files":-1,"time":1264501831,"description":"\n\nStargate SG-1 S01 D5 pal 2Lions-Team\n\nNL informatie\n\nSingularity  - Een Naquadahbom is door de Goa'uld Nirrti  geÃƒÂ¯mplanteerd in jong meisje.\n\nCor-Ai - Teal'c wordt beschuldigd van oorlogsmisdaden, begaan in de tijd dat hij nog First Prime van Apophis was.\n\nEnigma - SG-1 redt een groep Tollan van hun verwoeste planeet. De NID wil misbruik maken van de Tollan, een technisch geavanceerd ras, maar Daniel Jackson steekt er een stokje voor.\n\nEnglisch Information\n\nSolitudes  - Sam en Jack ontdekken een tweede Stargate in Antarctica.\n\nSingularity  - On the planet Hanka (P8X-987), SG-1 rescues a small girl who turns out to have had an inoperable Naqahdah bomb put in her by Nirrti to destroy the SGC. Ultimately the girl is given to the care of Dr. Janet Fraiser, the SGC medic, after they discover that the bomb will dissolve if she is kept away from the Stargate. \n\nCor-Ai - The Byrsa, human inhabitants of the planet Cartago (P3X-1279) that was once enslaved, condemn Teal'c for the atrocities he once committed under Apophis. He is sentenced to death, but when the Goa'uld attack, Teal'c saves his accuser's life and proves he is a changed man.\n\nEnigma - SG-1 rescues a group of highly advanced Tollan from their homeworld, P3X-7763. The military and the NID take an interest in their technology, and attempt to imprison them for research purposes before Daniel helps them take refuge with the Nox.\n\n\nSolitudes  - Carter and O'Neill are stranded on an icy planet when the Stargate malfunctions on their return journey to Earth. However, it turns out that they have merely been redirected to a second Stargate in Antarctica.\n\nSource : retail\nFormat : DVD5\nVideo : Pal\nSound : DD 5.1\nLanguages : EN FR\nMenu : Yes\nExtra : No\nSubs : FR NL EN\n\n\nBrought to you by\nBack to Basic\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum\n &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl/index.php&lt;/a&gt;\n\n2Lions-Team for all your Dutch MOVIES and more\n\n*****************************************************\n\nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden.\n\nDon`t quit after you finished the download, but keep seeding.\n\n*****************************************************\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n\n*****************************************************\n","torrent":{"xt":"urn:btih:52854c5715c25fbb27c4fe378e16cb608366707b","amp;dn":"Stargate+SG-1+S01+D5+Pal+2lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52854c5715c25fbb27c4fe378e16cb608366707b","infoHashBuffer":{"type":"Buffer","data":[82,133,76,87,21,194,95,187,39,196,254,55,142,22,203,96,131,102,112,123]},"announce":[],"urlList":[]}}