{"title":"The Last Castle [action-drama][Eng, Fre, Germ 5.1 audio][Eng, Fr","uid":5332514,"size":4681054208,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:52cd6d96af0bcae75bd3d27ab9153a8fbc828590&amp;dn=The+Last+Castle+%5Baction-drama%5D%5BEng%2C+Fre%2C+Germ+5.1+audio%5D%5BEng%2C+Fr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rocking_cat","files":-1,"time":1265216017,"description":"THE LAST CASTLE\n\nGenre......: Action, drama\n\nRuntime....: 125 min\n\nAudio......: AC3 5.1-ch English\n             AC3 2-ch English\n             AC3 5.1-ch French\n             AC3 5.1-ch German\n             AC3 2-ch English (director's comment)\n\nSubs.......: English\n             English(director's comment)\n             French\n             French(director's comment)\n             German\n             German(director's comment)\n             Dutch\n             Dutch(director's comment)\n             Hebrew\n             Bulgarian\n             Arabic\n\nMenu.......: Yes\n\nExtras.....: Yes\n\nInfo.......: http://www.imdb.com/title/tt0272020/\n\n\nThe Last Castle is a 2001 drama film directed by Rod Lurie, starring Robert Redford and James Gandolfini.\n\nThe film portrays a struggle between inmates and the warden of a military prison. Eugene Irwin, a highly decorated U.S. Army General sentenced for insubordination, challenges the warden, Colonel Winter, over his treatment of the prisoners. After mobilizing the inmates, Irwin leads an uprising aiming to seize control of the prison and remove Winter from command.\n\nThe film was released on October 19, 2001, in the United States, grossing about $28 million worldwide. The low gross of the film in comparison to its high production and marketing expenses led some to call it a box office bomb.[2][2]\n\nThe Last Castle won the Taurus World Stunt Award for best fire stunt and was nominated for best aerial work and best stunt coordination sequence.[3] Clifton Collins, Jr. was nominated for an ALMA Award in the &quot;Outstanding Supporting Actor in a Motion Picture&quot; category.\n\n\nPlot:\nLieutenant General Eugene Irwin (Robert Redford) is brought to a maximum security military prison to begin a ten-year incarceration for his decision (in violation of a presidential order) to send U.S. troops to Burundi, Africa, resulting in the death of eight soldiers. Colonel Winter, the prison's warden, is a great admirer of the General's but is offended by a comment by Irwin that he overhears. He quickly resents what he perceives as Irwin's attempt to change the attitude of the prisoners. On one occasion, Irwin is punished harshly after stopping a guard from clubbing a prisoner, Ramon Aguilar, who had made the mistake of saluting Irwin in the prison yard. Continuing to observe acts of cruelty, Irwin attempts to unify the prisoners by building a &quot;castle wall&quot; of stone and mortar at the facility, which in many ways resembles a medieval castle. Envying the respect Irwin is clearly receiving, Winter orders his guards to destroy the wall. Aguilar, directly involved in the building of the wall, takes a stand before the bulldozer. Winter orders a sharpshooter to fire a normally non-lethal rubber bullet directly at Aguilar's head, killing him. After the wall is destroyed, Irwin and the inmates pay final respects to Aguilar in formation. Winter later tries to make amends with Irwin, but Irwin calls him a disgrace to the uniform and demands his resignation.\n\nThe prisoners begin to behave like soldiers around Irwin, using code words and gestures, infuriating the warden. Winter reaches out to an anti-social prisoner named Yates, bribing him to inform about Irwin's plans in exchange for a reduced sentence. Irwin organizes a plot to throw the prison into chaos. His intent is to show a friend, Brigadier General Wheeler (the warden's superior officer), that the warden is unfit and should be removed from command under the Uniform Code of Military Justice. During a visit by General Wheeler to the prison, Winter receives a letter threatening the kidnapping of Wheeler by the prisoners. After ordering his men into action, Winter discovers that the kidnap scheme was a fake. Irwin orchestrated it as a way to detect how prison guards would react during an actual uprising. Yates becomes the key to their plan, tasked with stealing a U.S. flag from the warden's office and seizing a Bell UH-1 helicopter used by guards.\n\nThe inmate revolt begins. Using improvised weapons (some resembling medieval ones) and the tactics of a military unit, the prisoners capture an armored vehicle and the helicopter. The prisoners place a call to Wheeler's headquarters and inform him of the riot. Winter has little time to regain control before Wheeler can arrive to see the prison under siege. He orders the use of live ammunition against the prisoners. He also knows from Yates that the ultimate goal of Irwin is to raise the American flag upside down, a classic signal of distress. Irwin's men create havoc but ultimately are outnumbered. He orders them to stand down. But with guns pointed at him from all direction, Irwin elects to personally hoist the flag. Winter orders his men to shoot. They refuse to do so on the orders of Winter's second-in-command, Captain Peretz. The colonel cannot persuade anyone else to follow his command, so he proceeds to fatally shoot Irwin himself. Peretz places the warden under arrest. The prisoners salute the flag and Winter now sees that Irwin has actually raised the U.S. flag in the correct manner. It waves above the prison's walls as Winter is led away in handcuffs. The story ends with the inmates building a new wall as memorial to their fallen comrades. Aguilar's and Irwin's names are among those carved onto the castle wall.\n\n\nCast:\nRobert Redford...... as Lt. General Eugene Irwin \nJames Gandolfini.... as Colonel Winter \nMark Ruffalo........ as Yates \nDelroy Lindo........ as General Wheeler \nSteve Burton........ as Captain Peretz \nPaul Calderon....... as Dellwo \nClifton Collins Jr.. as Aguilar \n","torrent":{"xt":"urn:btih:52cd6d96af0bcae75bd3d27ab9153a8fbc828590","amp;dn":"The+Last+Castle+%5Baction-drama%5D%5BEng%2C+Fre%2C+Germ+5.1+audio%5D%5BEng%2C+Fr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52cd6d96af0bcae75bd3d27ab9153a8fbc828590","infoHashBuffer":{"type":"Buffer","data":[82,205,109,150,175,11,202,231,91,211,210,122,185,21,58,143,188,130,133,144]},"announce":[],"urlList":[]}}