{"title":"LeAnn Rimes - Commitment  (2nafish)","uid":5345693,"size":164352004,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:537be9a523e4c31944bbab4bab5a517d454477c6&amp;dn=LeAnn+Rimes+-+Commitment++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1265628997,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Commitment&quot; is a song by LeAnn Rimes, release as the lead single from her album Sittin' on Top of the World. The song placed at #4 on the US country charts, #38 in the UK, and # 59 in Australia. It was later featured on Rimes' Greatest Hits and its international version, The Best of LeAnn Rimes.\n\nSittin' on Top of the World is the fourth album by American country singer LeAnn Rimes, released in the United States on May 5, 1998, by Curb Records. The album has been certified Platinum. It contains cover versions of &quot;Insensitive&quot; by Jann Arden, &quot;Sittin' on Top of the World&quot; by Amanda Marshall, &quot;Purple Rain&quot; by Prince, and &quot;Rock Me (In the Cradle of Love)&quot; by Deborah Allen.\n\nMargaret LeAnn Rimes, known simply as LeAnn Rimes, (born August 28, 1982) is an American singer-songwriter and actress, best known for her work in country music. She is best known for her rich vocals similar to legendary country music singer Patsy Cline, and her rise to fame at the age of 13, becoming the youngest country music star since Tanya Tucker in 1972.\n\nRimes made her breakthrough into country music in 1996. Her debut album, Blue, reached Number 1 on the Top Country Albums chart and was certified &quot;multi-platinum&quot; in sales by the Recording Industry Association of America. The album's lead single of the same name (originally intended to be recorded by Patsy Cline in the early 1960s) became a Top 10 hit. With immediate success, Rimes attained widespread national acclaim for her similarities to Cline's vocal style. When Rimes released her sophomore studio effort in 1997, You Light up My Life: Inspirational Songs, Rimes went more towards country pop material, which would set the trend for a string of albums that would be released into the next decade. LeAnn Rimes is the youngest person to win a Grammy, and the first country singer to win the Grammy Award for Best New Artist.\n\nSince her debut, Rimes has won many major industry awards, which include two Grammys, three ACMs, one CMA, twelve Billboard Music Awards, and one American Music award. In addition, Rimes has also released ten studio albums and four compilation albums through her record label of 13 years, Asylum-Curb, and placed over 40 singles on American and international charts since 1996. She has sold over 50 million albums worldwide.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:537be9a523e4c31944bbab4bab5a517d454477c6","amp;dn":"LeAnn+Rimes+-+Commitment++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"537be9a523e4c31944bbab4bab5a517d454477c6","infoHashBuffer":{"type":"Buffer","data":[83,123,233,165,35,228,195,25,68,187,171,75,171,90,81,125,69,68,119,198]},"announce":[],"urlList":[]}}