{"title":"003- Coast to Coast-Ian Punnett-Andrew Zimmern 14 Feb 10","uid":5364589,"size":123762892,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:53964ce8ac05249299a86b42a133af4e33580469&amp;dn=003-+Coast+to+Coast-Ian+Punnett-Andrew+Zimmern+14+Feb+10&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"panzerfaust69","files":1,"time":1266225237,"description":"Bizarre Foods &amp; Body Language\n\nDate:\n\t\n02-13-10\n\nHost:\n\t\nIan Punnett\n\nGuests:\n\t\nAndrew Zimmern, Greg Hartley\n\nIn the first half of the program, Ian Punnett welcomed Andrew Zimmern, gastronomic adventurer and star of the Travel Channel's Bizarre Foods, for a whirlwind tour of the world's strangest foods and exotic places. While the allure of his program is showcasing off-beat meals, he observed that the story behind the meals is really as fascinating as the food themselves. To that end, he stressed the importance of treating the cultures he visits with respect rather than mocking their customs. &quot;You begin to get to know the people and hear the stories,&quot; Zimmern marveled, &quot;and it moves you in an incredible way.&quot;\n\nZimmern reflected on his experiences dining on a wide variety of strange foods, found in locations far and near, and offered descriptions of their flavor as well as insight into how and why they are staples of some cultures. He was nonplussed by frog ovary soup, describing it as &quot;benign&quot; and &quot;intended to be provocative.&quot; Reminiscing about a ten pound fruit bat he ate in Samoa, he noted that the creature tasted &quot;surprisingly good.&quot; He attributed that to the fact that the animals subsist solely on bread fruit and are, thus, so pure and clean that their intestines can be eaten raw. On the contrary, he was critical of possum and raccoon, which he dined on in Mississippi, calling it &quot;gamy&quot; and speculated that it is because the animals often eat dead, feral animals. The origins of this meal, he explained, came from slaves who were only able to eat discarded foods and hunted prey that &quot;froze in the lantern light.&quot;\n\nBody Language\n\nIn the latter half of the show, body language expert Greg Hartley discussed the art of interrogation and gave tips on how to spot a liar. A former interrogator in the Middle East, he shared a number of clues which indicate how truthful a person is. One such insight was that when a suspect recognizes someone, their eyebrows quickly flash upwards for a brief moment. Similarly, raising one's eyebrows up while talking and ending a statement with a lilting voice is what Hartley called a &quot;request for approval.&quot; In such an instance, if approval is given, the subject's eyebrows will immediately lower. Hartley also noted that he becomes &quot;extremely suspicious&quot; when talking to a suspect and they have a deep stare. He called these individuals &quot;glossies,&quot; as a reference to their vacant eyes.\n\nDetailing the interrogation process, Hartley noted that a tremendous amount of insight is gleaned prior to event speaking with the subject. Such information gathering includes in-depth analysis of their intake paperwork, tacit observation of the suspect to see how they interact with other inmates, and then speaking with the guards, who see them on a frequent basis. From there, Hartley said, the interrogation begins with a benign &quot;control question,&quot; answered truthfully, which allows the questioner to have a &quot;base line&quot; to compare future responses against. He dispelled the notion that interrogations are heated affairs, as they are often portrayed in the media, instead calling them &quot;conversations that seem friendly&quot; that yield results based on &quot;high psychological pressure.&quot;\nWebsite(s):\n# andrewzimmern.com\n# travelchannel.com/TV_Shows/Bizarre_Foods\n# mindatwar.com\nBook(s):\n# The Body Language Handbook\n# How to Spot a Liar\n# The Bizarre Truth: How I Walked out the Door Mouth First and Came Back Shaking My Head\n","torrent":{"xt":"urn:btih:53964ce8ac05249299a86b42a133af4e33580469","amp;dn":"003-+Coast+to+Coast-Ian+Punnett-Andrew+Zimmern+14+Feb+10","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53964ce8ac05249299a86b42a133af4e33580469","infoHashBuffer":{"type":"Buffer","data":[83,150,76,232,172,5,36,146,153,168,107,66,161,51,175,78,51,88,4,105]},"announce":[],"urlList":[]}}