{"title":"Metallica.French.For.One.Night.(2009)","uid":5220175,"size":7872208896,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:53ac43b336245c91a88b6c5345796e1713b6c45c&amp;dn=Metallica.French.For.One.Night.%282009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"relim1","files":22,"time":1260901657,"description":"Audio: English - Dolby 5.1    DTS 5.1\n\n\n\nmedenka1978\n\n\n\n\n\n\nMetallica /mÃ‰â„¢Ã‹Ë†tÃƒÂ¦lÃ‰Â¨kÃ‰â„¢/ is an American heavy metal band from Los Angeles, California, formed in 1981. Founded when drummer Lars Ulrich posted an advertisement in a local newspaper, Metallica's line-up has primarily consisted of Ulrich, rhythm guitarist and vocalist James Hetfield and lead guitarist Kirk Hammett, while going through a number of bassists. Currently, the spot is held by Robert Trujillo.\n\nMetallica's early releases included fast tempos, instrumentals, and aggressive musicianship that placed them as one of the &quot;big four&quot; of the thrash metal subgenre alongside Slayer, Megadeth, and Anthrax during the genre's development into a popular style.[1] The band earned a growing fan base in the underground music community and critical acclaim, with the 1986 release Master of Puppets described as one of the most influential and &quot;heavy&quot; thrash metal albums. The band achieved substantial commercial success with Metallica (1991), which debuted at number one on the Billboard 200. With this release the band expanded its musical direction resulting in an album that appealed to a more mainstream audience.\n\nIn 2000, Metallica was among several artists who filed a lawsuit against Napster for sharing the band's copyright-protected material for free without the band members' consent.[2] A settlement was reached, and Napster became a pay-to-use service. Despite reaching number one on the Billboard 200, the release of St. Anger alienated many fans with the exclusion of guitar solos and the &quot;steel-sounding&quot; snare drum. A film titled Some Kind of Monster documented the recording process of St. Anger.\n\n\nBackground information\nOrigin \tLos Angeles, California, United States\nGenres \tHeavy metal, thrash metal, hard rock, speed metal\nYears active \tSince 1981\nLabels \tWarner Bros., Elektra, Vertigo, Megaforce, Sony (Japan)\nAssociated acts \tMegadeth, Echobrain, Spastik Children, Leather Charm, Exodus\nWebsite \twww.metallica.com\nMembers\nJames Hetfield\nLars Ulrich\nKirk Hammett\nRobert Trujillo\nFormer members\nRon McGovney\nDave Mustaine\nCliff Burton\nJason Newsted","torrent":{"xt":"urn:btih:53ac43b336245c91a88b6c5345796e1713b6c45c","amp;dn":"Metallica.French.For.One.Night.%282009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53ac43b336245c91a88b6c5345796e1713b6c45c","infoHashBuffer":{"type":"Buffer","data":[83,172,67,179,54,36,92,145,168,139,108,83,69,121,110,23,19,182,196,92]},"announce":[],"urlList":[]}}