{"title":"Ashampoo Music Studio 3.51(soft)","uid":5362102,"size":27424003,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:53b223143fd0067faeb5e7f687f8ce21eec5eb35&amp;dn=Ashampoo+Music+Studio+3.51%28soft%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zurera","files":2,"time":1266142980,"description":"26.1 MB | Windows 2000/XP/Vista/7 | \n\nPara extraer, editar, convertir y grabar tus archivos de audio preferidos dispones de una soluciÃƒÂ³n completa como Ashampoo Music Studio, que convierte tu PC en un sencillo estudio de sonido con el que gestionar toda tu colecciÃƒÂ³n musical.\n\n\nLas principales funcionalidades de Ashampoo Music Studio son:\n\n    * ExtracciÃƒÂ³n de las pistas de cualquier CD de audio.\n    * GrabaciÃƒÂ³n de los archivos de audio en diferentes formatos: CD, DVD o Blu-ray.\n    * AdministraciÃƒÂ³n de los datos de tu colecciÃƒÂ³n musical: nombre, localizaciÃƒÂ³n y etiquetado a partir de la informaciÃƒÂ³n obtenida desde una base de datos online.\n    * InclusiÃƒÂ³n de herramientas bÃƒÂ¡sicas de ediciÃƒÂ³n y conversiÃƒÂ³n de archivos.\n    * GrabaciÃƒÂ³n de audio desde micrÃƒÂ³fono, entrada de lÃƒÂ­nea y otras entradas de sonido.\n    * Posibilidad de importar listas de reproducciÃƒÂ³n en diferentes formatos: M3U, PLS, ASX, P4U y WPL.\n    * EdiciÃƒÂ³n de carÃƒÂ¡tulas, ya se trate de etiquetas o cajas.\n\n\nAdemÃƒÂ¡s, Ashampoo Music Studio se adapta a cualquier tipo de usuario, principiante o avanzado, ya que cuenta con dos modos de uso:\n\n    * Normal. Se trata de un modo adecuado para usuarios que posean pocos conocimientos acerca de los formatos de audio y la codificaciÃƒÂ³n, ya que ofrece explicaciones para aprender a utilizar todas las opciones.\n    * Experto. Proporciona una manera de trabajar mÃƒÂ¡s compacta y rÃƒÂ¡pida, con sÃƒÂ³lo breves explicaciones y menos ventanas.\n\n\nEn cualquier momento es posible intercambiar entre alguna de estas modalidades desde el menÃƒÂº &quot;ParÃƒÂ¡metros&quot;.\n\nRequisitos e informaciÃƒÂ³n adicional: Algunas de las funciones requieren disponer de conexiÃƒÂ³n a Internet.","torrent":{"xt":"urn:btih:53b223143fd0067faeb5e7f687f8ce21eec5eb35","amp;dn":"Ashampoo+Music+Studio+3.51%28soft%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53b223143fd0067faeb5e7f687f8ce21eec5eb35","infoHashBuffer":{"type":"Buffer","data":[83,178,35,20,63,208,6,127,174,181,231,246,135,248,206,33,238,197,235,53]},"announce":[],"urlList":[]}}