{"title":"The Pussycat Dolls feat. will.i.am - Beep  (2nafish)","uid":5319766,"size":179488772,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:54050cf7eaecc56b79000e8c9106dff331db0d3c&amp;dn=The+Pussycat+Dolls+feat.+will.i.am+-+Beep++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1264828791,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Beep&quot; is the third single released by American recording group the Pussycat Dolls' from their debut album PCD. &quot;Beep&quot; was a moderate success worldwide, having scored within the top twenty on the majority of the charts on which it was rated. &quot;Beep&quot; became the group's third Billboard top twenty success, having reached a maximum position of #13 on the Billboard Hot 100 and #2 in the UK Singles Chart.\n\nThe video (directed by Benny Boom) starts with Scherzinger meeting Will.i.am in an elevator. Will.i.am explains his attraction to which Scherzinger replies by implying she doesn't care about him looking at her. She then enters the Dolls apartment, and, concluding the chorus, they begin a dance routine throughout the second verse. Will.i.am then enters the room, but quickly exits as Bachar throws a bottle of water at him. The Dolls are then seen at a nightclub and a dance break ensues. They are then seen in solo dance spots in front of a large set of speakers. Scherzinger, Bachar and Thornton are seen with Will.i.am, as the video comes to a close.\n\n&quot;Beep&quot; had initially been set for release as the second single after &quot;Don't Cha&quot;. However, the single was delayed due to the fact that the Black Eyed Peas had just released their single &quot;My Humps&quot;. Management felt both songs carried a somewhat similar message, and since &quot;Beep&quot; features vocals from will.i.am from the Black Eyed Peas, they felt best to delay the single (&quot;Stickwitu&quot; was released in its place). However, promotional vinyl records were sent to nightclubs. &quot;Beep&quot; received very little play in nightclubs, therefore never scoring when it was originally released.\n\nThis is first single by the Pussycat Dolls that features two other singers with solo parts. Carmit Bachar and Melody Thornton sing a verse of the bridge towards the end of the song. After the departure of Carmit and during live versions, her verse are covered by Jessica Sutta, Kimberly Wyatt &amp; Ashley Roberts, who each sang a portion of Carmit's verse. Its main riff is sampled from Electric Light Orchestra's &quot;Evil Woman&quot; written by Jeff Lynne.\n\nCo-writer Kara DioGuardi also co-wrote the track &quot;Two Way,&quot; recorded by Nicole Scherzinger's previous group Eden's Crush, plus the PCD tracks &quot;I Don't Need a Man&quot; and &quot;Flirt.&quot;\n\nBeep was referenced in the 2007 movie Epic Movie. There are bikini-clad women singing in the similar style of PCD with a tune that sounds similar to &quot;Beep&quot;.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:54050cf7eaecc56b79000e8c9106dff331db0d3c","amp;dn":"The+Pussycat+Dolls+feat.+will.i.am+-+Beep++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54050cf7eaecc56b79000e8c9106dff331db0d3c","infoHashBuffer":{"type":"Buffer","data":[84,5,12,247,234,236,197,107,121,0,14,140,145,6,223,243,49,219,13,60]},"announce":[],"urlList":[]}}