{"title":"BBC Wonders of the Solar System - S01E02 XviD.avi","uid":5435712,"size":490008576,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:541e78485c75e8098744d8cecd8577e651c92824&amp;dn=BBC+Wonders+of+the+Solar+System+-+S01E02+XviD.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"911mot","files":-1,"time":1268759495,"description":"Wonders of the Solar System\nBBC2 - 14 March 2010\n\n2/5 - Order out of Chaos\n\nProfessor Brian Cox visits some of the most stunning locations on earth to describe how the laws of nature have carved natural wonders across the solar system.\n\nBrian reveals how beauty and order in Earth's cosmic backyard was formed from nothing more than a chaotic cloud of gas. Chasing tornados in Oklahoma, he explains how the same physics that creates these spinning storms shaped the young solar system. Out of this celestial maelstrom emerged the jewel in the crown, Brian's second wonder - the magnficent rings of Saturn.\n\nOn an ice-choked lagoon in Iceland, he sees the nearest thing on Earth to Saturn's rings. Using the latest scientific imagery and breathtaking graphics, he explains how the intricate patterns round Saturn are shaped by the cluster of more than 60 moons surrounding the planet.\n\nOne of those moons makes a spectacular contribution to the rings and is the third wonder of the solar system. Brian describes the astonishing discovery of giant fountains of ice erupting from the surface of Enceladus, which soar thousands of kilometres into space.","torrent":{"xt":"urn:btih:541e78485c75e8098744d8cecd8577e651c92824","amp;dn":"BBC+Wonders+of+the+Solar+System+-+S01E02+XviD.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"541e78485c75e8098744d8cecd8577e651c92824","infoHashBuffer":{"type":"Buffer","data":[84,30,120,72,92,117,232,9,135,68,216,206,205,133,119,230,81,201,40,36]},"announce":[],"urlList":[]}}