{"title":"Trixter - One In A Million  (2nafish)","uid":5401422,"size":173836292,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:549c9e6ad2b5d7e97898654708c7c4e5481abe8b&amp;dn=Trixter+-+One+In+A+Million++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1267440618,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\nTrixter is the self-titled debut album of the band Trixter. It attained gold status, reaching #28 on the Billboard 200. The album did spawn three minor hit singles, &quot;Give It to Me Good&quot; (#65), &quot;Surrender&quot; (#72), and &quot;One in a Million&quot; (#75).\n\nTrixter is an American hard rock band from Paramus, New Jersey. The band achieved moderate success in the early 1990s but disbanded for several years as glam metal lost mainstream popularity. The original members reunited in 2008 to tour and record new material.\n\nIn December 1990 Trixter filmed the video for the second single, &quot;One in a Million&quot;, at a sold-out show in Rockland County, New York. The band also recorded a song, &quot;One Mo Time&quot;, for the film If Looks Could Kill. The song featured Edgar Winter on saxophone. By January 1991 the record was selling 20,000 units per week.[citation needed] The video for &quot;One in a Million&quot; went #1 on MTV for three weeks. The album peaked at #28 on Billboard's Top 200 Album chart and the single for &quot;Give it to Me Good&quot; was a Top 50 hit on Billboard's Top 100 Singles chart.[citation needed] Trixter did their first-ever arena shows opening for Poison and then headed out on a five-month North American tour with the German rockers Scorpions. In February, the band flew to Daytona, Florida to do MTV's Spring Break and their debut album went Gold soon after. In April 1991 Trixter played their hometown Meadowlands Arena, where they were presented with gold albums at a special after-show party. In May they filmed the video for the third single, &quot;Surrender&quot;. In June 1991 Trixter started the &quot;Blood, Sweat &amp; Beers&quot; tour with Warrant and Firehouse. Around this time the popular rock magazine Metal Edge dedicated an entire issue to the band, &quot;The Trixter Color Spectacular&quot;. The video and single for &quot;Surrender&quot; were released and once again the video went to #1 on MTV for two weeks and the single went Top 100 in Billboard.\n\nBill Wray (born Shreveport, Louisiana) is an American musician, composer and producer. His performing career spanned the mid 1970s through the early 1980s. Since then he has written and produced a variety of artists from hair metal to cajun. He is the brother of fellow musician/composer Jim Wray.\n\nBill Wray has written the songs &quot;Fool for Your Love&quot; and &quot;So Close&quot; for Diana Ross. Wray and his brother Jim wrote most of the hits (&quot;One in a Million&quot;, &quot;Surrender&quot;) on Trixter's debut album.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:549c9e6ad2b5d7e97898654708c7c4e5481abe8b","amp;dn":"Trixter+-+One+In+A+Million++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"549c9e6ad2b5d7e97898654708c7c4e5481abe8b","infoHashBuffer":{"type":"Buffer","data":[84,156,158,106,210,181,215,233,120,152,101,71,8,199,196,229,72,26,190,139]},"announce":[],"urlList":[]}}