{"title":"Vol 04 Mirko.Crocop.Pride.FC.The.Best.Fighters","uid":5355873,"size":1468186624,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:565a7be5674260600870d476f8493d979dd96fec&amp;dn=Vol+04+Mirko.Crocop.Pride.FC.The.Best.Fighters&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"carribeanPirate","files":-1,"time":1265938618,"description":"It's hard to define Mirko &quot;Cro Cop&quot; Filipovic's place in the history of mixed martial arts.\n\nHis proponents will point out that the Croatian striker was the only top-level kickboxer to successfully make the transition from K-1 to MMA. They will list his Pride Open-Weight Grand Prix title and remind you that Cro Cop was the top gaijin fighter in Japan in 2005 and 2006.\n\n\nMirko Filipovic bloodied Wanderlei Silva with precision strikes and eventually scored a knockout.\nDespite the Grand Prix victory, Cro Cop still carries the stigma of being the sport's eternal runner-up. At no point was Filipovic considered the undisputed No. 1 fighter in his weight class. And after losses to Antonio Rodrigo Nogueira and Fedor Emelianenko, he was saddled with the status of third-best heavyweight of his generation. Naysayers also will object that Cro Cop benefited from many inexperienced opponents during his stint in Japan.\n\nStill, no one can take away the fact that Filipovic gave Japanese fight fans an unbelievable amount of exciting and emotional moments. On the cusp of his fight against Mustapha al Turk on Saturday at UFC 99 in Cologne, Germany, Sherdog.com has compiled a list of Cro Cop's three best moments and three worst moments during his nine-year MMA career.","torrent":{"xt":"urn:btih:565a7be5674260600870d476f8493d979dd96fec","amp;dn":"Vol+04+Mirko.Crocop.Pride.FC.The.Best.Fighters","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"565a7be5674260600870d476f8493d979dd96fec","infoHashBuffer":{"type":"Buffer","data":[86,90,123,229,103,66,96,96,8,112,212,118,248,73,61,151,157,217,111,236]},"announce":[],"urlList":[]}}