{"title":"Brooklyns Finest xvid avi dvdrip i.got.it.24.7","uid":5431477,"size":841281536,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:565edffff924c5209525edc575d5714c5c443a54&amp;dn=Brooklyns+Finest+xvid+avi+dvdrip+i.got.it.24.7&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"i.got.it.24.7","files":-1,"time":1268435249,"description":"GOOD MOVIE ENJOY..................................................................\n\nPLEASE'' SEED''...................................................................\n\n\nMost studios have decided to give Alice a wide berth, assuming that it would be futile to challenge it this weekend. The sole exception is Overture Films' cop drama Brooklyn's Finest, directed by Antoine Fuqua and starring Richard Gere, Don Cheadle, Ethan Hawke and Wesley Snipes, which is opening in fewer than 2,000 theaters. &quot;These are fine actors,&quot; Roger Ebert writes about the stars, who play cops acting outside the law. &quot;The milieu involves a tough, poker-playing, substance-abusing, hard-bitten world where the law meets crime, and the two sides have more in common with each other than with civilians.&quot; But he is turned off by &quot;the level of the violence and killing&quot; in which &quot;the gun becomes the instrument of merciless self-will.&quot; John Anderson in the Washington Post says that ticket buyers are likely to be put off by &quot;what is not just a relentlessly violent but [a] relentlessly grim drama.&quot; Linda Barnard in the Toronto Star observes: &quot;Violent and almost cartoonish in its use of blood, Brooklyn's Finest underwent some editing since its premiere at Sundance a year ago, most notably a change to the ending. What's missing is a sense of purpose and a satisfying story.&quot; On the other hand, Joe Neumaier in the New York Daily News comments that the film &quot;has an unexpectedly epic emotional sweep and a trio of great performances to anchor it.&quot; A.O. Scott in the New York Times also praises the performances. &quot;Particular scenes are not always entirely credible,&quot; he writes &quot;but the sheer charismatic force of much of the acting keeps you in the movie.&quot; Likewise Steven Rea in the Philadelphia Inquirer remarks that the three stars &quot;are all very good, even if the guys they're playing are, if not bad, then tragically corrupt, or","torrent":{"xt":"urn:btih:565edffff924c5209525edc575d5714c5c443a54","amp;dn":"Brooklyns+Finest+xvid+avi+dvdrip+i.got.it.24.7","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"565edffff924c5209525edc575d5714c5c443a54","infoHashBuffer":{"type":"Buffer","data":[86,94,223,255,249,36,197,32,149,37,237,197,117,213,113,76,92,68,58,84]},"announce":[],"urlList":[]}}