{"title":"POTHS - Conspiracy Theory - Part 4 - Secret Societies","uid":5421804,"size":1306151853,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5692068c9236387f2ef0574b9281dd27e6e96749&amp;dn=POTHS+-+Conspiracy+Theory+-+Part+4+-+Secret+Societies&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"awaken888","files":803,"time":1268113204,"description":"\tPOTHS - Pointing Out The Hellish Scumbags - POTHS - Pointing Out The Hellish Scumbags - POTHS\n\nThis POTHS - Conspiracy Theory - Secret Societies Collection has 27 parts to date. There will be more as WE are in the Middle of an INFOWAR. The information we receive on TV are all lies, it is a controlled media source that has nothing GOOD for you in it's programming. We have been scientifically &quot;brain washed&quot; Every advertising campaign you see is designed to deceive you.\n\nTake this challenge. Turn off your TV for ONE week and watch your MENTAL media programming dissipate. Watch only these downloads in this series. I PROMISE, YOU WILL BE A WHOLE NEW PERSON! THEY TRUTH WILL SET YOU FREE.\n\n\nPart 4\n\nHere are the Secret Societies on a Worldly Platform. These scumbags are everywhere. The Global Banksters are the real villains. They openly praise Lucifer. If you think that American Presidents are elected by the people, you are mistaken. Republican, Democrat,it doesn't matter which one wins, they both work for the same Banksters that just stole 28 TRILLION dollars from the American People according to AP and Bloomberg. The Fed, The Wall Street, global corporations are committing TREASON AND SHOULD BE ARRESTED AND PROSECUTED FOR THEIR CRIMES ON HUMANITY AND THE CONSTITUTION OF THE UNITED STATES.\n\nSeed Long and Prosper with Blessings from Our Father\n\nMore torrrents in this series at","torrent":{"xt":"urn:btih:5692068c9236387f2ef0574b9281dd27e6e96749","amp;dn":"POTHS+-+Conspiracy+Theory+-+Part+4+-+Secret+Societies","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5692068c9236387f2ef0574b9281dd27e6e96749","infoHashBuffer":{"type":"Buffer","data":[86,146,6,140,146,54,56,127,46,240,87,75,146,129,221,39,230,233,103,73]},"announce":[],"urlList":[]}}