{"title":"[Pc Game Ita] The Movies","uid":5339430,"size":2043641856,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:575e6848a89c9a6e5fe78db9fcd44624468a36a8&amp;dn=%5BPc+Game+Ita%5D+The+Movies&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ironskies","files":-1,"time":1265419710,"description":"\n=================================\n\n-----------The Movies----------\n\n=================================\n\n\n\n*- Recensione -*\n\nIl gioco inizia nel 1920, poco prima della Grande Depressione, e mano mano che gli anni passano si sbloccheranno un numero sempre maggiore di set e costumi e tecnologie sempre piÃƒÂ¹ sofisticate. Un film inizia con la stesura della sceneggiatura, che puÃƒÂ² essere di cinque generi: Sentimentale, Fantascienza, Azione, Horror e Commedia. Una volta ottenuta la sceneggiatura, bisogna iniziare il casting: bisogna quindi scegliere il regista, gli attori principali (da un minimo di 1 a un massimo di 3), le comparse (non sono indispensabili, ma piÃƒÂ¹ sono numerose e piÃƒÂ¹, in genere, il film ÃƒÂ¨ migliore) e la troupe. Gli attori quindi inizieranno a provare il copione; tale copione ÃƒÂ¨ una serie di scene, personaggi e azioni inizialmente messa insieme dal computer, ma su cui in seguito si puÃƒÂ² intervenire personalmente fin nei minimi particolari. In base alla qualitÃƒÂ  della sceneggiatura, al talento degli attori e del regista, alle condizioni dei set, all'esperienza della troupe e alla tecnologia impiegata, il risultato sarÃƒÂ  un film che verrÃƒÂ  valutato da una a cinque stelle.\nLa disposizione degli edifici negli studi ÃƒÂ¨ molto importante, in quanto gli impiegati si muovono fisicamente da un luogo all'altro durante il lavoro: avere i vari set sparpagliati in giro causa pertanto ritardi e costi addizionali.\nUno degli elementi del gioco sono i DJ radiofonici, che accompagnano il giocatore con notizie, gag e commenti sugli avvenimenti del mondo. Ogni speaker ÃƒÂ¨ appropriato all'epoca in cui si trova, con commentatori &quot;seri e cupi&quot; durante il Maccartismo e alla Grand Theft Auto negli anni '90. I gusti degli spettatori saranno influenzati da eventi realmente accaduti, come ad esempio la Seconda Guerra Mondiale, il Maccartismo, la Guerra del Golfo: in guerra il pubblico sentirÃƒÂ  il bisogno di commedie e film capaci di distrarre, mentre il periodo di James Dean e della &quot;GioventÃƒÂ¹ Bruciata&quot; segnerÃƒÂ  il successo delle pellicole romantiche e d'azione.\nI compositori della Lionhead hanno prodotto musiche adatte a ogni genere e a ogni periodo. Nonostante ogni pezzo sia originale, ci saranno nelle situazioni appropriate echi a temi famosi, dai tradizionali pezzi al pianoforte che accompagnavano le comiche, a musiche ispirate a pietre miliari dell'industria cinematografica quali, ad esempio, quelle de Il Padrino, dei film di James Bond, Via col vento, Guerre Stellari, Batman, Salvate il soldato Ryan.\nOgni 5 anni si terranno cerimonie di premiazione stile Notte degli Oscar, durante le quali verranno assegnati premi al miglior attore, al miglior regista, agli studi cinematografici piÃƒÂ¹ prestigiosi, alla qualitÃƒÂ  cinematografica, allo studio con le star piÃƒÂ¹ felici, all'attore piÃƒÂ¹ prolifico e cosÃƒÂ¬ via. Ogni premio ricevuto, oltre ad aumentare il prestigio dello studio, garantirÃƒÂ  un bonus: ad esempio il premio alla miglior regia dÃƒÂ  il bonus &quot;Tocco di Mida&quot;, che rende i film diretti dal regista premiato migliori (ma anche altri che riducono gli stipendi dei dipendenti senza che se ne accorgano o che rendono i film sempre una novitÃƒÂ ).\n\n\n\n*- Caratteristiche -*\n\n* Genere: Simulatore\n* Numero Giocatori: 1\n* Valutato: 12+\n* Lingua: Multilingue\n* Sviluppatore: Lionhead Studios\n* Pubblicato: Activision\n\n\n\n*- Requisiti Di Sistema -*\n\n* Sistema Operativo: Windows 98SE/ME/2000/XP\n* Processore: Pentium(R) III 800 MHz o Athlon(TM) 800MHz\n* Memoria: 256MB RAM\n* Spazio Libero Sul Disco: 2.4 GB\n* Directx: 9.0c compatible 16-bit\n* Scheda Video: Scheda video acceleratrice da 32 MB di memoria compatibile al 100% * con DirectX 9.0\n\n* Schede Video Supportate:\n\n* ATI(TM) Radeon(R) series (7000 or better). \n* 7000, 7200, 7500 \n* 8500 \n* 9000, 9200, 9250, 9550, 9600, 9700, 9800 \n* x300, x600, x700, x800, x850 \n\n* NVIDIA(R) GeForce(R) series (GeForce 3 or better). \n* GeForce 3, 3 Ti \n* GeForce 4, MX, Ti \n* GeForce FX 5200, 5600, 5700, 5800, 5900, PCX 5300, 5750, 5950 \n* GeForce 6200, 6600, 6800 \n\n\nBy LoNeLyAnGeL\n________________","torrent":{"xt":"urn:btih:575e6848a89c9a6e5fe78db9fcd44624468a36a8","amp;dn":"%5BPc+Game+Ita%5D+The+Movies","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"575e6848a89c9a6e5fe78db9fcd44624468a36a8","infoHashBuffer":{"type":"Buffer","data":[87,94,104,72,168,156,154,110,95,231,141,185,252,212,70,36,70,138,54,168]},"announce":[],"urlList":[]}}