{"title":"La odisea de Nefertiti..(Docu).","uid":5199734,"size":395030528,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:57f48a6731ce8796179b63e38ef2866129b6a899&amp;dn=La+odisea+de+Nefertiti..%28Docu%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cholo24","files":1,"time":1260100275,"description":"La odisea de Nefertiti\n\n'Una descripciÃƒÂ³n no le hace justicia. Hay que contemplarla''. AsÃƒÂ­ zanjÃƒÂ³ Ludwig Borchardt los comentarios sobre el descubrimiento que acababa de hacer bajo la arena de lo que un dÃƒÂ­a fue la ciudad de Amarna. Era el 6 de diciembre de 1912 y el arqueÃƒÂ³logo alemÃƒÂ¡n habÃƒÂ­a realizado el hallazgo del siglo: el busto policromado de Nefertiti, la enigmÃƒÂ¡tica y bella esposa del faraÃƒÂ³n AkenatÃƒÂ³n, devuelto a la luz tras pasar 3.500 aÃƒÂ±os enterrada en las ruinas de la que fuera la capital del perÃƒÂ­odo mÃƒÂ¡s fascinante y desconocido de la historia de Egipto.\n\nPero Nefertiti todavÃƒÂ­a no habÃƒÂ­a terminado su andadura. Es mÃƒÂ¡s, en ese momento comenzaron una serie de avatares que concluyeron con la instalaciÃƒÂ³n de la reina en BerlÃƒÂ­n, una decisiÃƒÂ³n no exenta de polÃƒÂ©mica que todavÃƒÂ­a es objeto de controversia entre los gobiernos egipcio y alemÃƒÂ¡n.\n\nEl descubrimiento y la andadura posterior del busto son los protagonistas de 'La odisea de Nefertiti'. Se trata de un documento pormenorizado que no sÃƒÂ³lo recrea el momento del hallazgo, sino la peripecia posterior que incluye su traslado a Alemania y cÃƒÂ³mo fue escondida por los nazis durante la II Guerra Mundial.\n\n'La odisea de Nefertiti' incluye ademÃƒÂ¡s imÃƒÂ¡genes exclusivas de la ÃƒÂºltima investigaciÃƒÂ³n sobre el busto: el anÃƒÂ¡lisis efectuado en BerlÃƒÂ­n con un escÃƒÂ¡ner de rayos X, que ha revelado la existencia de un segundo busto, realizado en piedra caliza y con los rasgos de una mujer de mayor edad, oculto bajo el bello rostro policromado que todos conocemos. Ã‚Â¿QuÃƒÂ© significa este nuevo hallazgo? Ã‚Â¿Era ÃƒÂ©ste el verdadero rostro de la reina del Nilo?\n","torrent":{"xt":"urn:btih:57f48a6731ce8796179b63e38ef2866129b6a899","amp;dn":"La+odisea+de+Nefertiti..%28Docu%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57f48a6731ce8796179b63e38ef2866129b6a899","infoHashBuffer":{"type":"Buffer","data":[87,244,138,103,49,206,135,150,23,155,99,227,142,242,134,97,41,182,168,153]},"announce":[],"urlList":[]}}