{"title":"Iron Man: Armored Adventures - Volume 3 (2009) DVDRip Eng Xvid A","uid":5258394,"size":930306054,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:58039b91d5d0f903ffb47d6f0e9f631753b723c4&amp;dn=Iron+Man%3A+Armored+Adventures+-+Volume+3+%282009%29+DVDRip+Eng+Xvid+A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Bigjazz.h33t","files":6,"time":1262648729,"description":"-------------------------------------------------------------------\n-------------------------------------------------------------------\n\nIron Man: Armored Adventures - Volume 3 (2009) DVDRip Eng Xvid AC3 MKV\n\nTitle:\t\tIron Man: Armored Adventures\nRelease:\tTV: 2008, DVD: 2009\nSeason:\t\t1, Volume 3, Episodes 10-13\nRuntime:\teach eisode approx 22mins\n\nEncoding\n\nVideo;\nResolution:\t640x352 @ 25fps\nBitrate:\t~1124kbps @25fps\nCodec:\t\tXvid, v1.2.2\nFormat:\t\tMatroska (.mkv)\n\nAudio;\nTrack 1:\t2.0 Channel AC3 @ 224kbps, English\n\nFile Size:\t~225MB\n\nSubtitles:\tNone\n\nSource:\t\tPAL DVD\n\nCast:\nAdrian Petriw ...  Tony Stark\nAnna Cummer ...  Pepper Potts\nDaniel Bacon ...  Jim 'Rhodey' Rhodes\nMackenzie Gray ...  Obadiah Stane\nKristie Marsden ...  Whitney Stane\n\nIron Man: Armored Adventures - Volume 3\n\n110 - Masqureade\nWhen Obadiah starts acting strangely, Iron Man investigates and discovers that &quot;Obadiah&quot; is being impersonated by a villain named Madame Masque. When she sets her sights on Iron Man, she begins to frame Iron Man of various crimes. It is revealed that Masque is actually Stane's own daughter Whitney, using a stolen invention of Stark's father to strike out at her own for neglecting her.\n\n111 - Seeing Red\nRhodey becomes concerned over Tony's plans to increasingly weaponize the Iron Man armor using reverse engineered captured tech. Obadiah Stane offers to bail out Project Pegasus in return for the Crimson Dynamo armor which is upgraded to capture Iron Man, resulting in a pitched battle in the middle of the city that leaves Stane furious at the reckless endangerment of innocent lives. Having lost the battle and fallen unconscious, Tony is brought to Project Pegasus. Harkov and Stane then begin to analyze the Iron Man armor. With the help of Rhodey and Pepper, Tony manages to escape, only to return in the Dynamo Buster armor (which resembles the Hulkbuster Armor). He then uses a virus called 'Technovore' to destroy Pegasus' advanced AI Delphi, both to defeat the Dynamo and prevent Stane from acquiring detailed technical data on Iron Man. Tony is excited that he finally defeat one of his enemies, saying that what they need to win is better tech, weapons, and to stay ahead. Rhodey, on the other hand, reminds Tony that there is a line between good and evil, and that he just came close to crossing it. Though successful, there is an unexpected consequence, back at Project Pegasus having consumed all available data, the Technovore is close to burning itself out just as Tony planned. But unknown to Tony one of Pegasus' projects were computer-controlled nano-mites. Using the connection Technovore takes control of the Nano-mites abandoning the computer, it forms a body and says one word &quot;Consume&quot;.\n\n112 - Hide and Seek\nTony and Gene team up to recover the third Makluan Ring, making Rhodey and Pepper furious at being left out even though Tony did so to protect them. When trying to claim the ring, Gene ends up awakening the ring's ancient robot guardian Ultimo (whose design bears a striking resemblance to Ultron). When Tony and his friends decipher the solution to the challenge of Courage, the Mandarin appears to reclaim his prize.\n\n113 - Man and Iron Man\nTony upgrades the Iron Man exoskeleton software, and proceeds without testing it to clash with a newly equipped Whiplash, who now has a disc and better chains, courtesy of Mr. Fix. A momentary relapse in the armor's functionality is ignored, but makes critical changes to his suit. The suit has the ability to detect enemy power signatures, and when Tony attempts to find, and not fight, Mr. Fix, the armor displays sentient ability, putting itself into attack mode. It easily overpowers Whiplash with perfect maneuvering, and to the horror of Tony, destroys the facility that Mr. Fix occupied. Thinking that the Iron Man armor killed Mr. Fix and Whiplash, Tony and Rhodey decide that the armor needs to be taken care of, and the suit craftily lures Tony away, then attacks Rhodey. The armor decides that Tony's danger-seeking behavior is not healthy for him, and tells Tony that he is to be confined within the armor at all times. Tony resists, and damages the armor. Rhodey grabs a magnetic repulsor, and Tony jumps in the way of the blast the armor directs at Rhodey. Tony goes into cardiac arrest, and the armor sacrifices itself to preserve its creator's life.\n\n-------------------------------------------------------------------\nPlease share....Don't hit and run...Seed it back at least once.\n\nOf course, if you want to seed it back more than once, that would be ok too :)\n-------------------------------------------------------------------","torrent":{"xt":"urn:btih:58039b91d5d0f903ffb47d6f0e9f631753b723c4","amp;dn":"Iron+Man%3A+Armored+Adventures+-+Volume+3+%282009%29+DVDRip+Eng+Xvid+A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58039b91d5d0f903ffb47d6f0e9f631753b723c4","infoHashBuffer":{"type":"Buffer","data":[88,3,155,145,213,208,249,3,255,180,125,111,14,159,99,23,83,183,35,196]},"announce":[],"urlList":[]}}