{"title":"Abuse (A Sunday Morning Killing Spree)   (Heavy Metal)","uid":5350768,"size":52015277,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:584c3769eed918bbd38f3d2269ce3804ff8dd0c8&amp;dn=Abuse+%28A+Sunday+Morning+Killing+Spree%29+++%28Heavy+Metal%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"slimmdiggity","files":11,"time":1265786420,"description":"Abuse - _A Sunday Morning Killing Spree_\n(Independent, 1997)\n\nby: Alain M. Gaudrault (9 out of 10)\n Another freebie I received at the Milwaukee MetalFest, I wasn't expecting a whole lot when I was handed a copy of this full-length CD. Much to my surprise, I found another slab of amazing sludgy Louisiana metal, borrowing from death, doom, and speed, both in musical and vocal approach. Production is great, clear and thick, yet muddy enough where it needs to be. The vocals are well thought out, always appropriately matched to the music, the different approaches always executed with enough conviction so as to not sound contrived; this guy can sing melodically, without over-emphasizing melody, and can scream and growl effectively and potently. Guitars feature plenty of well-executed speed and death riffs, with occasional trippy psychedelic and acoustic tidbits. While there are two guitar players, they don't stray too far off each other's lines, keeping the interplay to a minimum; the songwriting strengths, though, lie in their ability to keep the intensity and aggression level in the music high throughout by changing the mood via different tempos, styles, and textures. Complexity isn't key to their sound as much as sonic variety within the metal framework. I would say that their sound and even one of the vocal styles aren't entirely dissimilar to fellow Louisianites (is that a word?) Exhorder's, yet more involved and current, unlike Pantera who took the Exhorder sound and dumbed it down for mass consumption. Biggest disappointment for me is the lack of much of a bass presence, although drums come out loud and clear, a good thing since their frenetic nature drives this album along; always competent, well-defined, with superb fills and cymbal work, and luckily, butt-kicking double bass. I think death metal fans with a penchant for speed and/or melodic leanings will flip for Abuse; this could probably even be enjoyed by fans of muscle metal (Pantera, Machine Head, Biohazard), but it attempts to reach further than that, and in many ways, it does; I would love to see fans of that genre take to more thoughtfully written music. Unfortunately, lyrics aren't included in the packaging, but the lyrics I'm able to determine tend to be lucid, dark, and varied in subject matter; no rough and tough machismo lurking around here. Basically, this band seems to function perfectly as a unit, as they swoop and dive through the songs effortlessly, instrumentation very tight, unwavering in their sonic assault. The way in which the songs are put together, the flow of the album from passage to passage, from song to song, is rather unique and quite rewarding to the listener; thoroughly engaging material well worth recommending. Seek this out.\n\n\nListen first here  &lt;a href=&quot; http://www.bee.fm/albumtracks/39157/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.bee.fm/albumtracks/39157/&lt;/a&gt;     \n\nNo need downloading if you dont like it right?So give it a listen at that link the whole CD is there.\n","torrent":{"xt":"urn:btih:584c3769eed918bbd38f3d2269ce3804ff8dd0c8","amp;dn":"Abuse+%28A+Sunday+Morning+Killing+Spree%29+++%28Heavy+Metal%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"584c3769eed918bbd38f3d2269ce3804ff8dd0c8","infoHashBuffer":{"type":"Buffer","data":[88,76,55,105,238,217,24,187,211,143,61,34,105,206,56,4,255,141,208,200]},"announce":[],"urlList":[]}}