{"title":"Adam Lambert - Whataya Want From Me  (2nafish)","uid":5331294,"size":90619908,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:5858602dec7f3d5a90003032340a07d685ac6ee0&amp;dn=Adam+Lambert+-+Whataya+Want+From+Me++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1265183282,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\nWhataya Want From Me is the second mainstream single by American recording artist and American Idol season eight runner-up Adam Lambert. It is the second radio single release off his debut album, For Your Entertainment.\n\nThis song was written by Pink, Max Martin, and Shellback and was recorded by Pink for her fifth studio album, Funhouse, but didn't make it to the final cut. It was produced by Max Martin and Shellback, who have collaborated with Pink, NSYNC, Backstreet Boys, Britney Spears, Katy Perry, and fellow Idols Daughtry, Kelly Clarkson, Allison Iraheta and Carrie Underwood.\n\nThe music video for &quot;Whataya Want from Me&quot; was directed by Diane Martel and shot on December 20, 2009. It premired Friday 15 January on VH1. The video features Lambert alone in an apartment being harrased by a camera man. There are also performance clips throughout the video where Lambert is performing with a live band. One scene in the video features Lambert making his way through a crowd of paparazzi and fans into a car.\n\nOn November 18, 2009, Lambert announced via his official website that his second single from his debut album would be &quot;Whataya Want from Me&quot;. The song was the second single announced before the CD was officially available to the public.\n\nThe song became available as a legal download in the United States on November 20, 2009 when his CD was officially released. As of December 16, 2009, Whataya Want from Me is Adam Lambert's first single to enter the US Top 40 Radio airplay.\n\nFor Your Entertainment is the debut album from American artist and American Idol season eight runner-up, Adam Lambert. It was released on November 23, 2009.\n\nAdam Mitchel Lambert (born January 29, 1982) is an American singer, songwriter, and actor from San Diego, California. In May 2009, he finished as the runner-up on the eighth season of American Idol.\n\nLambert released his debut album, For Your Entertainment, on November 23, 2009, via RCA Records/19 Recordings. The album debuted at number 3 on the Billboard 200 on the week of December 12, 2009, selling 198,000 copies in the United States in the first week.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n\n","torrent":{"xt":"urn:btih:5858602dec7f3d5a90003032340a07d685ac6ee0","amp;dn":"Adam+Lambert+-+Whataya+Want+From+Me++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5858602dec7f3d5a90003032340a07d685ac6ee0","infoHashBuffer":{"type":"Buffer","data":[88,88,96,45,236,127,61,90,144,0,48,50,52,10,7,214,133,172,110,224]},"announce":[],"urlList":[]}}