{"title":"Nicole Kidman - One Day I'll Fly Away (Moulin Rouge) (2nafish","uid":5397203,"size":119332868,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:593b5ee1ef0a79b15b73c56a6f6dc2c1f08ef604&amp;dn=Nicole+Kidman+-+One+Day+I%5C%27ll+Fly+Away+%28Moulin+Rouge%29+%282nafish&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1267278477,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nNicole Kidman - One Day I'll Fly Away (Soundtrack: Moulin Rouge) (2nafish)\n\n\nNote: This video is a &quot;Movies &amp; Music&quot; video so it has 2 logos.\n\n\n&quot;One Day I'll Fly Away&quot; is a song with music by Joe Sample and words by Will Jennings, performed by Randy Crawford and released in 1980.\n\nThe song was covered by Nicole Kidman in the movie Moulin Rouge! The Dutch symphonic metal band After Forever covered the song on their 2003 single &quot;Exordium&quot;. Ruben Studdard released a cover of the song as a Wal-Mart-exclusive bonus track on his fourth album, Love Is.\n\nMoulin Rouge! is a 2001 romantic musical film by Baz Luhrmann. Following the Red Curtain Cinema principles, the film is based on the Orphean myth and on Giuseppe Verdi's opera La Traviata. It tells the story of a young, English poet/writer, Christian (Ewan McGregor), who falls in love with the star of the Moulin Rouge, cabaret actress and courtesan Satine (Nicole Kidman). It uses the musical setting of the Montmartre Quarter of Paris, France. The film was nominated for eight Oscars, including Best Picture, and won two: for art direction and costume design. It was the first musical nominated for best picture in 22 years. It was filmed at Fox Studios in Sydney, Australia.\n\nNicole Mary Kidman, AC (born 20 June 1967) is an American born Australian actress, fashion model, singer and humanitarian. Kidman has been a Goodwill Ambassador for UNICEF Australia since 1994. In 2006, Kidman was made a Companion of the Order of Australia, Australia's highest civilian honour. In 2006, she was the highest-paid actress in the motion picture industry.\n\nKidman's breakthrough was in the 1989 thriller Dead Calm. Her performances in films such as Days Of Thunder (1990), To Die For (1995) and Moulin Rouge! (2001) won her critical acclaim, and her performance in The Hours (2002) was acknowledged with several notable film awards including the Academy Award for Best Actress, a BAFTA Award and a Golden Globe Award. In 2003, Kidman received her star on the Walk of Fame in Hollywood, California.\n\nShe is also known for her marriage to Tom Cruise and her current marriage to country musician Keith Urban.\n\nAs a result of being born to Australian parents in Hawaii, Kidman has dual citizenship in Australia and the United States.\n\nIn 2002 Kidman received an Academy Award nomination for her performance in the 2001 musical film Moulin Rouge!, in which she played the courtesan Satine opposite Ewan McGregor. Consequently, Kidman received her second Golden Globe Award for Best Actress in a Motion Picture Musical or Comedy. The same year she also had a well-received starring role in the horror film The Others. While in Australia filming Moulin Rouge!, Kidman injured her ribs; as a result, Jodie Foster replaced her as leading actress in the film Panic Room. In that film, Kidman's voice appears on the phone as the mistress of the husband of the lead character.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:593b5ee1ef0a79b15b73c56a6f6dc2c1f08ef604","amp;dn":"Nicole+Kidman+-+One+Day+I%5C%27ll+Fly+Away+%28Moulin+Rouge%29+%282nafish","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"593b5ee1ef0a79b15b73c56a6f6dc2c1f08ef604","infoHashBuffer":{"type":"Buffer","data":[89,59,94,225,239,10,121,177,91,115,197,106,111,109,194,193,240,142,246,4]},"announce":[],"urlList":[]}}