{"title":"Charlie Chaplin - The great dictator","uid":5276247,"size":6227831052,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:59f088f154d817b944714bfc44c822dcd538ed7d&amp;dn=Charlie+Chaplin+-+The+great+dictator&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tim0611","files":2,"time":1263389211,"description":"Charlie Chaplin - the great dictator\nRelease date: 7 march 1941\nBlack and white movie\n120 min\ncomedy\nlanguage: English,French,Italian\nSubtitle: NL/FR/ENG/ITA/GER/SP\n\nTijdens de laatste dagen van de Eerste Wereldoorlog, een onhandige soldaat redt het leven van toegewijde militair piloot Schultz. Helaas, de vlucht van de oprukkende vijand eindigt in een ernstige crash met de onhandige soldaat verlies van zijn herinneringen. Na heel wat jaren in het ziekenhuis, krijgt de patiÃƒÂ«nt amnesie vrijgegeven en heropent zijn oude kapperszaak in de Joodse getto. Maar de tijden zijn veranderd in het land van Tomania: Dictator AdenoÃƒÂ¯d Hynkel, die per ongeluk lijkt sterk op de kapper, heeft zijn genadeloze greep gelegd op het land, en het joodse volk zijn gediscrimineerd. Op een dag, de kapper wordt in de problemen en is ingesteld bij een bevelvoerende officier, die blijkt te zijn zijn oude kameraad Schultz. Dus, de getto geniet bescherming van toen op. Ondertussen Dictator Hynkel grote plannen ontwikkelt, wil hij worden Dictator van de hele wereld en heeft behoefte aan een zondebok voor het publiek. Binnenkort wordt Schultz gearresteerd omdat zij te joods-vriendelijk, en alle joden, behalve degenen die geslaagd te vluchten zijn vervoerd naar concentratiekampen. Hynkel is van plan om in maart Osterlich te pronken tegen Napoloni, Dictator van bacteriÃƒÂ«n, die al ingezet zijn troepen langs de andere rand van het kleine land. Ondertussen Schultz en de barbier te ontsnappen, guised in militaire uniformen. Zoals geluk zou hebben, Schultz en de barbier worden opgepikt door Tomanian krachten en de kapper wordt vermengd met Hynkel zichzelf. De kleine kapper krijgt nu de eens-in-a-lifetime kans om te spreken met de mensen van Osterlich en alle Tomania, die gretig luisteren op de radio.\n\nplz seed this seed this classic movie.","torrent":{"xt":"urn:btih:59f088f154d817b944714bfc44c822dcd538ed7d","amp;dn":"Charlie+Chaplin+-+The+great+dictator","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59f088f154d817b944714bfc44c822dcd538ed7d","infoHashBuffer":{"type":"Buffer","data":[89,240,136,241,84,216,23,185,68,113,75,252,68,200,34,220,213,56,237,125]},"announce":[],"urlList":[]}}