{"title":"Windows Live Essentials- Instalador Offline Completo_2010","uid":5378156,"size":144323022,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5a12ef23b5dd050ed93757bfe7fc97a055118e11&amp;dn=Windows+Live+Essentials-+Instalador+Offline+Completo_2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"belk_qp007","files":-1,"time":1266645809,"description":"Windows Live is the collective brand name for a set of services and software products from Microsoft. A majority of these services are Web applications, accessible from a browser, but there are also client-side binary applications that require installation on a user's PC. There are three ways in which Windows Live services are offered: Windows Live Essentials applications, web services, and mobile services.[1]\n\nWindows Live was first announced on November 1, 2005. In its initial release, several Windows Live properties were rebranded and enhanced from Microsoft's MSN set of products and services. However, MSN still exists alongside Windows Live as a means of delivering programmed content (as opposed to customized content and communications).[2] Although the new branding might suggest closer technical ties to the Microsoft Windows operating system and services, the two are available separately. Microsoft said that Windows Live &quot;is a way to extend the Windows user experience&quot;.[3] Windows Vista provides a link in its user interface to download Windows Live Messenger, and Windows 7 will see the removal of applications such as Windows Mail, Windows Photo Gallery and Windows Movie Maker and replaced with the Windows Live Essentials suite, a software package that allows the downloading and installation of similar offerings from Windows Live.[4] Some web-based Windows Live services such as Windows Live SkyDrive are available outside of Windows, however these services are integrated closely with the Windows Live Essentials suite of applications.\n\nBesides Windows Live, which is mainly aimed at individuals[2], there are some other Web properties from Microsoft that are branded as &quot;Live&quot;: Microsoft Office Live for small businesses, the Xbox Live multiplayer gaming and content delivery system for Xbox and Xbox 360, and the Games for Windows - LIVE multiplayer gaming service for Microsoft Windows. On January 23, 2009, Microsoft announced that Office Live services will be converged into Windows Live services.[5]\n","torrent":{"xt":"urn:btih:5a12ef23b5dd050ed93757bfe7fc97a055118e11","amp;dn":"Windows+Live+Essentials-+Instalador+Offline+Completo_2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a12ef23b5dd050ed93757bfe7fc97a055118e11","infoHashBuffer":{"type":"Buffer","data":[90,18,239,35,181,221,5,14,217,55,87,191,231,252,151,160,85,17,142,17]},"announce":[],"urlList":[]}}