{"title":"Punk_for_Beginners","uid":5420265,"size":742007339,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5baa9615eed3cba35b8b2c3f46f5ce2e73b2a3a7&amp;dn=Punk_for_Beginners&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"pgrimes","files":285,"time":1268064093,"description":"As you can see from track listing this collection could be called &quot;A Very Short History of Punk&quot;. Some of the songs might not even be considered Punk.\n\nI had a bit of time and thought I could update my perception of Punk. Punk only existed at the fringes of my musical universe. I knew some of the classic Punk albums like &quot;London Calling&quot;, &quot;Ramones&quot; or &quot;Kick Out the Jams&quot;. But wait a moment. Is MC 5 Punk? And what about the rest of the garage sound or the underground sound from New York? I started gathering some of the puzzle piece and tried to get a picture of where Punk came from and what it went through.\n\nIf you miss your favorite band in this collection you can attribute it to our differing taste and my beginners experience.\n\nI was alive when &quot;Kick Out the Jams&quot; was released but at that time I used to listen to Lullabys. And later, when we had pocket money, I spent it on Reggae and Blues albums and audio cassettes for sharing. There was just not enough money or time left for Punk and I always found it a bit crude anyway. Now, that sharing got even easier than exchanging tapes, there's no reason anymore not to dip into something new from time to time.\n\nDo it yourself,\n\nPeter\n","torrent":{"xt":"urn:btih:5baa9615eed3cba35b8b2c3f46f5ce2e73b2a3a7","amp;dn":"Punk_for_Beginners","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5baa9615eed3cba35b8b2c3f46f5ce2e73b2a3a7","infoHashBuffer":{"type":"Buffer","data":[91,170,150,21,238,211,203,163,91,139,44,63,70,245,206,46,115,178,163,167]},"announce":[],"urlList":[]}}