{"title":"What Really Happened - 2010 Feb 08 MO [sebaygo1]","uid":5347901,"size":36488833,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:5c5818093bd0e7389ba9904f3831f82812a0509b&amp;dn=What+Really+Happened+-+2010+Feb+08+MO+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sebaygo1","files":3,"time":1265705014,"description":".\n\t\t\t\t\nWhat Really Happened \n- with Mike Rivero -\nMonday, 08 February 2010\n\n[sebaygo1]\n\n\n\nMany states are near bankruptcy, sharply declining tax revenues, ready to consider a variety of extreme measures;\nSouth Carolina looking at allowing some sort of gold/silver coinage to be legal tender within the state -- an alternative monetary system [look for the Fed to be pouring tons of money into the state to kill this];\nResidential mortgage delinquency rates over 10 percent, so the housing crisis has not gone away;\nDelinquencies for commercial property rising -- the next big bubble to collapse;\nOfficial unemployment numbers for January said an additiona net 20,000 jobs were lost, yet unemployment rate dropped to 9.7 percent -- mainstream media reported this obviously contradictory information without batting an eye;\nUpdate on the grassroots movement to call a national general strike for April 15;\nSarah Palin being willingly used by the Republican Party to hijack the &quot;tea party&quot; movement;\n\nIsrael moving to make their theft of the Golan Heights from Syrian permanent;\nIsrael constantly grabbing other peoples' land; Israel will not draw its borders -- they just declare: &quot;the bible says we get all this land, and you're an anti-semite if you don't go along with it&quot;\nIsrael is currently spending a lot of money trying to suppress the Goldstone report [UN inspector's report on war crimes committed by Israel in Gaza in 2008]; they can count on the US to veto any Security Council vote to send the report to the International Court of Justice for prosecution, but the General Assembly also has the ability to send it;\nNeocons telling Obama that the only way he can salvage his presidency is by going to war with Iran;\n\nIsrael is saying that they may have to use nukes against Iran. This admission that they HAVE nuclear weapons means that every dollar of US aid sent to Israel since 1976 has been ILLEGAL -- a criminal act committed by the federal government against the taxpayers -- it is against US law to give money to a nation possessing nuclear weapons that will not sign the Nuclear Nonproliferation Treaty or allow inspections by the IAEA.\n\n\n...all this and much, much more.\n\n\n\nMike manages to present powerful, persuasive stuff without screaming and yelling.\nPlease give his show a listen.\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually\n essential to seek information from a variety of sources, \n to listen to a spectrum of voices in order to better \n understand the &quot;big picture.&quot; A reliance solely upon\n mainstream corporate media for news and info is a \n prescription for ignorance. I try to share information\n that counters the monotone of mainstream corporate media.\n NOTE: The material here is made available strictly as\n information. Do not assume support or endorsement on my\n part of all contents. \n\n Think for yourself!\n To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n \n !! please try some of the other shows I upload too !!\n\n my torrents since 26 Nov 2009:\t\n &lt;a href=&quot; http://thepiratebay.se/user/sebaygo1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/user/sebaygo1&lt;/a&gt;\n\n my RSS feed:\t\n &lt;a href=&quot; http://rss.thepiratebay.se/user/7621f7439b536868ef7a883e0b221961&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://rss.thepiratebay.se/user/7621f7439b536868ef7a883e0b221961&lt;/a&gt;\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n\n\n================================================================\n\nMike Rivero launched What Really Happened [initially called Rancho Runamukka] as a subpage on his business web site in 1993 asking pointed questions about the death of White House Deputy Council Vincent Foster.\nAs more and more investigations revealed more government deceptions, the project grew in size and eventually moved to its own domain [whatreallyhappened.com] where it resides today.\nHis WRH website is among the top ten ranked daily political news sites on the Internet, with a global readership in the millions.  What Really Happened is proud to be one of the oldest political blogs on the net.\nRivero runs the WhatReallyHappened radio show on GCN six days a week, and makes good use of his sharp wit to help his blog visitors and radio listeners not only to read/hear the news but to understand what IS really happening. \n\n===============================================================\n.","torrent":{"xt":"urn:btih:5c5818093bd0e7389ba9904f3831f82812a0509b","amp;dn":"What+Really+Happened+-+2010+Feb+08+MO+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c5818093bd0e7389ba9904f3831f82812a0509b","infoHashBuffer":{"type":"Buffer","data":[92,88,24,9,59,208,231,56,155,169,144,79,56,49,248,40,18,160,80,155]},"announce":[],"urlList":[]}}