{"title":"Alex Jones Exposes Copenhagen Carbonistas 2","uid":5209539,"size":105464572,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:5d12ac60cc770100ab964b4692d76d4cc368ec9e&amp;dn=Alex+Jones+Exposes+Copenhagen+Carbonistas+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SamN3Dat","files":-1,"time":1260531990,"description":"Alex Jones Breaks Down World Government Takeover\n\nIn Alex's second special message about Climategate, the UN Climate Change Conference at Copenhagen and the Global Takeover, he analyzes the leaked documents in a draft of the treaty that expose the true intentions of the meeting-- to shut down development in the Third World and dominate the planet through a carbon tax.\n\nAlex also exposes President Obama's cynical move to have the EPA declare CO2 to be a danger-- in the face of logic and common sense. Through this designation, regulation could be implemented in the name of cutting emissions even if the Senate were to fail to ratify the Copenhagen treaty, which Obama is expected to sign.\n\nFurther, Alex points out that this scheme is just the implementation of a larger-scale plan to de-industrialize the already developed world and maintain control over the emerging spheres-- from Maurice Strong to Paul Ehrlich &amp; now-Science Czar John P. Holdren, top globalists have targeted human activity as a negative and implemented eugenics policies to breakdown mankind's natural order.\n\nLONDON GUARDIAN: Copenhagen climate summit in disarray after 'Danish text' leak\nhttp://www.guardian.co.uk/environment...\n\n&quot;The draft hands effective control of climate change finance to the World Bank; would abandon the Kyoto protocol the only legally binding treaty that the world has on emissions reductions; and would make any money to help poor countries adapt to climate change dependent on them taking a range of actions.&quot;\n\n-------------\nAlex Jones Copenhagen CO2 climategate climate-gate change global warming al gore holdren Barack Obama Ban Ki-Moon Von Rompuy EU UN United Nations conference COP15 world government planetary regime dictatorship Lord Monckton BP Shell Lord Browne Dutch Royal Ken Lay Goldman Sachs Generation Investment offset scheme developing world\nCategory:  News &amp; Politics\nTags: \nAlex  Jones  Copenhagen  CO2  climategate  climate-gate  change  global  warming  al  gore  holdren  Barack  Obama  Ban  Ki-Moon  Von  Rompuy  EU  UN  United  Nations  conference  COP15  world  government  planetary  regime  dictatorship  Lord  Monckton  BP  Shell  Browne  Dutch  Royal  Ken  Lay  Goldman  Sachs  Generation  Investment  offset  scheme  developing","torrent":{"xt":"urn:btih:5d12ac60cc770100ab964b4692d76d4cc368ec9e","amp;dn":"Alex+Jones+Exposes+Copenhagen+Carbonistas+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d12ac60cc770100ab964b4692d76d4cc368ec9e","infoHashBuffer":{"type":"Buffer","data":[93,18,172,96,204,119,1,0,171,150,75,70,146,215,109,76,195,104,236,158]},"announce":[],"urlList":[]}}