{"title":"Dear John 2010 XviD  CAM Sub Castellano","uid":5449533,"size":708374165,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5d77273a5fd6c8c1a15b50a6a1441f9589d39167&amp;dn=Dear+John+2010+XviD++CAM+Sub+Castellano&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"adrianleon","files":2,"time":1269132073,"description":"Movies : Drama : Cam : Spanish\nTÃƒÂ­tulo Original: &quot;Dear John&quot;.\nGÃƒÂ©nero: Drama, Romance.\nPaÃƒÂ­s y AÃƒÂ±o: EE.UU. - 2009.\nDirecciÃƒÂ³n: Lasse HallstrÃƒÂ¶m. . .\nGuiÃƒÂ³n: Jamie Linden. Nicholas Sparks. .\nSubtÃƒÂ­tulos: Adrianleo y Estrella\nReparto principal:\nChanning Tatum Amanda Seyfried\nHenry Thomas Richard Jenkins\nScott Porter Luke Benward\nDavid Andrews Keith Robinson\nCullen Moss Leslea Fisher\n\nSinopsis:\nEn el drama romÃƒÂ¡ntico QUERIDO JOHN, basado en la novela ÃƒÂ©xito de ventas de Nicholas Sparks y dirigido por el tres veces nominado al OscarÃ‚Â®, Lasse HallstrÃƒÂ¶m (Mejor director por Las normas de la casa de la sidra [The Cider House Rules] en 1999, y Mejor director y guiÃƒÂ³n adaptado en 1985 por Mi vida como un perro [Mit Liv Som Hund]) las complejidades del amor se exploran a travÃƒÂ©s de la fortaleza de la relaciÃƒÂ³n de una joven pareja cuya mutua devociÃƒÂ³n es puesta a prueba por fuerzas mÃƒÂ¡s allÃƒÂ¡ de su control.\n\nJohn Tyree (Channing Tatum) es un soldado de las Fuerzas Especiales, atractivo y atento, que durante su perÃƒÂ­odo de permiso va a visitar a su padre a Carolina del Sur. Savannah Curtis (Amanda Seyfried) es una bella e idealista estudiante universitaria de una acomodada familia sureÃƒÂ±a que estÃƒÂ¡ en casa por las vacaciones de primavera. John y Savannah pertenecen a mundos diferentes, pero cuando se conocen por casualidad en la playa, se sienten inmediatamente atraÃƒÂ­dos el uno por el otro. El encuentro se transforma en un idilio arrollador de dos semanas y rÃƒÂ¡pidamente sus sentimientos se profundizan hasta que se convierte en un amor apasionado. Cuando John es forzado a volver a sus fuerzas de despliegue y Savannah tiene que regresar a la universidad, la pareja promete escribirse. A travÃƒÂ©s de una continua correspondencia, su amor florece y la profunda historia de amor romÃƒÂ¡ntico se prolonga.\n\nA medida que pasa el tiempo, John y Savannah solo pueden verse esporÃƒÂ¡dicamente. El perÃƒÂ­odo de John en su destacamento en el extranjero se extiende y la vida de Savannah sigue su curso. Al tiempo que la situaciÃƒÂ³n en el mundo se vuelve cada vez mÃƒÂ¡s compleja, Savannah se halla constantemente preocupada por la seguridad de John, y John se debate entre la dedicaciÃƒÂ³n a su trabajo y su deseo de volver a casa y tener una vida con Savannah. A pesar de la creciente tensiÃƒÂ³n entre sus deseos y responsabilidades la pareja lucha por mantener su compromiso. Pero cuando una inesperada tragedia se produce y John vuelve, su regreso provoca una confrontaciÃƒÂ³n emocional donde la pareja se ve forzada a descubrir si su amor es capaz de sobrevivir. \n\nMUY BUENA!!! DISFRUTENLA.\n\n\nNo es un FAKE!!!","torrent":{"xt":"urn:btih:5d77273a5fd6c8c1a15b50a6a1441f9589d39167","amp;dn":"Dear+John+2010+XviD++CAM+Sub+Castellano","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d77273a5fd6c8c1a15b50a6a1441f9589d39167","infoHashBuffer":{"type":"Buffer","data":[93,119,39,58,95,214,200,193,161,91,80,166,161,68,31,149,137,211,145,103]},"announce":[],"urlList":[]}}