{"title":"Kenny Chesney - I Go Back  (2nafish)","uid":5383709,"size":187623428,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:5e7edef1d062cf4c3e27f99557e22bf0d8c8461e&amp;dn=Kenny+Chesney+-+I+Go+Back++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1266823997,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;I Go Back&quot; is the title of a song written and recorded by American country music artist Kenny Chesney. It was the third single from his 2004 album When the Sun Goes Down. The song is a mid-tempo in which the narrator recalls various moments in his life, and how he is reminded of each moment when he hears a certain song.\n\n&quot;I Go Back&quot; spent a total of seven weeks at the #2 position on the Billboard country charts in mid-2004, tying a record set by Jo Dee Messina's &quot;Lesson in Leavin'&quot; for the longest run at #2 since the beginning of Nielsen SoundScan in 1990. For all seven weeks, &quot;I Go Back&quot; was blocked from Number One by Tim McGraw's &quot;Live Like You Were Dying&quot;. After McGraw had spent four weeks at Number One, and Chesney four weeks at #2, McGraw fell to #2 on the charts dated for August 7, 2004, and Reba McEntire's &quot;Somebody&quot; claimed the Number One spot that week, thus causing &quot;I Go Back&quot; to fall to #3. The next week, McGraw returned to #1, and Chesney returned to #2, and both songs held those positions for three more weeks.\n\nChesney recalls how different songs were important parts of seasons of his life. When he hears them, he &quot;goes back.&quot;\n\nSongs referenced: Jack &amp; Diane, Only the Good Die Young, Keep on Rockin' Me Baby\n\nIn the chorus, the narrator reflects in his past explaining his time such as spending time on a football line, drinking his love out to the levy and losing a really good friend.\n\nWhen the Sun Goes Down is the ninth album by country music singer Kenny Chesney, released on February 3, 2004. It debuted at number one on the U.S. Billboard 200, selling about 550,000 copies in its first week.\n\nThe tracks &quot;There Goes My Life&quot;, &quot;When the Sun Goes Down&quot;, &quot;I Go Back&quot;, &quot;The Woman with You&quot;, &quot;Anything but Mine&quot;, and &quot;Keg in the Closet&quot; were all released as singles between 2004 and 2005. Respectively, they peaked at #1, #1, #2, #2, #1, and #6 on the Billboard Hot Country Songs charts. The title track, a duet with Uncle Kracker, is also Uncle Kracker's first country chart entry.\n\nAlso included on this album is the song &quot;Some People Change&quot;, which would later be recorded (and released as a single) by Montgomery Gentry as the title track to their 2006 album Some People Change. Montgomery Gentry's version was a Top Ten hit for them that year.\n\n\nMy Videos:\n\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:5e7edef1d062cf4c3e27f99557e22bf0d8c8461e","amp;dn":"Kenny+Chesney+-+I+Go+Back++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e7edef1d062cf4c3e27f99557e22bf0d8c8461e","infoHashBuffer":{"type":"Buffer","data":[94,126,222,241,208,98,207,76,62,39,249,149,87,226,43,240,216,200,70,30]},"announce":[],"urlList":[]}}