{"title":"Dorian.Gray.2009.MD.iTALiAN. [www.bt-italiatorrent.org ]","uid":5240569,"size":737859584,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5edefb755fa5b81477a696fe8c659a7d875b97e9&amp;dn=Dorian.Gray.2009.MD.iTALiAN.+%5Bwww.bt-italiatorrent.org+%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"italiatraker","files":1,"time":1261702052,"description":"www.bt-italiatorrent.org  trovate giochi xbox dvd dvdrip e molto altro forza registratevi\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTitolo originaleorian Gray\n\nNazione:Regno Unito\nAnno: 2009\nGenererammatico\nDurata:113\nRegia:Oliver Parker\nCast:Colin Firth, Ben Barnes, Emilia Fox, Rebecca Hall, Rachel Hurd-Wood, Fiona Shaw, Ben Chaplin, Caroline Goodall, Caroline Goodall, Maryam d'Abo\nProduzione:Ealing Studios, Fragile Films\nDistribuzione:Eagle Pictures\nData di uscita:27 Novembre 2009 (cinema)\n\n\nIl bellissimo Dorian Gray arriva nella Londra Vittoriana dove, ancora giovane e ingenuo, si lascia trascinare nel vortice della vita sociale dal carismatico Henry Wotton, che introduce Dorian ai piaceri edonistici della cittÃƒÂ . L'amico di Henry, l'artista Basil Hallward, dipinge un ritratto di Dorian che cattura appieno tutta la sua bellezza giovanile. Nel momento esatto in cui tolgono il velo che ricopre il ritratto, Dorian compie un futile giuramento: ÃƒÂ¨ pronto a sacrificare qualsiasi cosa pur di rimanere cosÃƒÂ¬ come appare nel ritratto... perfino la sua anima. Incoraggiato da Henry, Dorian si lascia trascinare nelle avventure piÃƒÂ¹ sfrenate. Ma mentre Dorian continua ad apparire innocente e bellissimo come sempre, il suo ritratto, che ora ÃƒÂ¨ chiuso a chiave in soffitta, ad ogni atto malvagio da lui commesso, diventa via via piÃƒÂ¹ orripilante e mostruoso. Sembra quasi che Dorian possa concedersi qualsiasi desiderio proibito senza dover subire alcuna conseguenza. Quando Basil insiste nel voler vedere il ritratto, Dorian ÃƒÂ¨ costretto ad ucciderlo e conseguentemente a fuggire dal paese. Venticinque anni dopo Dorian torna e, lasciando sgomenti i suoi vecchi amici, non appare invecchiato di un solo giorno. CiÃƒÂ² nonostante, ÃƒÂ¨ un uomo tormentato, con una vita priva di amore e significato. E' perseguitato dal suo passato e viene costantemente deriso dall'abominevole mostruositÃƒÂ  rinchiusa nella sua soffitta. Un giorno, incontra Emily, una ragazza intelligente e straordinaria che prova un grande fascino nei suoi confronti. Emily, perÃƒÂ², ÃƒÂ¨ la figlia di Henry, e questi ÃƒÂ¨ pronto a tutto pur di tenere lontano i due giovani amanti. Mentre a Londra girano voci sulla possibilitÃƒÂ  che Dorian abbia stretto un patto con il Diavolo, Henry decide di smascherare l'amante di sua figlia. RiuscirÃƒÂ  Dorian ad avere un'ultima possibilitÃƒÂ  per redimersi e per essere amato? Ma soprattutto riuscirÃƒÂ  ad uscirne vivo?42nnc","torrent":{"xt":"urn:btih:5edefb755fa5b81477a696fe8c659a7d875b97e9","amp;dn":"Dorian.Gray.2009.MD.iTALiAN.+%5Bwww.bt-italiatorrent.org+%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5edefb755fa5b81477a696fe8c659a7d875b97e9","infoHashBuffer":{"type":"Buffer","data":[94,222,251,117,95,165,184,20,119,166,150,254,140,101,154,125,135,91,151,233]},"announce":[],"urlList":[]}}