{"title":"1349 - Discography","uid":5307875,"size":357624773,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5f0993b16d1eb6cf6fd16cb7e5f3ac031c053b25&amp;dn=1349+-+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Baphom3t","files":60,"time":1264459894,"description":"1349 rose from the ashes of Alvheim in 1997, with Ravn (vocals &amp; drums), Tjalve (guitars), Seidemann (bass) and Balfori (guitars). They recorded but never released a demo in early '98, and Balfori quit shortly after due to musical differences. In early '99 they recorded the never released promo Chaos Preferred. By then, the band realised they needed another guitarist, and found Archaon whose speed and technique took their music to a new level of intensity and brutality. \nCome spring 2000, 1349 decided to record a new promo showcasing the new material, and Frost of Satyricon was asked to lay down the drum tracks to get the speed required. Frost was later so impressed by the material, that he asked to join 1349 as a permanent member. Holycaust Records offered them a deal and released the new promo as an eponymous MCD. By early 2001, the band felt they had enough killer songs for a full-length album - Liberation. Recorded and mixed at Gordon Studios, Liberation blended old school soundscapes with warp-speed hysteria. In the wake of such yet unreleased but unforgiving material, 1349 supported Gorgoroth, Cadaver Inc. and later performed at the Hole in he Sky festival in Bergen in 2001, as well as the Inferno festival in Oslo in 2002. After signing a new deal with Candlelight Records, Liberation was released in April 2003. \n\nThis was the year when 1349 began to reap the fruits of their dark labour - their debut album received critical and public acclaim and several magazines hailed the band as The Newcomer of the Year. They were rebooked to play the Inferno Festival, and on Germany's high profile With Full Force Festival, where they shared stage with such high calibre bands as Zyklon, My Dying Bride and Moonspell. Their first European Tour with compatriots Aeternus and Red Harvest in November ended the year on a high for 1349. \n\nNo rest for the wicked, however, and only a month after returning from the tour, the band entered Studio Studio Nyhagen to record the follow-up to Liberation. Released by Candlelight Records in April the following year, Beyond the Apocalypse helped 1349 secure their quality old school black metal reputation. On top of touring with Gorgoroth during fall 2004, 1349 performed at Aalborg Metal Fest in Denmark, Nihil Extreme Music Festival in Italy and Arnhem Metal Meeting in the Netherlands, as well as the Hole in the Sky, MÃƒÂ¥nefestivalen and Working Class Hero Festivals in Norway. \n\nHellfire, the bands 3rd album, recorded at Studio Studio Nyhagen in the course of 2005, is their most powerful musical offering so far. 1349 have refined their highly reputed sound into audible hellfire! Hellfire has received massive acclaim by fans and critics alike, scoring 5 K's in KERRANG! and becoming album of the month in Terrorizer. When the time came to hit the road in autumn 2005 1349 once again chose Gorgoroth as their touring partners and spent 5 weeks spreading the plague through Europe. \n\n2006 started out with gigs at Metal Mania Festival in Poland and Club 10 in Asker, Norway. After this Frost had to take a break from 1349 to work with Satyricon the rest of 2006. Session drummer for the No Mercy Festival in Antwerp, Belgium and Tillburg, Netherlands was Tony Laureano. Frost had a small break from the busy schedule of Satyricon to perform with 1349 at Kroa in BÃƒÂ¸, Norway. \n\nIn June guitarist Tjalve left the band to concentrate his musical efforts on his band Pantheon I. 1349 continues as a quartet and use session guitarists for live performances. \n\nAutumn 2006 was a time for concerts and touring. 1349 played at the Summer Breeze, Hole in the Sky and Hellflame festivals with session drummer Tony Laureano (Ex. Nile, Angel Corpse, Brujeria, amongst others) and session guitarist Teloch (Nidingr). A week was spent in the UK with Enslaved, Zyklon and Insomnium before 1349 embarked on their first ever American tour, supporting the legendary Celtic Frost. 1349 also took the time to play a headliner show at Safari Sams in Hollywood as well as 3 gigs in Mexico. 2007 saw the band visit the US shores for their first headlining tour ever, as well as extensive performances through the biggest festivals in Europe. \n\n2008 saw 1349 returning again to the US, first to the SXSW festival and then supporting another metal legend : Carcass. \n\n4 years after Hellfire, 1349 decided to unleash another monster upon the unsuspecting masses and Revelations of the Black Flame saw 1349 return to Studio Studio Nyhagen with Tom G. Warrior co-producing the album along with Ravn. \n\nReleased May 25th on Candlelight Records, Revelations... saw 1349 explore the slower and darker side of black metal, ambient, doom and industrial while still retaining the spirit of audible hellfire. \n\nHell is coming, and it is never what you expected...\n\nCurrent line-up \nRavn - Vocals (1997-) (also drums 1997-2000)\nArchaon (Idar Burheim) - Guitars (1999-) (Funeral (Nor), Antaios)\nSeidemann (Tor Risdal Stavenes) - Bass (1997-) (Koldbrann, Nidingr, Pantheon I, Den Saakaldte, Slavia, Vidsyn, Tyrann, Dead Trooper)\nFrost (Kjetil Vidar Haraldstad) - Drums (2000-) (Zyklon-B (Nor), Keep of Kalessin, Gorgoroth, Gehenna (Nor), Satyricon, Ov Hell)\n\nLive members:\nTeloch - Guitars (2006-) (Gorgoroth, Orcustus, Nidingr, Umoral, NunFuckRitual, Condenado, Ov Hell, The Konsortium)\nTony Laureano - Drums (2006-) (Acheron, Nile, Angelcorpse, Astaroth, God Dethroned, Internecine, Malevolent Creation, Nidingr, Aurora Borealis (USA), Belphegor (Aut), Brujeria, Devolution (USA), Dimmu Borgir, Eulogy, Naphobia, Nachtmystium, Sanctification, The Black Dahlia Murder, Insidious Disease) \n\n \nAlbums in this release\nChaos Preferred  \n1349 \nLiberation  \nBeyond the Apocalypse  \nHellfire  \nRevelations of the Black Flame  \nLive At With Full Force (Bootleg - May 07 2003)\n\nGenre = Black Metal\nFormat = mp3\nBit Rate = vbr\n\n","torrent":{"xt":"urn:btih:5f0993b16d1eb6cf6fd16cb7e5f3ac031c053b25","amp;dn":"1349+-+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f0993b16d1eb6cf6fd16cb7e5f3ac031c053b25","infoHashBuffer":{"type":"Buffer","data":[95,9,147,177,109,30,182,207,111,209,108,183,229,243,172,3,28,5,59,37]},"announce":[],"urlList":[]}}