{"title":"Coast to Coast AM 2-3-10 Space-time and Cosmology","uid":5343366,"size":55166626,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:5f1607dd2a41bc917921fc28245753b468cdca7c&amp;dn=Coast+to+Coast+AM+2-3-10+Space-time+and+Cosmology&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"goodgirl666","files":6,"time":1265556469,"description":"Space-Time &amp; Cosmology\n\nDate:02-03-10\nHost:George Noory\nGuests:Nassim Haramein, Joshua P. Warren\n\nResearcher of hyperspace, physics, and anthropology, Nassim Haramein spoke about recent phenomena in terms of the geometry of space-time, and the structure of the universe. On the topic of UFOs recently seen around the sun in NASA photos, he noted that &quot;there is activity around the sun that can't easily be explained by conventional means,&quot; yet it's difficult to make distinctions between camera artifacts and anomalous objects. Regarding the Norway Spiral, he suggested it was likely caused by the application of HAARP-like technology, based on various evidence &amp; effects observed in the area.\n\nAccording to Haramein, a deeper fractal reality is occurring in which atoms are like little black holes, if you scale the size of the universe down to its smallest components. The universe is learning about itself-- &quot;the information that it gathers, coalesces and synergizes to produce the next set of questions,&quot; in a kind of &quot;self organizing feedback structure,&quot; he explained.\nEverything in the universe is spinning-- including our very atoms, said Haramein, who connected this phenomenon with the source of life. We can think of space-time as a spinning fluid and when it makes little currents we see it as an atom or a particle, he continued. When you take the time to connect via meditation, prayer, and other modalities to the fundamental source of creation, you start to become &quot;what I call a vacuum engineer&quot; where you can manipulate energy in various beneficial, non-linear ways, he detailed.","torrent":{"xt":"urn:btih:5f1607dd2a41bc917921fc28245753b468cdca7c","amp;dn":"Coast+to+Coast+AM+2-3-10+Space-time+and+Cosmology","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f1607dd2a41bc917921fc28245753b468cdca7c","infoHashBuffer":{"type":"Buffer","data":[95,22,7,221,42,65,188,145,121,33,252,40,36,87,83,180,104,205,202,124]},"announce":[],"urlList":[]}}