{"title":"Sex And Lies In Sin City 2009 Dual Audio (PT-BR / ENG)","uid":5385785,"size":735826283,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5f84a0f737f04bad3a4f3863c90e1839b15ac39d&amp;dn=Sex+And+Lies+In+Sin+City+2009+Dual+Audio+%28PT-BR+%2F+ENG%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"beth7","files":3,"time":1266888332,"description":"Sexo e Mentira em Las Vegas (Sex and Lies in Sin City) 2009 DVDRip Dual Audio\n\nIn the long, colorful history of Las Vegas crime, one case stands out: the shocking true story of the tumultuous, tortured romance of beauty-queen-turned-stripper Sandy Murphy and reckless casino mogul Ted Binion. At first, it seemed like the kind of story Las Vegas was invented for: she was a beauty from the wrong side of the tracks, he was one of the most eligible bachelors in town, and together they found true love. But every Vegas tale has a dark side, and soon reports of drugs, guns, cash, and mobsters begin to soil this storybook affair. When Ted Binion turns up dead of an overdose, all fingers immediately point to Sandy, the beneficiary of his millions. And when her secret lover gets caught stealing from Binion's hidden underground vault in the Nevada desert, the sordid facts of this malicious mÃƒÂ©nage ÃƒÂ  trois finally begin to emerge. Based on the book MURDER IN SIN CITY by Jeff German.\n \n(Decida por si prÃƒÂ³prio a verdade nesta empolgante histÃƒÂ³ria verdadeira que conta o maior escÃƒÂ¢ndalo de Las Vegas. Ted Binion (Matthew Modine, &quot;Weeds&quot;) ÃƒÂ© da alta sociedade de Vegas, o prÃƒÂ­ncipe do mundialmente famoso Horseshoe Casino - um rapaz rico, espalhafatoso e garanhÃƒÂ£o. Quando ele se apaixona por Sandy Murphy (Mena Suvari, Um SalÃƒÂ£o do Barulho) num clube de striptease local, ele se vÃƒÂª preso a uma rede de drogas, mentiras e por fim sua prÃƒÂ³pria morte. ApÃƒÂ³s a campanha de sua irmÃƒÂ£ Becky (Marcia Gay Harden, &quot;Damages&quot;), a aparente overdose que o matou logo passa a ser investigada como homicÃƒÂ­dio. Agora, Sandy e seu namorado (Johnathon Schaech, Quarentena) lutam para descobrir a verdade nesta chocante histÃƒÂ³ria de amor que se tornou um pesadelo e cobiÃƒÂ§a que se tornou descontrolada.)\n\nCast\nMatthew Modine ... Ted Binion\nMena Suvari ... Sandy Murphy\nJohnathon Schaech ... Rick Tabish\nMarcia Gay Harden ... Becky Binion\nMark Sivertsen ... Jay Green\nKiira Arai ... Bonnie Binion\n\nTÃƒÂ­tulo no Brasil: Sexo e Mentira em Las Vegas\n\nOriginal Title: Sex and Lies in Sin City\nCountry: EUA\nGenre: Biography | Crime | Drama | Mystery \nRuntime: 99 minutes\nRelease Date: 2009\nDireÃƒÂ§ÃƒÂ£o: Harold Ramis\nLanguage: Portuguese/English\nSubtittles: Portuguese (BR)\n\n*To watch the movie in English you'll have to use Media Player Classic, Gom Player, VCL or other that works with dual audio-and change audio stream from 1 to 2 (or B). WINDOWS MEDIA PLAYER IS NO GOOD, because both audios will play at the same time. *\n","torrent":{"xt":"urn:btih:5f84a0f737f04bad3a4f3863c90e1839b15ac39d","amp;dn":"Sex+And+Lies+In+Sin+City+2009+Dual+Audio+%28PT-BR+%2F+ENG%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f84a0f737f04bad3a4f3863c90e1839b15ac39d","infoHashBuffer":{"type":"Buffer","data":[95,132,160,247,55,240,75,173,58,79,56,99,201,14,24,57,177,90,195,157]},"announce":[],"urlList":[]}}