{"title":"Stargate SG-1 S02 D4 PAL 2Lions-Team","uid":5337921,"size":4634049126,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:5fcd28f694fa2e0804b84b6b1ecb979f36675983&amp;dn=Stargate+SG-1+S02+D4+PAL+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"wietseherman","files":-1,"time":1265376517,"description":"\n\nStargate SG-1 S02 D4 PAL 2Lions-Team\n\nNederlandse informatie\n\nThe Tok'ra  - deel 2  - De vader van Carter die stervende is wil zich beschikbaar stellen een gastheer voor Tok'ra te worden\n\nTouchstone - Op een planeet wordt het weer geregeld door de Toetssteen (Touchstone). Sg-1 ontdekt een duister zaakje als blijkt dat een ander SG team de Toetssteen heeft gestolen.\n\nA Matter of Time - Als een planeet wordt opgeslokt door een zwart gat, wordt het effect door de stargate doorgeven naar de aarde en kan de verbinding niet worden uitgeschakeld, evenmin na 38 minuten.\n\nThe Fifth Race - O'Neill krijgt de kennis van de Ancients in zijn hoofd gedownload en komt in contact met de Asgard\n\nEnglisch information\n\nThe Tok'ra  - Part2 - SG-1 offers an alliance with the Tok'ra, but it is turned down because Earth doesn't have enough to offer. Meanwhile, Selmak is a Tok'ra whose host is dying and the alliance deal is re-kindled when Jacob offers himself as a new host. \n\nTouchstone - Inhabitants of the planet Madrona accuse SG-1 of stealing 'the Touchstone', an artifact that can control their planet's weather. The Madronans claim that men dressed in SGC uniforms took the device, and SG-1 suspect that maybe the thieves are using the second gate found in Antarctica. \n\nA Matter of Time - SG-10 stranded on the planet designated P3W-451, which is close to a newly formed black hole. The SGC opens the gate to find out what happened, but they can't shut it down afterwards. Soon they realise that since the planet is near to a black hole, its intense gravity is causing time dilation, so if they don't shut down the gate very soon, it will destroy the SGC, and in time, the entire planet. \n\nThe Fifth Race - On P3R-272, O'Neill is grabbed by an Ancient Repository of Knowledge, and has alien knowledge downloaded into his mind. Before Jack's mind is overrun, he discovers a gate address to the Asgard homeworld, who remove the information from his brain, saving his life.\n\n\nSource    : retail\nFormat    : DVD5\nVideo     : Pal\nSound     : DD 5.1\nLanguages : EN \nMenu      : Yes\nExtra     : No\nSubs      : EN NL IT FR\n\n\nBrought to you by\n\nBack to Basic\n2Lions Team\n\nmeer zien??\n\nKom dan eens kijken op ons forum\n  \n &lt;a href=&quot; http://www.2lions.ons-forum.nl/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.2lions.ons-forum.nl/index.php&lt;/a&gt;\n\n2Lions-Team for all your Dutch MOVIES and more\n\n*****************************************************\n\nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden.\nDon`t quit after you finished the download, but keep seeding.\n\n\n\n*****************************************************\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\n\nWe 2Lions-Team are not responsible for the fake posts on our name.\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n\n*****************************************************\n","torrent":{"xt":"urn:btih:5fcd28f694fa2e0804b84b6b1ecb979f36675983","amp;dn":"Stargate+SG-1+S02+D4+PAL+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5fcd28f694fa2e0804b84b6b1ecb979f36675983","infoHashBuffer":{"type":"Buffer","data":[95,205,40,246,148,250,46,8,4,184,75,107,30,203,151,159,54,103,89,131]},"announce":[],"urlList":[]}}