{"title":"Sexy Telugu girl Ileana Unwatermarked Pics","uid":5252248,"size":1869520,"categoryP":"other","categoryS":"pictures","magnet":"?xt=urn:btih:5fe4de0ec372c1d281637657b1cdcdc338509cd7&amp;dn=Sexy+Telugu+girl+Ileana+Unwatermarked+Pics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"notrick","files":24,"time":1262408572,"description":" &lt;a href=&quot;http://cafe18.in&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://cafe18.in&lt;/a&gt; Presents \nHot sexy Telugu Actress Ileana hot Latest new photos\n\nAbout Ileana\n\n\nBirthday: 8/19/1987\nNickname: Llana\nBirthname:Ileana D'Cruz\nHometown: Mumbai\nAssets: Girl Next Door Looks,comparatively big booty\n\n\nSign: Leo\nHeight: 5'5\nJob: Actress\nHobbies: Painting, Singing, Reading Novels\nEthnicity: Asian\nCountry of Origin:India\nState - Aasam\n\n\nFigure 32-24-38   (HOT)  - Meassured by [iluvdesi . com ]\nPerview - (Search for Ileana in google)\n\n\n\nIleana D'Cruz or simply Ileana to her fans is the new glamour girl of Tollywood. She was born on August 19, 1987 in Mumbai, but her family is now settled in Goa. She has three sisters and a brother. she took to modeling at a very early age and performed very well in the profession. Reading books, listening to music and swimming are her hobbies.\n\nShe burst into the scene with a famous Fair and Lovely commercial directed by ace ad film director Rakesh Roshan. It was form here that she was spotted by director Y.V.S. Choudhary and offered a role in his movie Telugu movie Devadasu in 2006. Here she stared opposite Ram who was also making his debut on the screen. The film was an instant hit and overnight turned Ileana into a star. The critics applauded her sensitive portrayal of a woman who fights against her father for her love in the movie. Her life was destined to change in the same year and she go the offer to play the role of Shruti in the movie Pokiri directed by Puri Jagannath. Incidentally Bollywood actress was offered the role but she rejected. The character she played was of an innocent girl haunted by a corrupt police officer. The film not only appealed to the urban masses but was a super hit in the rural areas. Her costar in this was prince Mahesh Babu, the film broke all the box office records of Tollywood and went on to become the biggest hit in Tollywood history grossing over Rs. 66 crores. After this sensational hit she was in the numbero uno spot among the actresses in the Telugu industry one of the highest paid actresses. She gets 70 lakhs a film after less than two years in the Industry. \n\nFor More Unwatermarked Images Visit\n\n","torrent":{"xt":"urn:btih:5fe4de0ec372c1d281637657b1cdcdc338509cd7","amp;dn":"Sexy+Telugu+girl+Ileana+Unwatermarked+Pics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5fe4de0ec372c1d281637657b1cdcdc338509cd7","infoHashBuffer":{"type":"Buffer","data":[95,228,222,14,195,114,193,210,129,99,118,87,177,205,205,195,56,80,156,215]},"announce":[],"urlList":[]}}