{"title":"Ben 10: Alien Force - Volume 6 (2010) DVDRip Eng Xvid AC3 AVI [B","uid":5432148,"size":960476771,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6077a28682ec9cabe825d16a2175f6b0aba340ae&amp;dn=Ben+10%3A+Alien+Force+-+Volume+6+%282010%29+DVDRip+Eng+Xvid+AC3+AVI+%5BB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Bigjazz.h33t","files":6,"time":1268465550,"description":"-------------------------------------------------------------------\n-------------------------------------------------------------------\n\nBen 10: Alien Force - Volume 6 (2010) DVDRip Eng Xvid AC3 AVI\n\nTitle:\t\tBen 10: Alien Force\nRelease:\tTV: 2009 DVD: 2010\nSeason:\t\tVolume 6, Season 2, Episodes 10-13\nRuntime:\tEaxh episode approx 22mins\n\nEncoding\n\nVideo;\nResolution:\t576x432\nBitrate:\t~1220kbps @ 25fps\nCodec:\t\tXvid, v1.2.2\nFormat:\t\tAudio Video Interleave (.avi)\n\nAudio;\nTrack 1:\t2.0 Channel AC3 @ 224kbps, English\n\nFile Size:\t~225MB\n\nSubtitles:\tNone\n\nSource:\t\tPAL DVD\n\nBen 10: Alien Force - Volume 6\n\n210 - Birds of a Feather\nThe prince of the Arachnachimps, Simion, needs help in retrieving a crystal which is the symbol of the monarchy on his planet. The crystal is being kept in a base on the moon. Ben offers his help, but Kevin and Gwen are skeptical. In the midst of the battle, Ben discovers that Simion has been lying, and that the crystal is actually powering an intergalactic communications station. By stealing it, Simion will prevent Earth from calling for help against the Highbreed invasion. Ben tricks Simion into stealing a worthless acid dispenser instead, resulting in Simion having a very unpleasant encounter with the Highbreed that employed him.\n\n211 - Unearthed\nA DNAlien mining operation uncovers an alien spacecraft, from which a large, alien child is released. She wanders around the nearby town collecting random items, eventually attracting the attention of Ben, Gwen, and Kevin. After a short battle, they realize that the alien is a child. She perceives Gwen as an Anodite and hangs on her every word. Needing to return the child to her parents, the team follows her back to her ship. After defeating the DNAliens, the team wakes the child's parents, who depart the planet after Ben explains that they've been in stasis for fifty years.\n\n212 - War of the Worlds, Pt. 1\nParadox and Azmuth arrive on Earth to warn Ben of the approaching Highbreed fleet. Gwen and Kevin gather all the allies they've met (Allen, Cooper, Julie and Ship as well as their enemy Darkstar) to counter the threat. Meanwhile, Azmuth reveals to Ben that the Omnitrix contains the DNA of every sentient species in the galaxy, over one million in total, and unlocks the Master Control so Ben can effectively combat the Highbreed. This includes 3 of his old aliens; Cannonbolt, Upchuck and Way Big.\n\n213 - War of the Worlds, Pt. 2\nBen, Gwen and Kevin quickly head to the Captain of the fleet. The Highbreed commander and the team fight, and Gwen reveals her true anodite form for the first time. The trio is then surrounded by a group of DNAliens, but are saved by Grandpa Max, Pierce, Helen and Manny plus one Null Guardian, who have regained control over the Null Void.\n\n-------------------------------------------------------------------\nPlease share....Don't hit and run...Seed it back at least once.\n\nOf course, if you want to seed it back more than once, that would be ok too :)\n-------------------------------------------------------------------","torrent":{"xt":"urn:btih:6077a28682ec9cabe825d16a2175f6b0aba340ae","amp;dn":"Ben+10%3A+Alien+Force+-+Volume+6+%282010%29+DVDRip+Eng+Xvid+AC3+AVI+%5BB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6077a28682ec9cabe825d16a2175f6b0aba340ae","infoHashBuffer":{"type":"Buffer","data":[96,119,162,134,130,236,156,171,232,37,209,106,33,117,246,176,171,163,64,174]},"announce":[],"urlList":[]}}