{"title":"CORRUPCION EN MIAMI","uid":5452216,"size":734164992,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:618ab7452577264556cc496efa9f268fa3450e86&amp;dn=CORRUPCION+EN+MIAMI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"VICTOR_CADIZ","files":1,"time":1269222578,"description":"AdaptaciÃƒÂ³n al cine de la conocida serie de TV de los aÃƒÂ±os ochenta. Sonny Crockett (Colin Farrell) y Ricardo Tubbs (Jamie Foxx) son una pareja de agentes de antivicio del Departamento de PolicÃƒÂ­a de Miami. En medio de una operaciÃƒÂ³n menor, ambos se enteran de que un soplo en las altas esferas ha causado la muerte de dos agentes federales y la masacre de una familia por un tema de drogas. Autorizados por el teniente Castillo (Barry Shabaka Henley), la DEA pide ayuda a Sonny y Ricardo, que se harÃƒÂ¡n pasar como transportistas de droga para los barones de la droga latinoamericanos que mueven grandes cargamentos a los Estados Unidos. Infiltrados bajo la nueva identidad, los dos compaÃƒÂ±eros conocerÃƒÂ¡n a la encargada de las finanzas de un poderoso cartel, la preciosa Isabella (Gong Li), una mujer que mueve, blanquea e invierte dinero para el narco ArcÃƒÂ¡ngel de JesÃƒÂºs Montoya (Luis Tosar). Su seductora belleza le sirve a Crockett para exorcizar sus demonios mientras intenta protegerla de fuerzas aÃƒÂºn mÃƒÂ¡s oscuras. Pero los nuevos amantes no tardarÃƒÂ¡n en aprender quiÃƒÂ©n juega con quiÃƒÂ©n. Al mismo tiempo, el estoico Tubbs se infiltra en el negocio sin por eso olvidarse de su novia Trudy (Naomie Harris). Crockett y Tubbs trabajan de incÃƒÂ³gnito moviendo drogas en el sur de Florida, mientras mantienen una carrera contra el tiempo para identificar a los responsables de los asesinatos de sus amigos e investigan el Nuevo Orden del Crimen Organizado. Durante su misiÃƒÂ³n, pasarÃƒÂ¡n de un lado a otro de una frontera nada definida olvidando a veces de quÃƒÂ© lado estÃƒÂ¡ la ley. ","torrent":{"xt":"urn:btih:618ab7452577264556cc496efa9f268fa3450e86","amp;dn":"CORRUPCION+EN+MIAMI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"618ab7452577264556cc496efa9f268fa3450e86","infoHashBuffer":{"type":"Buffer","data":[97,138,183,69,37,119,38,69,86,204,73,110,250,159,38,143,163,69,14,134]},"announce":[],"urlList":[]}}