{"title":"Ben Fawce Featuring Predator Prey - Onyx - Urban Sickness Audio","uid":5374349,"size":14625514,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:618c5cb0be7089e19ddd64c64b91ca79ed116df2&amp;dn=Ben+Fawce+Featuring+Predator+Prey+-+Onyx+-+Urban+Sickness+Audio+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"US-Audio","files":5,"time":1266524560,"description":"Urban Sickness Audio: USA0803\n\nArtist: Ben Fawce Featuring Predator Prey\n\nTitle: Onyx\n\nOriginal Mix / Soul Intent Remix / Silhouettes\n\n\nWith DJ support from: El Hornet (Pendulum) / Artificial Intelligence / The Insiders / Eveson / Mixmaster Doc / Hobzee\n\nAnd Radio airplay from Crissy Criss (BBC 1 Xtra, London) and Nerm &amp; D-Code (BBC Radio 1, London)\n\n\nProducer Ben Fawce and rising U.K. Hip Hop stars, Predator Prey team up for their debut release on USA.\n\n\nOriginal Mix\n\nThe boys create a perfect blend of beats, bass lines and vocals leaving enough sonic space for both the instrumental and the vocals to take their turns on centre stage.\n\nFusing horror movie atmospherics with Ed Rush &amp; Optical bass lines, Ben Fawce lays down a fresh outlook on the typical dance floor sound with post-production duties shared with Agent Smith.\n\nJalporte of Predator Prey rolls out his vocals with power and precision, creating a trademark sound for the pair.\n\n\nSoul Intent Remix\n\nSoul Intent injects his signature style into the tune with half speed beats and thrashy live cymbals to great effect.\n\nThe unsettling theme is maintained as he layers eerie strings and effects with speaker crunching bass lines and industrial atmospherics.\n\nThe vocals groove perfectly over the down tempo beats, combining to create a floor smashing reimagining of the original mix.\n\n\nSilhouettes\n\nBen Fawce lays down another Tech Step slammer with Silhouettes and continues to add his own spin on the sub genre.\n\nBuilding from an intro of ominous chords and stepping beats, Silhouettes arrives at the drop and slams you in the face with thunderous distorted bass lines and Hoover sounds.\n\nThe track continues to gain momentum as it smashes along like a bull in a china shop making full use of its array of sonic armoury.","torrent":{"xt":"urn:btih:618c5cb0be7089e19ddd64c64b91ca79ed116df2","amp;dn":"Ben+Fawce+Featuring+Predator+Prey+-+Onyx+-+Urban+Sickness+Audio+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"618c5cb0be7089e19ddd64c64b91ca79ed116df2","infoHashBuffer":{"type":"Buffer","data":[97,140,92,176,190,112,137,225,157,221,100,198,75,145,202,121,237,17,109,242]},"announce":[],"urlList":[]}}