{"title":"1776_and_Team_of_Rivals","uid":5377734,"size":302760219,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:61a023b415f4da05d28eb8cd8f0dd2274fe6a42e&amp;dn=1776_and_Team_of_Rivals&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sundalo50","files":4,"time":1266628072,"description":"My first torrent and an attempt to give back to a community that has given me so much. I hope you enjoy these audiobooks. \n\n\n\n1776 by David McCullough\n \nEsteemed historian David McCullough covers the military side of the momentous year of 1776 with characteristic insight and a gripping narrative, adding new scholarship and a fresh perspective to the beginning of the American Revolution. It was a turbulent and confusing time. As British and American politicians struggled to reach a compromise, events on the ground escalated until war was inevitable. McCullough writes vividly about the dismal conditions that troops on both sides had to endure, including an unusually harsh winter, and the role that luck and the whims of the weather played in helping the colonial forces hold off the world's greatest army.\n\n\nTeam of Rivals: The Political Genius of Abraham Lincoln by Doris Kearns Goodwin\n\nThe life and times of Abraham Lincoln have been analyzed and dissected in countless books. Do we need another Lincoln biography? In Team of Rivals, esteemed historian Doris Kearns Goodwin proves that we do. Though she can't help but cover some familiar territory, her perspective is focused enough to offer fresh insights into Lincoln's leadership style and his deep understanding of human behavior and motivation. Goodwin makes the case for Lincoln's political genius by examining his relationships with three men he selected for his cabinet, all of whom were opponents for the Republican nomination in 1860: William H. Seward, Salmon P. Chase, and Edward Bates.","torrent":{"xt":"urn:btih:61a023b415f4da05d28eb8cd8f0dd2274fe6a42e","amp;dn":"1776_and_Team_of_Rivals","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61a023b415f4da05d28eb8cd8f0dd2274fe6a42e","infoHashBuffer":{"type":"Buffer","data":[97,160,35,180,21,244,218,5,210,142,184,205,143,13,210,39,79,230,164,46]},"announce":[],"urlList":[]}}