{"title":"Avatar /2009/Super-Special Edition/DVD9/DD2.0-DD5.1+DTS/FINAL","uid":5428172,"size":6117080047,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:629311b31089b49ffaf6d53c1af2ea625e097a6d&amp;dn=Avatar+%2F2009%2FSuper-Special+Edition%2FDVD9%2FDD2.0-DD5.1%2BDTS%2FFINAL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rudi_k","files":-1,"time":1268320811,"description":"This torrent is the replacement for the earlier Torrent upload.\nAvatar /2009/Super-Special Edition/DVD9/DD2.0-DD5.1+DTS/NLSub\n\nIf you have downloaden thas earlier version you might want to remove that torrent file from your Torrent Client!!\nHowever, please keep all data files in place since this upload is about 97% identical.\nSeeding/Downloading will be much faster !!!\n\nMost Torrent Clients will check the existing files first and add missing or faulty parts.\nThe earlier version will therefore be corrected automatically !!\n\nIf for some reason the vts_01_1.vob will not be corrected automatically you might delete it manually.\nStop your torrent client and start it again !!!\n\n\n\n===========================================\n\n\n\nDVD Info :\n==========\nVideo : NTSC 16/9\nCompression : 3,7mbps avg !\nSource : Avatar 2009 DVDScr H264 AAC-SecretMyth (Kingdom-Release)\nSubs : Yes, NL SecretMyth (selectable)\nAudio : 2.0DD (192kbps), 5.1DD (448kbps) en DTS (768kbps)\nMenu : Yes, Retail style (Main, 3x Chapters, Settings, All with BG Sound)\n\n\n\n\nAudio Info :\n============\nThe surround sound is made with a Dolby Prologic II (movie) encoder which converts the original 2.0AAC to 6 channels.\nThe level of all 6 channels is afterwards fine-tuned to improve the surround sound to its maximum.\nThis all is made to a multi wav with a bitrate of 4608kbps which is about 5gB!\n\nThe L/R right speakers have a good channel separation.\nThe Center speaker is mainly used for the dialogs !\nThe Rear surround speakers are used for special surround affect and will sound clearly with the music.\nThe LFE is fine modulated and will add sufficient Bass !\n\nThis multi wav is there after Encoded using the Sony SoundForge Dolby Digital Encoder and the DTS Master Audio Encoder.\nThe final result is really great although it will never be as an original &quot;discreet&quot; surround track.\nNevertheless it will sounds really good and most people will classify it as &quot;perfect&quot; !!\nMy favorite audio track is 5.1DD since this track has a more fine bass.\nStill I know that DTS fanatics will prefer the DTS track.\n\nP.S. I have compared also other Avatar 5.1DD sounds however these do not sound as good is this one. The levels are not optimised and no dialog filtering is being used !\n\n\n\n\nFrame Rate :\n============\nThe frame rate of the DVD is 29,97fps.\nAlso the DVD-Screener and the source of this Custom DVD where both 29,97fps and therefore no additional jitter is introduced.\n\nP.S. An other popular Avatar DVD-5 version has a PAL framerate and this will add some unnessary jitter !\n\n\n\n\nOverall :\n=========\nThe video and audio quality are both very good.\nFurthermore the menu is really nice, just like retail.\n\nP.S. I have checked most Avatar DVD versions and this one is the best up till now !\n\n\n\n\nNote :\n======\nIf you want to burn it on a DVD5 or DVD9 please read the nfo or txt files.\nChecking your dvd-files using the sfv file is recommended !\n\n\n\n\nAgain : Do NOT forget to remove the earlier version from your Torrent Client\nDelete only the .torrent, keep the data files !\nThen start this FINAL version with the corrected vts_01_1.vob !!\n\n\n\nPlease don't hit and run.\nKeep seeding !!!\n\n","torrent":{"xt":"urn:btih:629311b31089b49ffaf6d53c1af2ea625e097a6d","amp;dn":"Avatar+%2F2009%2FSuper-Special+Edition%2FDVD9%2FDD2.0-DD5.1%2BDTS%2FFINAL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"629311b31089b49ffaf6d53c1af2ea625e097a6d","infoHashBuffer":{"type":"Buffer","data":[98,147,17,179,16,137,180,159,250,246,213,60,26,242,234,98,94,9,122,109]},"announce":[],"urlList":[]}}