{"title":"MILES DAVIS - COLLECTOR'S ITEMS [PRESTIGE- OJC]","uid":5310201,"size":38913878,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:62c0a33a26919771de3d1f98afd3bc5b9bd5e48a&amp;dn=MILES+DAVIS+-+COLLECTOR%5C%27S+ITEMS+%5BPRESTIGE-+OJC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"chrys7","files":1,"time":1264534832,"description":"One of Miles Davis' most sympathetic collaborators was tenor saxophonist Sonny Rollins, who shared his love for space, and his genius for melodic architecture. Rollins was only a few years Davis's junior when they first met, but Miles, by virtue of his extended stint with the Charlie Parker Quintet, was already viewed as an established stylist and leader.\n\nThis January 30, 1953, recording date introduces the fiery drummer Philly Joe Jones and teams Rollins with his idol Charlie Parker, who in a few choruses seems to presage the entire history of Sonny Rollins. Davis's &quot;Compulsion&quot; is a shifting, restless line, and after a leaping Davis solo, Parker charges in with a thick-toned line followed by a robust Rollins. Bird and Rollins double the melodic line on two takes of &quot;The Serpent's Tooth,&quot; the brisker second take being the more polished. Miles begins somewhat hesitantly on &quot;Round Midnight,&quot; but his classic core arrangement (with Dizzy's famous ending) is already in place, as Bird plays his best solo of the session.\n\nCOLLECTORS' ITEMS concludes with Miles and Sonny's final studio session together. Pianist Tommy Flanagan adds his special brand of harmonic intuition and swing, while Paul Chambers and Art Taylor round out a tightly coiled, elegant rhythm section. A muted Davis seems particularly inspired by the melody to Dave Brubeck's ballad &quot;In Your Own Sweet Way,&quot; and Rollins doubles up with masterly restraint. &quot;No Line&quot; is an equestrian event--light, fast, and swinging--while the slow riff tune &quot;Vierd Blues&quot; features a particularly soulful Davis on open horn, egged on by Chambers's subtle counterpoint; Rollins lays way back behind the beat, with lazy, billowing melodic fragments, only to swoop back through with bold harmonic flourishes.\n\nThese two dates, done three years apart in the Fifties, have Davis and Sonny Rollins as the linking figures. The historic 1st session, from 1953, is the second and last time Charlie Parker (using the nom de groove 'Charlie Chan') recorded on tenor saxophone. Additionally, this is the only time Parker and one of his most important disciples, Rollins, recorded together. On the extremely moving, seven minute 'Round Midnight', Rollins has the opening &amp; closing bridges, credited in the original notes to Parker. The 1956 date is as mellow and relaxed as the 1953 session was tense and neurotic. Rollins's growth as an individual is readily apparent, and Miles displays his prowess with a Harmon mute on Brubeck's 'In Your Own Sweet Way'. OJC/Fantasy Records.\n\nRecorded in New York on January 30, 1953 and March 16, 1956. Originally released on Prestige (7044).\n\nPersonnel: Miles Davis (trumpet); Sonny Rollins, Charlie Parker (tenor saxophone); Tommy Flanagan, Walter Bishop, Jr. (piano); Paul Chambers, Percy Heath (double bass); Philly Joe Jones, Art Taylor (drums).\n\nPersonnel: Miles Davis (trumpet); Sonny Rollins, Charlie Parker (tenor saxophone); Tommy Flanagan, Walter Bishop (piano); Paul Chambers, Percy Heath (bass); Art Taylor, Philly Joe Jones (drums).\n\nDown Beat - 4.5 Stars - Excellent Plus - &quot;...an important record...&quot;\n\nPLEASE SEED AS LONG AS YOU CAN, AND THE FIRST PERSON, WHO SEEDS MORE THAN 4-5 DAYS, AND WRITES ME AN EMAIL, BECOME A FREE JAZZ CD IN RAR AS A GIFT FROM ME.\nMY EMAIL ADDRESS: &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;f5969d878c86c2b59387909098949c99db9d80&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\nCOVER:\nhttp://img11.nnm.ru/d/a/6/a/8/da6a837904f0590a29a6ede8f669c60d_full.jpg\n\nENJOY IT!\nCHRISTIAN","torrent":{"xt":"urn:btih:62c0a33a26919771de3d1f98afd3bc5b9bd5e48a","amp;dn":"MILES+DAVIS+-+COLLECTOR%5C%27S+ITEMS+%5BPRESTIGE-+OJC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62c0a33a26919771de3d1f98afd3bc5b9bd5e48a","infoHashBuffer":{"type":"Buffer","data":[98,192,163,58,38,145,151,113,222,61,31,152,175,211,188,91,155,213,228,138]},"announce":[],"urlList":[]}}