{"title":"002- Coast to Coast-Ian Punnett- Shankar Vedantamwe","uid":5350347,"size":112838862,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:62cffde7f98138cf1273eb60f58e71a44c1b02fe&amp;dn=002-+Coast+to+Coast-Ian+Punnett-+Shankar+Vedantamwe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"panzerfaust69","files":1,"time":1265768666,"description":"The Hidden Brain\n02-06-10\nHost:Ian Punnett\nGuests:Shankar Vedantam\n\nIan Punnett welcomed science journalist Shankar Vedantam for a discussion into the 'hidden brain' -- a phrase he coined to describe the myriad brain functions that happen outside of our conscious awareness, but which nonetheless effect how we behave in everyday life. According to Vedantam, the hidden brain influences everything from how much we eat to our higher thinking and moral decisions, even the stocks we pick and votes we cast in elections.\n\n&quot;Politics is one of the realms in which our hidden brain does play a powerful role,&quot; Vedantam said. We believe our political decisions are made intentionally, based on issues, yet our unconscious bias toward physical attractiveness often ends up selecting the candidate we vote for, he explained. This bias extends beyond politics into other areas of our behavior which we think we have conscious control over.\n\nAs evidence, Vedantam referenced studies that show caretakers punish good-looking children less severely than unattractive kids. Other experiments demonstrate how people associate certain unfavorable traits with overweight people based solely on their size. This unconscious bias pervades our criminal justice system as well, Vedantam said, noting research that reveals dark-skinned African Americans convicted of murder are more than twice as likely to receive the death penalty than their lighter-skinned counterparts.\n\nTo explain the dichotomy between what we think we stand for and how we really act, Vedantam pointed to the work of a British psychologist who monitored the behavior of office workers at a tea and coffee station. The employees were notified by a conspicuously posted price chart how much they should place in an honor box for their drinks. Some weeks the price chart included a graphic of flowers, other weeks a photo of eyes. Vedantam said people were more likely to pay for drinks during weeks when the eyes were displayed, suggesting their hidden brain thought it was being watched.\n\nVedantam also reported on how our hidden brain assists with every day life, works in tandem with others around us, and can help people survive disaster situations, such as the World Trade Center attacks.\nWebsite(s):\n# hiddenbrain.org\nBook(s):\n# The Hidden Brain\n","torrent":{"xt":"urn:btih:62cffde7f98138cf1273eb60f58e71a44c1b02fe","amp;dn":"002-+Coast+to+Coast-Ian+Punnett-+Shankar+Vedantamwe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62cffde7f98138cf1273eb60f58e71a44c1b02fe","infoHashBuffer":{"type":"Buffer","data":[98,207,253,231,249,129,56,207,18,115,235,96,245,142,113,164,76,27,2,254]},"announce":[],"urlList":[]}}