{"title":"Rambo IV 2008 (NLsubs)(rocco) 2Lions-Team","uid":5420934,"size":4683295801,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:63c44eab765c1082a0c508cb5f0f809afadcd7d8&amp;dn=Rambo+IV+2008+%28NLsubs%29%28rocco%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rocco64","files":-1,"time":1268085269,"description":"\nVerenigde Staten / Duitsland\nActie / Thriller\n91 minuten\n\ngeregisseerd door Sylvester Stallone\nmet Sylvester Stallone, Julie Benz en Matthew Marsden\n\n\nDutch:\n\n\nVietnam-veteraan John Rambo leeft al geruime tijd in een afgezonderde levensstijl in Bangkok. Op een dag wordt hij ingehuurd door een groep christelijke zendelingen om hen per boot te vervoeren naar Birma. Niet veel later wordt het dorp waar de zendelingen hun humanitaire missie uitvoeren aangevallen. Dit komt Rambo te weten als hij door diezelfde christelijke beweging wordt ingehuurd om een groep huurlingen te brengen naar het punt waar hij ze heeft achtergelaten in Birma. Samen met het team gaat hij op zoek naar de vermiste zendelingen.\n\nEnglish:\n\nVietnam veteran John Rambo has survived many harrowing ordeals in his lifetime and has since withdrawn into a simple and secluded existence in Thailand, where he spends his time capturing snakes for local entertainers, and chauffeuring locals in his old PT boat. Even though he is looking to avoid trouble, trouble has a way of finding him: a group of Christian human rights missionaries, led by Michael Burnett and Sarah Miller, approach Rambo with the desire to rent his boat to travel up the river to Burma. For over fifty years, Burma has been a war zone. The Karen people of the region, who consist of peasants and farmers, have endured brutally oppressive rule from the murderous Burmese military and have been struggling for survival every single day. After some inner contemplation, Rambo accepts the offer and takes Michael, Sarah, and the rest of the missionaries up the river. When the missionaries finally arrive at the Karen village, they find themselves part of a raid by the sadistic Major Pa Tee Tint and a slew of Burmese army men. A portion of the villagers and missionaries are tortured and viciously murdered, while Tint and his men hold the remainder captive. Concerned by their disappearance, the minister in charge of the mission gathers a group of mercenaries and pleas Rambo transport them with his boat, since he knows their last exact location. But Rambo can't stay behind: he joins the team where he belongs, to liberate the survivors from the clutches of Major Tint in what may be one of his deadliest missions ever \n\n\nTitel           : Rambo 4 \nBron            : Blu-ray \nFormaat         : Dvd5\nAudio           : Engels DD\nOndertitels     : Nederlands\nSpeelduur film  : 91 minuten \nGenre           : Actie\nMenu            : Ja\nExtra's         : Ja\nCover en label  : Ja\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0462499/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0462499/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/34473&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/34473&lt;/a&gt;\n\n\n*****************************************\n\nBrought to you by rocco\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt;\n\n\n******************************************\nwanna see more check our Forum\n &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt;\n\n\n\n\n\n\n\nEnjoy \n2Lions-Team\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n\n********************************************* ","torrent":{"xt":"urn:btih:63c44eab765c1082a0c508cb5f0f809afadcd7d8","amp;dn":"Rambo+IV+2008+%28NLsubs%29%28rocco%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63c44eab765c1082a0c508cb5f0f809afadcd7d8","infoHashBuffer":{"type":"Buffer","data":[99,196,78,171,118,92,16,130,160,197,8,203,95,15,128,154,250,220,215,216]},"announce":[],"urlList":[]}}