{"title":"Islam and Women - Hamza Yusuf","uid":5372037,"size":179612904,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:664090cf533956a9b3fefe8392445fd4179291f8&amp;dn=Islam+and+Women+-+Hamza+Yusuf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"directgov","files":5,"time":1266456219,"description":"Islam And Women - with Muslim scholar and lecturer Hamza Yusuf.\n\nHamza Yusuf:\nHamza Yusuf Hanson was born in Washington State and raised in northern California. After exploring religion at an early age, he entered Islam at 18 and set out to study in England, United Arab Emirates, Saudi Arabia, Morocco, Algeria, and finally West Africa. He became fluent in the Arabic language and then began his studies of the traditional Islamic sciences under the tutelage of some of the greatest Muslim scholars of our age.\n\nAfter a sojourn of ten years abroad, Hamza Yusuf returned to the U.S. and took degrees in Nursing and Religious Studies. In 1996, he co-founded the Zaytuna Institute in order to teach the traditional sciences of Islam to people in the West. He serves as the director of the Institute and has translated several texts from Arabic for the Institute's curriculum.\n\nHe is recognized today as one of the most influential voices for Islam in the West and has advised several world leaders including the President of the United States and the head of the Arab League. Hamza Yusuf resides in northern California with his wife and children.\n\n\n\nPlease don't forget to leave feedback!\n\n...DirectGov","torrent":{"xt":"urn:btih:664090cf533956a9b3fefe8392445fd4179291f8","amp;dn":"Islam+and+Women+-+Hamza+Yusuf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"664090cf533956a9b3fefe8392445fd4179291f8","infoHashBuffer":{"type":"Buffer","data":[102,64,144,207,83,57,86,169,179,254,254,131,146,68,95,212,23,146,145,248]},"announce":[],"urlList":[]}}