{"title":"Csak egy kislÃƒÂ¡ny van a vilÃƒÂ¡gon (1930). Bela Gaal. Dvdrip","uid":5405631,"size":732410603,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:66786d1fb8c8740713601f8bbc9f4f699aa01110&amp;dn=Csak+egy+kisl%C3%83%C2%A1ny+van+a+vil%C3%83%C2%A1gon+%281930%29.+Bela+Gaal.+Dvdrip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"FelipeLobo","files":2,"time":1267579841,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0241331/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0241331/&lt;/a&gt;\n\nThis film is the first Hungarian sound film. a very rare gem of east european cinema.\n\nBÃƒÂ©la GaÃƒÂ¡l:\n\nDirector. He read law in Budapest, then in 1913 he completed the course on acting of the National Association for Acting. In 1914 he published a volume of poetry entitled KÃƒÂ³borlÃƒÂ¡sok. In 1918 he founded the MadÃƒÂ¡ch Theatre, which he became the director of. Between 1920-27 he is the director of Star. At the end of the silent film era he returned to the stage and became the leading director of BelvÃƒÂ¡rosi SzÃƒÂ­nhÃƒÂ¡z (Theatre of the Inner City). After the sound picture was introduced his interest turned towards the cinema again. He was the Director of the film school of the National Association for Films and he himself lectured. His true genre is comedy. He called attention to himself back in the twenties with a burlesque made based on the script of Lajos Zilahy, Rongyosok. There are two memorable movie hits associated with his name: MeseautÃƒÂ³ (1934) and the Budai cukrÃƒÂ¡szda (1935), having become a great name and pouring out the false romantic of the General Director and the typist. He filmed JÃƒÂ³kai novNM: Geiger, Will Born William Francis Geiger, New Rochelle New York. Lived all over the U.S. and Europe as the son of an undercover F.B.I. Agent. Attended Royal Academy of Dramatic Arts in London, England, UK. Attended Orange Coast Film/Video Academy. While at Orange Coast, wrote and directed &quot;In Love and War&quot; which won Silver Plaque at Chicago Film Festival. Worked in Rome, Italy as a Director's Apprentice. Wrote and Directed &quot;Red Man&quot; through Fly Filmmaking Program at the Seattle Film Festival. &quot;Red Man&quot; premiered on the Independent Film Channel's Shorts Program.\nFrom KG","torrent":{"xt":"urn:btih:66786d1fb8c8740713601f8bbc9f4f699aa01110","amp;dn":"Csak+egy+kisl%C3%83%C2%A1ny+van+a+vil%C3%83%C2%A1gon+%281930%29.+Bela+Gaal.+Dvdrip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66786d1fb8c8740713601f8bbc9f4f699aa01110","infoHashBuffer":{"type":"Buffer","data":[102,120,109,31,184,200,116,7,19,96,31,139,188,159,79,105,154,160,17,16]},"announce":[],"urlList":[]}}