{"title":"Death Inside Hitlers Bunker English DVD PAL SUBS.SWE,NOR.FIN.DAN","uid":5412578,"size":3028832587,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:66f342cf4a10c1a1b9c88aab224d8e059deead2f&amp;dn=Death+Inside+Hitlers+Bunker+English+DVD+PAL+SUBS.SWE%2CNOR.FIN.DAN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Kuthumi","files":63,"time":1267800116,"description":" in English . Philosopher Hannah Arendt wrote a seminal book on the rise of Nazism called &quot;The Banality of Evil.&quot; One of her basic premises is that evil doesn't appear in some monstrous Satanic battle, such as in Milton's &quot;Paradise Lost,&quot; but rather is the byproduct of historical developments that are made up of a compilation of mundane events and personal choices that together lead to evil outcomes. Hitler was a psychotic megalomaniac who viewed himself as the savior of the Aryan race. He was an odd candidate. He was a rather unattractive, dark-haired, short man, allegedly with only one testicle -- hardly anyone's Aryan fantasy. But he knew how to utilize scapegoating, lies, the suspension of civil liberties, mass extermination, torture, and war to seduce a German people who felt humiliated by the loss of World War I and the failure of the Weimar Republic. Filmed in the claustrophobic bunker and based on historically accurate accounts, &quot;Downfall&quot; is powerfully intense in its depiction of how monstrous historical movements are set in motion by fatally flawed people who are allowed absolute powers over life and death. &quot;Downfall&quot; represents the final hours of a nightmare that Europe experienced for far too many years. It emphasizes subtleties of character and personal interaction as the Third Reich disintegrates, within the confines of the infamous bunker (and occasional cinematic excursions into a crumbling Berlin, temporarily ruled by Hitler &quot;assassination squads.&quot;) This is a devastatingly provocative and engrossing film.","torrent":{"xt":"urn:btih:66f342cf4a10c1a1b9c88aab224d8e059deead2f","amp;dn":"Death+Inside+Hitlers+Bunker+English+DVD+PAL+SUBS.SWE%2CNOR.FIN.DAN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66f342cf4a10c1a1b9c88aab224d8e059deead2f","infoHashBuffer":{"type":"Buffer","data":[102,243,66,207,74,16,193,161,185,200,138,171,34,77,142,5,157,238,173,47]},"announce":[],"urlList":[]}}