{"title":"D.Batstone-Not For Sale: Return of Global Slave Trade and How to","uid":5387714,"size":317103126,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6716018d73e82986df00073c240567ccb281e40a&amp;dn=D.Batstone-Not+For+Sale%3A+Return+of+Global+Slave+Trade+and+How+to&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":-1,"time":1266945195,"description":"Not for Sale: The Return of the Global Slave Trade--and How We Can Fight It\n\nDavid Batstone (Author) \n\n\nProduct Description\n\nAward-winning journalist David Batstone reveals the story of a new generation of 21st century abolitionists and their heroic campaign to put an end to human bondage. In his accessible and inspiring book, Batstone carefully weaves the narratives of activists and those in bondage in a way that not only raises awareness of the modern-day slave trade, but also serves as a call to action.\n\nWith 2007 bringing the 200th anniversary of the climax of the 19th century abolitionist movement, the world pays tribute to great visionary figures such as William Wilberforce of the United Kingdom and American Frederick Douglass for their remarkable strides toward framing slavery as a moral issue that people of good conscience could not tolerate. This anniversary serves not only as a commemorative date for battles won against slavery, but also as a reminder that slavery and bondage still persist in the 21st century. \nAn estimated 27 million people around the globe suffer in situations of forced labor and commercial sexual exploitation from which they cannot free themselves. Trafficking in people has become increasingly transnational in scope and highly lucrative. After illegal drug sales and arms trafficking, human trafficking is today the third most profitable criminal activity in the world, generating $31 billion annually. As many as half of all those trafficked worldwide for sex and domestic slavery are children under 18 years of age.\n\n\n\nFrom the Back Cover\n\nAward-winning journalist David Batstone reveals the story of a new generation of 21st century abolitionists and their heroic campaign to put an end to human bondage. In his accessible and inspiring book The New Abolitionists, Batstone carefully weaves the narratives of activists and those in bondage in a way that not only raises awareness of the modern-day slave trade, but also serves as a call to action.\nWith 2007 bringing the 200th anniversary of the climax of the 19th century abolitionist movement, the world pays tribute to great visionary figures such as William Wilberforce of the United Kingdom and American Frederick Douglass for their remarkable strides toward framing slavery as a moral issue that people of good conscience could not tolerate. \nThis anniversary serves not only as a commemorative date for battles won against slavery, but also as a reminder that slavery and bondage still persist in the 21st century. An estimated 27 million people around the globe suffer in situations of forced labor and commercial sexual exploitation from which they cannot free themselves. \nTrafficking in people has become increasingly transnational in scope and highly lucrative. After illegal drug sales and arms trafficking, human trafficking is today the third most profitable criminal activity in the world, generating $31 billion annually. As many as half of all those trafficked worldwide for sex and domestic slavery are children under 18 years of age.\nBatstone tells the inspiring stories of a new generation of abolitionists arising among us to put a stop to human trafficking. The New Abolitionists tells the stories of rescued victims and their heroic rescuers, background briefings on human trafficking, and practical ideas that empower individuals and their communities to join the campaign for human freedom.\n\n\nAbout the Author\n\nDavid Batstone, Ph.D., is Professor of Ethics at the University of San Francisco. His book Saving the Corporate Soul &amp; (Who Knows?) Maybe Your Own won the prestigious Nautilus Award for Best Business Book in 2004. Batstone also serves as Senior Editor of a business magazine, Worthwhile, and was a cofounder of Business 2.0. Batstone appears regularly in USA Today's Weekend Edition as &quot;America's ethics guru.&quot; \n\nEditorial Reviews\n\nReview\n\nBatstone exposes the alarming rise of one of the great moral crises of the day, human slaver. His well-written accounts of victims and survivors will inspire you to join the growing twenty-first century abolitionist movement. \n-- Ambassador John Miller, director of the U.S. State Department's Office to Monitor and Combat Trafficking in Persons \n\nProduct Details\n\n    * Publisher: HarperOne; 1 edition (February 6, 2007)\n    * Language: English\n    * ISBN-10: 0061206717\n    * ISBN-13: 978-0061206719\n\nfor more trackers - use this torrent instead: &lt;a href=&quot;\nhttp://ifile.it/u8a91r6&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ifile.it/u8a91r6&lt;/a&gt;\nor\nhttp://ifile.it/u8a91r6/David_Batstone_-_Not_For_Sale_Return_of_Global_Slave_Trade-Audiobook-EN-2007-PHC.torrent\n","torrent":{"xt":"urn:btih:6716018d73e82986df00073c240567ccb281e40a","amp;dn":"D.Batstone-Not+For+Sale%3A+Return+of+Global+Slave+Trade+and+How+to","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6716018d73e82986df00073c240567ccb281e40a","infoHashBuffer":{"type":"Buffer","data":[103,22,1,141,115,232,41,134,223,0,7,60,36,5,103,204,178,129,228,10]},"announce":[],"urlList":[]}}