{"title":"Sanguepazzo DVD.Italian ( www.bt-italiatorrent.org ]","uid":5239140,"size":7900999680,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:6736d752d3647012704b5c9d94e46b2a03b7e65f&amp;dn=Sanguepazzo+DVD.Italian+%28+www.bt-italiatorrent.org+%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"italiatraker","files":1,"time":1261670400,"description":"www.bt-italiatorrent.org registratevi troverete film in dvd dvrip. giochi e molto altro a velocita massima\n\n\n\n\n\n\n\n\n\n\n\n\nTitolo originale: Sanguepazzo\n\nNazione: Italia\n\nAnno: 2008\n\nGenere: Drammatico\n\nDurata: 150 Min\n\nRegia: Marco Tullio Giordana\n\nCast: Monica Bellucci, Luca Zingaretti, Alessio Boni, Maurizio Donadoni, Giovanni Visentin, Luigi Diberti, Paolo Bonanni, Mattia Sbragia, Alessandro Di Natale, Tresy Taddei\n\nData di uscita: da stabilire\n\n\n\n\n20qnyav.jpg\n\n\n\n\n\nL'alba del 30 aprile 1945, cinque giorni dopo la Liberazione, vennero trovati nella periferia di Milano i cadaveri di Osvaldo Valenti e Luisa Ferida, giustiziati poche ore prima dai partigiani. Coppia celebre nella vita oltre che sullo schermo, Valenti e Ferida erano stati due divi di quel cinema dei &quot;telefoni bianchi&quot; che il fascismo aveva incoraggiato, incarnando quasi sempre personaggi ribaldi e negativi. Anche la loro vita privata era dominata dal disordine; entrambi cocainomani e, si diceva, sessualmente promiscui. Dopo l'armistizio dell'8 settembre 1943, quando il paese si spaccÃƒÂ² in due e i tedeschi da alleati si trasformarono in esercito d'occupazione, Valenti e Ferida risalirono al Nord e aderirono alla Repubblica di SalÃƒÂ², ultima incarnazione della follia mussoliniana. Si stabilirono prima a Venezia, dove girarono fortunosamente qualche film, poi a Milano dove - arruolati in una banda di torturatori - si dettero alla borsa nera. Perlomeno queste erano le voci. Consegnatisi ai partigiani pochi giorni prima della Liberazione, i due negarono ogni addebito. Valenti giustificÃƒÂ² i suoi traffici col bisogno continuo di stupefacenti, sminuÃƒÂ¬ le presunte malefatte attribuendole alla diffamazione e all'invidia. Il Comitato di Liberazione pretese una punizione esemplare. CosÃƒÂ¬ calÃƒÂ² il sipario su quei due attori un tempo celeberrimi; Valenti nel ruolo del villain, Ferida in quello della donna perduta. ChissÃƒÂ  che alle dicerie che li rovinarono non abbiano contribuito proprio i film che ne avevano costruito la leggenda, proprio i personaggi riprovevoli tante volte incarnati sullo schermo.\n\n\n\n2uos6ti.jpg\n\n\n\nLingue: italiano, inglese, spagnolo\n\nSottotitoli: italiano, inglese\n\nMenu: Si\n\nExtra: Si\n\nQualita: DVD 9 FULL ","torrent":{"xt":"urn:btih:6736d752d3647012704b5c9d94e46b2a03b7e65f","amp;dn":"Sanguepazzo+DVD.Italian+%28+www.bt-italiatorrent.org+%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6736d752d3647012704b5c9d94e46b2a03b7e65f","infoHashBuffer":{"type":"Buffer","data":[103,54,215,82,211,100,112,18,112,75,92,157,148,228,107,42,3,183,230,95]},"announce":[],"urlList":[]}}