{"title":"Astro Boy 2004 Vol. 1 ep. 01-12 dvdrip h264m4v","uid":5449434,"size":2270018354,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:67867789007180cbc44e68d989a09fe2a06c8575&amp;dn=Astro+Boy+2004+Vol.+1+ep.+01-12+dvdrip+h264m4v&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ABScbn","files":25,"time":1269128505,"description":"In the 1960s, Osamu Tezuka's ASTRO BOY became the first Japanese manga to be adapted into an anime series. This 2003 version offers a modern sci-fi update while still retaining the original's classic style (as well as incorporating some of the darker elements of the 1980s remake). The series follows a superhero robot named Astro, who fights crime in the &quot;retro-futuristic&quot; Metro City. Originally created by research scientist Dr. Tenma in the image of his deceased son, Astro was discarded with the scientist's realization that his son could never be replaced. Later discovered by the kindly Dr. O'Shay, Astro was revived and given a robot family, while O'Shay served as his mentor in the belief that humans and robots can and should get along with each other. Astro, however, is not like other robots--in addition to his superior strength and jet-rocket arms and legs, his brain is the most advanced in the world and is capable of feeling all human emotions. Astro is a reluctant superhero, fighting to keep the peace between robots and humans, and always coming to the city's rescue against all manner of nefarious evildoers. This collection presents the series' first volume of episodes.\n","torrent":{"xt":"urn:btih:67867789007180cbc44e68d989a09fe2a06c8575","amp;dn":"Astro+Boy+2004+Vol.+1+ep.+01-12+dvdrip+h264m4v","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67867789007180cbc44e68d989a09fe2a06c8575","infoHashBuffer":{"type":"Buffer","data":[103,134,119,137,0,113,128,203,196,78,104,217,137,160,159,226,160,108,133,117]},"announce":[],"urlList":[]}}