{"title":"Surgical Spirit Series 1","uid":5313022,"size":1761620015,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:67a59932e7720bf30ea7acc61cc1c6d16bfceba6&amp;dn=Surgical+Spirit+Series+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"shogun55","files":7,"time":1264618218,"description":"Surgical Spirit is a British sitcom starring Nichola McAuliffe and Duncan Preston that lasted for seven series over six years. It was written by Peter Learmouth, Graeme Garden, Raymond Dixon, Annie Bruce, Annie Wood and Paul McKenzie. It was made for the ITV network by Granada Television.\n\nThis long-running, and largely successful, sitcom was based around Sheila Sabatini, a senior surgeon at the Gillies Hospital, whose verbal skills have most people running for cover. She dominated the operating theatre, while at home she was divorcing her Italian husband, Remo, with whom she had a son Daniel. She was also a gossip, often gossiping with her best friend and surgery administrator Joyce Watson. One of the major themes in the programme was her developing relationship with Jonathan Haslam, the anaesthetist. At the end of the sixth series, they married and she had become Director of Surgery, while her son had become a medical student at the hospital, much to her annoyance. Granada Television decided to decommission this sitcom after the seventh series, despite its success.\n\nThis is the 1st of seven series I shall be uploading, thanx to 'Promo' the original upper of this series, these are a mix of mpeg's &amp; AVI's as these.\nenjoy Shogun\n","torrent":{"xt":"urn:btih:67a59932e7720bf30ea7acc61cc1c6d16bfceba6","amp;dn":"Surgical+Spirit+Series+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67a59932e7720bf30ea7acc61cc1c6d16bfceba6","infoHashBuffer":{"type":"Buffer","data":[103,165,153,50,231,114,11,243,14,167,172,198,28,193,198,209,107,252,235,166]},"announce":[],"urlList":[]}}