{"title":"Living Colour - Glamour Boys  (2nafish)","uid":5426872,"size":195577860,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:67ba8a82ba005e1591dc8879457ba29191fb1482&amp;dn=Living+Colour+-+Glamour+Boys++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1268285808,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Glamour Boys&quot; is a song by the funk metal band Living Colour and the second single from their 1988 debut album Vivid. It was nominated the Grammy for Best Rock Performance by a Duo or Group with Vocal in 1990\n\nLyrically, &quot;Glamour Boys&quot; discusses young men obsessed with aspects of high society such as clothing and parties. The chorus aggressively shouts &quot;I ain't no glamour boy - I'm fierce!&quot;\n\nVivid is Living Colour's debut album, which was released on May 3, 1988. The band was discovered by Mick Jagger while playing a show at the legendary punk club CBGB's in 1987. They attacked the Eurocentrism and racism of America with their music and were considered &quot;unique&quot; by the mainstream media. The fact that Living Colour is an all-black heavy metal band drew much attention to the band and the album, which contained three singles and became one of the most popular albums of 1988, reaching #6 on the Billboard 200 and certified double platinum by the RIAA. The band was immediately launched into superstar status and would receive a Grammy for their next studio release. The song &quot;Funny Vibe&quot; features a cameo appearance from Public Enemy's Chuck D and Flavor Flav. Vivid is included in the book 1001 Albums You Must Hear Before You Die. It also contains a cover version of the Talking Heads' &quot;Memories Can't Wait.&quot;\n\nLiving Colour is an American funk metal band from New York City, formed in 1983. Stylistically, the band's music is a creative fusion influenced by heavy metal, funk, hard rock, free jazz, hardcore punk and hip hop (although the band are frequently tagged as being a &quot;hard rock&quot; act). Their lyrics range from the personal to the political, in some of the latter cases attacking the Eurocentrism and racism of America. The band were prominent members of the Black Rock Coalition during the late 1980s and early 1990s (a movement which also featured Fishbone, and 24-7 Spyz).\n\nLiving Colour rose to fame with their debut album Vivid in 1988. Although the band scored a number of hits, they are best remembered for their anthemic single &quot;Cult of Personality&quot;, which won a Grammy Award for Best Hard Rock Performance in 1989, and their highest charting single &quot;Type&quot;. They were also named Best New Artist at the 1989 MTV Video Music Awards. After disbanding in 1995, Living Colour reunited in 2000.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:67ba8a82ba005e1591dc8879457ba29191fb1482","amp;dn":"Living+Colour+-+Glamour+Boys++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67ba8a82ba005e1591dc8879457ba29191fb1482","infoHashBuffer":{"type":"Buffer","data":[103,186,138,130,186,0,94,21,145,220,136,121,69,123,162,145,145,251,20,130]},"announce":[],"urlList":[]}}