{"title":"Morph Vox Pro","uid":6308738,"size":6947027,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:67c5ad850755fcdddf64d86a3c9c460a6bc01d9a&amp;dn=Morph+Vox+Pro&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":6,"uploader":"evilcracker","files":1,"time":1302453023,"description":"\tMorphVOXTM Pro will change your voice online and in-game. Take your voice-changing to a new level with superior voice-learning technology, background cancellation, and sound quality. \n\nDownload free voice and sound packs adding hundreds of new voices and sounds to MorphVOX. Tweak each of these voices to your heart's content to produce many voice combinations. \n\nTry out the &quot;Backgrounds&quot; feature which lets you add any background sound while you talk. Fool your friends: sound like you're in the middle of a traffic jam or shopping at the mall. \n\nSuperb voice changing algorithms and ultra-quiet background cancellation make it one of the cleanest-sounding voice changers available on the market. Its high-quality sound is perfect for creating voice-overs for your latest video or audio project. \n\nOptimized for online games. Use it for changing your voice to role-play and add fun to online games. Sound like the character you play in-game whether you choose to be a grumpy dwarf or a mighty giant. \n\n\nThere are instructions included, and they are easy to follow and get a full version free. Post comments and tell me what you think. Don't forget to SEED!","torrent":{"xt":"urn:btih:67c5ad850755fcdddf64d86a3c9c460a6bc01d9a","amp;dn":"Morph+Vox+Pro","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67c5ad850755fcdddf64d86a3c9c460a6bc01d9a","infoHashBuffer":{"type":"Buffer","data":[103,197,173,133,7,85,252,221,223,100,216,106,60,156,70,10,107,192,29,154]},"announce":[],"urlList":[]}}