{"title":"DB Damals","uid":5368110,"size":731920384,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:684c65c3a24b596d264ea6a01956079a6e27f3ea&amp;dn=DB+Damals&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"germantrains","files":-1,"time":1266335954,"description":"DB Damals\n\nDank der Begeisterung fÃƒÂ¼r sein Metier hat Anfang der siebziger Jahre der Eisenbahningenieur Ludwig Gackenholz mit seiner Filmkamera ein interessantes Zeitdokument ÃƒÂ¼ber die DB erstellt. Besonders die letzten Dampflokhochburgen waren Ziel seiner Unternehmungen. \n\nTeil 1 Der SÃƒÂ¼den und Teil 2 Der Norden im Paket auf einer DVD. \nEin Querschnitt durch die ZugfÃƒÂ¶rderung Anfang der siebziger Jahre Dank der Begeisterung fÃƒÂ¼r sein Metier hat Anfang der siebziger Jahre der Eisenbahningenieur Ludwig Gackenholz mit seiner Filmkamera ein interessantes Zeitdokument ÃƒÂ¼ber die DB erstellt. Besonders die letzten Dampflokhochburgen waren Ziel seiner Unternehmungen. Erleben Sie im Nordschwarzwald die letzten preuÃƒÅ¸. P 8 und T 18 und im Raum NÃƒÂ¼rnberg Loks der Baureihen 64 und 86. Andere Stationen sind Crailsheim mit der Neubaudampflok Baureihe 23 und Ulm mit der Baureihe 03. In SÃƒÂ¼dbayern gehÃƒÂ¶rten E 16, E 18, E 94 und E 445 zum vertrauten Bild. Aber auch E 19 und Vorserienloks der E 10 wurden an ihren Einsatzorten aufgesucht. \nSchwerpunkte seiner Unternehmungen im Norden waren die Strecken Hamburg - Westerland und Rheine - Emden. SchÃƒÂ¶ne Motive boten die HochbrÃƒÂ¼cke ÃƒÂ¼ber den Nord-Ostsee-Kanal und der Eisenbahndamm zur Insel Sylt. Auch die Mitfahrt auf dem FÃƒÂ¼hrerstand von Dampfloks vermittelt eindringlich die EisenbahnatmosphÃƒÂ¤re jener Jahre. Die ZÃƒÂ¼ge der Deutschen Reichsbahn, bespannt mit den Baureihen 01 und 015 boten bei Bebra, Helmstedt und Hamburg interessante Motive. Szenen mit der BR 94 auf der Rampe zwischen Dillenburg und GÃƒÂ¶nnern lassen Erinnerungen an eine lÃƒÂ¤ngst abgebaute Strecke wieder lebendig werden. \n\nViel SpaÃƒÅ¸!","torrent":{"xt":"urn:btih:684c65c3a24b596d264ea6a01956079a6e27f3ea","amp;dn":"DB+Damals","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"684c65c3a24b596d264ea6a01956079a6e27f3ea","infoHashBuffer":{"type":"Buffer","data":[104,76,101,195,162,75,89,109,38,78,166,160,25,86,7,154,110,39,243,234]},"announce":[],"urlList":[]}}