{"title":"Final Fantasy Crystal Chronicles Echoes Of Time [PAL] [WiiTorren","uid":5263790,"size":2817899416,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:6a82e21e5fec2be4eccb44d969659da6b8c7a0cf&amp;dn=Final+Fantasy+Crystal+Chronicles+Echoes+Of+Time+%5BPAL%5D+%5BWiiTorren&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ecabuk","files":-1,"time":1262821277,"description":"NAME:Final Fantasy Crystal Chronicles Echoes Of Time [PAL]\nLANG:MULTI 5\nREGION:PAL\nSIZE: 99mb x 27\n      14mb x 1\n      \n      Total:2.62GB\n\n\nProduct Description\n\nMore than just the latest chapter in the Final Fantasy saga, Final Fantasy Crystal Chronicles: Echoes of Time is an innovative new concept in multiplayer gaming that enables Wii and DS users to play side by side for the first time. This breakthrough in gaming connectivity allows players on both Nintendo platforms to journey together in the fantastical action RPG flavored world of the beloved Final Fantasy Crystal Chronicles.\nPlay anytime, anywhere, and with anyone. Multiplayer connectivity reaches new heights in Final Fantasy Crystal Chronicles: Echoes of Time, where players can team up or compete with friends and players around the world.\nThe intuitive control scheme introduced in Final Fantasy Crystal Chronicles: Ring of Fates returns, now adapted to Wii for double the action.\nPlayers can switch between single and multiplayer modes at any time while playing, enjoying two great gaming options in one integrated experience.\nA personalized hero can be generated from a choice of the four familiar races of the series; Clavats, Lilties, Selkies or Yukes. Players joining from the Wii can also introduce their Miis to the world of Final Fantasy Crystal Chronicles.\nCreate and customize materials, armor and equipment for characters with tailored appearances and abilities no two heroes will be the same.\nPlayers can continue to enjoy the game even after completing the main adventure, as the New Game+ feature provides increased difficulty and better items with every new round.\nA vast selection of quests delivers hours of fun.","torrent":{"xt":"urn:btih:6a82e21e5fec2be4eccb44d969659da6b8c7a0cf","amp;dn":"Final+Fantasy+Crystal+Chronicles+Echoes+Of+Time+%5BPAL%5D+%5BWiiTorren","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a82e21e5fec2be4eccb44d969659da6b8c7a0cf","infoHashBuffer":{"type":"Buffer","data":[106,130,226,30,95,236,43,228,236,203,68,217,105,101,157,166,184,199,160,207]},"announce":[],"urlList":[]}}