{"title":"Equis.(X).[DVDRip][Spanish]","uid":5228416,"size":733468672,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6b9e38b9c4332ebadd3ba0a6965cb2084bc17653&amp;dn=Equis.%28X%29.%5BDVDRip%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zurera","files":1,"time":1261227642,"description":"DirecciÃƒÂ³n y guiÃƒÂ³n: Luis MarÃƒÂ­as.\nPaÃƒÂ­s: EspaÃƒÂ±a.\nAÃƒÂ±o: 2002.\nDuraciÃƒÂ³n: 95 min.\nInterpretaciÃƒÂ³n: Antonio Resines (Javier), Esperanza Roy (Natalia), MarÃƒÂ­a AdÃƒÂ¡nez (Alicia), Manuel Galiana (Fernando), Marta Belaustegui, Pere ArquilluÃƒÂ© (Santiago), Janfri Topera, Antonio Dechent.\nProducciÃƒÂ³n: CÃƒÂ©sar BenÃƒÂ­tez.\nMÃƒÂºsica: Paco Musulen y Luis Elices.\nFotografÃƒÂ­a: Federico Ribes.\nMontaje: Fidel Collados.\nDirecciÃƒÂ³n artÃƒÂ­stica: Eduardo Hidalgo Jr.\n\n\n\n\n\n\nEsta es una pesadilla urbana. Ocurre en Madrid, en verano, en medio de una sofocante ola de calor.\nEl inspector de un grupo de homicidios despierta una maÃƒÂ±ana en una casa que no es la suya, en una cama que no es la suya y al lado de una mujer desconocida, empapado de sudor. Padece una resaca tremenda, algo habitual en ÃƒÂ©l, y no recuerda nada de lo ocurrido en esta ÃƒÂºltima noche. Absolutamente nada. Abandona la casa como un ladrÃƒÂ³n, con la angustiosa sensaciÃƒÂ³n de que esta noche ha sucedido algo grave.\nEn un deplorable estado fÃƒÂ­sico y mental se presenta en ComisarÃƒÂ­a. Debe investigar un asesinato que ha tenido lugar esta noche.\nSe traslada al escenario del crimen. Casualmente en la misma calle donde ÃƒÂ©l ha amanecido. Y comienza la investigaciÃƒÂ³n... Lo que en un primer momento es una agobiante sospecha, empieza a tomar forma. Todos los indicios de su investigaciÃƒÂ³n le seÃƒÂ±alan a ÃƒÂ©l como autor del asesinato. Sin embargo, no existe mÃƒÂ³vil. JamÃƒÂ¡s conociÃƒÂ³ a la vÃƒÂ­ctima, ni de referencia. Pero poco a poco, empieza a verse arrastrado por el esclarecimiento de los hechos.\nPor una parte, sus compaÃƒÂ±eros sospechan primero de su actitud, luego del mÃƒÂ©todo de investigaciÃƒÂ³n y por ÃƒÂºltimo de su posible implicaciÃƒÂ³n. Por otra parte, su vida familiar, ya un tanto deteriorada, se ve marcada de forma irremediable por los sucesos de esa noche. Y ademÃƒÂ¡s, el creciente sentimiento de culpa le lleva a relaciones con la familia de la vÃƒÂ­ctima, sobre todo con su hermana... Necesita redimirse desesperadamente, sin saber cÃƒÂ³mo. Hasta que elementos ajenos terminan de complicar esta precaria situaciÃƒÂ³n. La mujer que pasÃƒÂ³ esa noche con ÃƒÂ©l reaparece dispuesta al chantaje, un posible testigo toma cartas en el asunto, se vislumbran otros.\nLas clavijas empiezan a cerrarse en torno a nuestro protagonista, un hombre atormentado por la culpa, pero que no puede sentirse del todo culpable. La ÃƒÂºnica soluciÃƒÂ³n a su alcance es demostrar su inocencia... o culpabilidad.","torrent":{"xt":"urn:btih:6b9e38b9c4332ebadd3ba0a6965cb2084bc17653","amp;dn":"Equis.%28X%29.%5BDVDRip%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b9e38b9c4332ebadd3ba0a6965cb2084bc17653","infoHashBuffer":{"type":"Buffer","data":[107,158,56,185,196,51,46,186,221,59,160,166,150,92,178,8,75,193,118,83]},"announce":[],"urlList":[]}}