{"title":"The Legend Of Zelda Twilight Princess [PAL] [WiiTorrentZ]","uid":5275562,"size":1394224763,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:6d4ba96be29e40a96588f2efa6170819d44df043&amp;dn=The+Legend+Of+Zelda+Twilight+Princess+%5BPAL%5D+%5BWiiTorrentZ%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ecabuk","files":-1,"time":1263368058,"description":"NAME: The Legend Of Zelda: Twilight Princess\nLANG: MULTI-5\nREGION: PAL\nSIZE: 99mb x 13\n      43mb x 1\n      \n      Total:1.29GB\n\n\nProduct Description\nThe Legend of Zelda: Twilight Princess Wii The most epic Zelda ever launches with Wii! When an evil darkness enshrouds the land of Hyrule, a young farm boy named Link must awaken the hero -- and the animal -- within. When Link travels to the Twilight Realm, he transforms into a wolf and must scour the land with the help of a mysterious girl named Midna. Besides his trusty sword and shield, Link will use his bow and arrows by aiming with the Wii Remote controller, fight while on horseback and use a wealth of other items, both new and old.\n-Arm Link The Wii Remote and Nunchuk controllers are used for a variety of game activities from fishing to projectile-weapon aiming. The game features incredibly precise aiming control using the Wii Remote controller. Use the controllers for sword swings, spin attacks and shield shoves.\n-Thrilling Adventure Players ride into battle against troops of foul creatures and wield a sword and shield with the Wii Remote and Nunchuk controllers, then take on massive bosses that must be seen to be believed.\n-Mind &amp; Muscle Many puzzles stand between Link and the fulfillment of his quest, so players must sharpen their wits as they hunt for weapons and items.","torrent":{"xt":"urn:btih:6d4ba96be29e40a96588f2efa6170819d44df043","amp;dn":"The+Legend+Of+Zelda+Twilight+Princess+%5BPAL%5D+%5BWiiTorrentZ%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d4ba96be29e40a96588f2efa6170819d44df043","infoHashBuffer":{"type":"Buffer","data":[109,75,169,107,226,158,64,169,101,136,242,239,166,23,8,25,212,77,240,67]},"announce":[],"urlList":[]}}