{"title":"Cyber Update Feb.2010-------FM-8043-8439-8603","uid":5401535,"size":1327263399,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:6df8608a42673f0fc16f725946176958f53ab67f&amp;dn=Cyber+Update+Feb.2010-------FM-8043-8439-8603&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"merzedes","files":366,"time":1267401900,"description":"From Kink.com      (Fuckingmachines) + Pics\n\n\nThis week a first for the friday updates - two amateur girls getting it on together in front of our cameras. Both nearly squeak with newness and they touch each other and fuck machines. Seda is clearly more experienced and adventurous as she settles two dongs into her pussy and ass for a double penetration orgasm while Yasmine kisses and rubs her clit. The Sybian steals the show however as both girls tease and deny each other powerful orgasms. \n\n\nScreens  &lt;a href=&quot; http://www.fuckingmachines.com/site/shoot.jsp?shootId=8043&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.fuckingmachines.com/site/shoot.jsp?shootId=8043&lt;/a&gt;\n\n\nHalie is brand new and about to explode in this industry. See her here getting her mind, body and pussy blown by the machines. She cums herself into a mess and there is nothing sexier than watching this oiled up, big natural Double D babe cum on the Sybian. \nHaile starts off slow and then cranks the machine until the dildo is completely gone inside her. I have to hold the machine from the back end to prevent Halie from swallow the metal shaft. It's like the gate at the horse track, a hole in the dam, the cap on a radiator - a storm is a-coming to porn and it's Halie James. Pound, cum, pound some more a big storm indeed.\n\n\nScreens &lt;a href=&quot; http://www.fuckingmachines.com/site/shoot.jsp?shootId=8439&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.fuckingmachines.com/site/shoot.jsp?shootId=8439&lt;/a&gt;\n\n\nTasha, Tasha, Tasha. She's blond, hot and willing. She starts off strong, cumming in about 15 seconds with the magic wand and then again with a little hand held machine. But Tasha makes a rookie choice and bites off more than her pussy can take when she asks for her favourite position and really deep, hard pounding. Within minutes into the scene with the Bunny Fucker on high, Tasha calls it. You can't win them all. But she does get points for trying and for cranking the machine up all the way. \nHer final triumph is with the Sybian AND the Hytachi together bombarding her clit as she bounces up and down on the machine like it's a pogo stick and looks right into the camera lens while she finds 4 orgasms deep within her. She nearly growls as she looks you in the eye.\n\n\nScreens &lt;a href=&quot; http://www.fuckingmachines.com/site/shoot.jsp?shootId=8603&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.fuckingmachines.com/site/shoot.jsp?shootId=8603&lt;/a&gt;\n\n\n\nCheers  :-)","torrent":{"xt":"urn:btih:6df8608a42673f0fc16f725946176958f53ab67f","amp;dn":"Cyber+Update+Feb.2010-------FM-8043-8439-8603","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6df8608a42673f0fc16f725946176958f53ab67f","infoHashBuffer":{"type":"Buffer","data":[109,248,96,138,66,103,63,15,193,111,114,89,70,23,105,88,245,58,182,127]},"announce":[],"urlList":[]}}