{"title":"THOSE WHO HELP Are Helped.","uid":5219017,"size":48480431,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:700edde494f623999f5d9b69d31816690b926471&amp;dn=THOSE+WHO+HELP+Are+Helped.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":8,"time":1260860009,"description":"a warning in three parts by Michael Manning.\n\nthose who help are helped.\n\n\nHere is a copy of a letter that I sent out earlier today.\n\n\n\nThe Pres. of the US and company did something very foul (I think?) on a day that the ancient Jews held as sabbath. --- I need you to look up 'Norway Spiral' videos, Dec. 9, 2009, on Google. Don't be frightened, okay?\nHe/they have tried to exalt himself/themselves above heaven (I don't know if its black technology or what). Blocking out the heavens with chemtrails, flattering themselves on sabbath days, so on.\nThe stars that were over that land did something very strange that day. I'm honestly not entirely sure what it means.\nIn essence, I feel that these men have tried to hedge their bets. But in so doing, may have created cataclysm.\n\nYou have to know that the essence of your Spirit, the Eternal Spirit, transcends all objects. --- The Universe is both beginning and end, --- and the objects that arise out of it are almost as placeholders for an Eternal function that yet transcends those objects. That Spirit is all that is, and yet beyond it, eternally. You will continue, --- you may lose your flesh, but your Spirit cannot be undone.\nI write these things to you because you've always been dear to me, and I feel like I have an obligation, from God, to tell you these things. Hope that I am wrong.\nI don't ask you to believe me, --- I ask you to engage your logic. Think about these truths, and think about what was done over that land, Norway, --- and if you have a knowledge of astrology, you can even look at those stars.\nThey tried to (I think) syphon something into (or perhaps out of) those people, who were doing a something strange on a Holy Day (that I'm pretty sure they know about themselves). --- A Sabbath of the Moon, as the Jews held.\n\n\nGod Bless you in all you do,\nAnd God speed,\n~Michael Manning.\n","torrent":{"xt":"urn:btih:700edde494f623999f5d9b69d31816690b926471","amp;dn":"THOSE+WHO+HELP+Are+Helped.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"700edde494f623999f5d9b69d31816690b926471","infoHashBuffer":{"type":"Buffer","data":[112,14,221,228,148,246,35,153,159,93,155,105,211,24,22,105,11,146,100,113]},"announce":[],"urlList":[]}}