{"title":"Social Conflict - Struggle For Existence (Acid Punk)","uid":5277640,"size":33341139,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7018d49d47ec81b100ea9ab1f2791c8821a80b03&amp;dn=Social+Conflict+-+Struggle+For+Existence+%28Acid+Punk%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"johnnybleed","files":12,"time":1263430595,"description":"MORE INFO:\nSOCIAL CONFLICT'S MYSPACE:\n\nNEW MUSIC VIDEO:\n\n\nTHE DARKNESS OF &quot;BLACK SABBATH&quot; WITH A HEAD FULL OF ACID BRINGING OUT THE SOUND OF &quot;THE DOORS&quot; ROOTED WITH THE CULTURE AND SOUND OF PUNK ROCK MUSICK...\n\nTHE BAND FORMED IN SEPTEMBER OF 1995 IN THE BACKYARD OF LOS ANGELES INSPIRED BY THE IMPACT THAT MUSICK HAS ON THE SOUL, ESPECIALLY THE DARKER AND MORE PSYCHADELIC SIDE. THE GUILTY PARTIES ARE : JESSE MURDER (LEAD VOCALS &amp; guitar), MIGUEL CONFLICT (DRUMS &amp; vocals), JEROME a.k.a. JOHNNY BLEED (LEAD GUITAR &amp; vocals) and THE VOID (BASS GUITAR). THEY HAVE PLAYED WITH BANDS LIKE: THE SUBHUMANS (ENGLAND), NAKED AGGRESSION, PISS ANT, CONFLICT (ENGLAND), TOTAL CHAOS, ICONS OF FILTH (ENGLAND), COUNTER ATTACK (GERMANY), TRAGEDY, BLOODCUM, HARUM SCARUM (PORTLAND), RESIST &amp; EXIST, CONTRAVENE (ARIZONA), ARMISTICE, SUBSISTENCIA, KONTRAATAQUE, CIRIL, ALL SYSTEMS FAIL (SALT LAKE CITY), BLOODY PHOENIX, SIN REMEDIO, SEVEER TIRE DAMAGE (ARIZONA), CLUSTERFUX, THE LAST PRIORITY, RABIA AL SISTEMA, HUMAN EXTINCTION, DAY OF THE SICK (OKLAHOMA), KALMEX AND THE RIFF MERCHANTS, INHUMANE NATURE, SCARRED FOR LIFE, LA FRACCION (FRANCE), PHOBIA, RESISTANT CULTURE, NO REFORM (MORENO VALLEY), HARVEST OF DISCONTENT (IDAHO), UNION 13, SUGAR PUSS, OPPOSITION, AVERSION, SET ASIDE, TEENAGE RAGE, MAJORITY RULES, TERRORISM, MAD CAP, MEDIA BLITZ, SOCIETY'S DECAY, OUI SUK, OUTRANK, CRUCIAL JUSTICE, LESTER, RIDICULE, NO PRIORITY, INCOMPLETE, BRUISE VIOLET, SCHIZM, CORRUPT NOSTALGIA, DIFFERENCE OF OPINION, THE DOLEMITE PROJECT, SMD, THREATENING VERSE, SUBURBAN CHAOS, BEWARE, P-47, DECONTROL, THE FIXTURES, L.A. ASSASSINS, AFTER THE BOMB, THE VIOLENT THREATS, BLASPHEMY SQUAD, TRUE HUMAN DESIGN, AND COUNTLESS OTHERS.\n &quot;STRUGGLE FOR EXISTENCE,&quot; (WITH 11 TRACKS AND FOUR POEMS WRITTEN AND RECITED BY EACH INDIVIDUAL MEMBER). THEY ARE CURRENTLY WORKING ON A NEW ALBUM WITH 12 TRACKS ENGINEERED BY PAUL &quot;SCREAMERS&quot; ROESSLER, WHICH WILL BE RELEASED IN EARLY 2010.  DROP A COMMENT FOR SUPPORT.............FOREVER IN STRUGGLE!!!\n\nType Razorblade Mary intoand see a\nSneek peak of the new album engeinered by Paul Roessler of The Screamers.\nComing in Spring 2010\n","torrent":{"xt":"urn:btih:7018d49d47ec81b100ea9ab1f2791c8821a80b03","amp;dn":"Social+Conflict+-+Struggle+For+Existence+%28Acid+Punk%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7018d49d47ec81b100ea9ab1f2791c8821a80b03","infoHashBuffer":{"type":"Buffer","data":[112,24,212,157,71,236,129,177,0,234,154,177,242,121,28,136,33,168,11,3]},"announce":[],"urlList":[]}}