{"title":"Merlin Seizoen 2 DVD 4 *Season finale* (E 11,12,13) NL SUBS  2Li","uid":5381984,"size":4478842832,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:70907b41e99d656143393fb1b95246afe2204aaf&amp;dn=Merlin+Seizoen+2+DVD+4+%2ASeason+finale%2A+%28E+11%2C12%2C13%29+NL+SUBS++2Li&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Pioen","files":-1,"time":1266772626,"description":"Merlin Seizoen 2 DVD 4 *Season finale* (E 11,12,13) NL SUBS      \n\n\nTV-SERIE (13 afleveringen = 4 dvd's)\n\nMerlin is een jongen van rond de 20 die van het platteland verhuist naar het hof van koning Uther, waar Merlin bij zijn oude oom Gaius intrekt. Gaius is de vertrouwde hofarts van de koning. Merlin heeft een geheim: hij heeft magische krachten. Koning Uther heeft echter tovenarij ten strengste verboden in zijn hele koninkrijk.\n\nMerlin ontdekt dat zijn lot verbonden is met Arthur, de zoon van de koning. Zonder dat Arthur dit weet, probeert Merlin hem dan ook te beschermen. Zijn magische krachten mogen daarbij niet onthuld worden, want de koning executeert iedereen die tovenarij bedrijft.\n\nPersonages en avontuur\n\nmerlinMerlin gaat om de goed uitgewerkte personages en de avonturen die zij beleven. Koning Uther is betrokken met het lot van zijn onderdanen, maar is zo bang voor de magie die ooit zo gewoon was in zijn koninkrijk, dat hij alles doet om het uitgebannen te houden. Daarin is hij meedogenloos en dat botst nogal eens met de mensen in zijn hof.\n\nPrins Arthur is heldhaftig en de beste zwaardvechter van het rijk. Hij zal ooit koning worden en heeft nu al het beste voor met zijn toekomstige onderdanen. Hij is echter ook wat verwaand en onbezonnen. Zijn vader heeft een pleegdochter genaamd Morgana, die een aparte band heeft met Arthur en de nodige invloed op de koning. Haar jonge dienares heet Guinevere en lijkt als een blok te vallen voor de jonge Merlin.\n\nMerlin zelf is totaal geen vechter, maar zeker zo moedig als het aankomt op het helpen van anderen. Voorzichtigheid heeft hij echter niet altijd hoog in het vaandel staan. Zijn oom Gaius kent als enige zijn geheim en probeert hem in toom te houden en te begeleiden.\n\nEr zijn nogal wat gevaren die Camelot, het slot van de koning, bedreigen en soms in het bijzonder prins Arthur, waardoor Merlin het maar druk heeft met stiekem beschermen van de prins. Daar tussendoor beleeft hij echter ook veel andere dingen.\n\nAfleveringen\n\nS02E11 The Witch's Quickening\nS02E12 The Fires Of Idirsholas\nS02E13 The Last Dragonlord \n\n\n\nEnglish     \n  \n \n  Merlin is a drama series based around the legends of the mythical wizard and his relationship with Prince Arthur. Set in the early days of their relationship, it shows the development of each in his respective field, finding his way on the path to future greatness. Humour, danger and excitement abound, accompanied by mythical creatures, magic and of course much medieval swashbuckling.\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1199099&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1199099&lt;/a&gt;\n\n\n\n*Audio: 2.1\n*Bron: HDTV \n*Formaat: Video_TS\n*Subs: Custom NL\n*Vertaling: Regeer\nSpotinformatie \nCategorie : Beeld \nFormaat : DVD5 \nBron : TV\nThanks : Pinda\n \nOndertitels : Nederlands (instelbaar)\n \nGenre : TV Shows/Series\n \nWeblink : http://www.tvrage.com/shows/id-18834 \n\n*****************************************\n\nBrought to you by \n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n\n                    &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt;\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n\n\n \n \n \n","torrent":{"xt":"urn:btih:70907b41e99d656143393fb1b95246afe2204aaf","amp;dn":"Merlin+Seizoen+2+DVD+4+%2ASeason+finale%2A+%28E+11%2C12%2C13%29+NL+SUBS++2Li","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70907b41e99d656143393fb1b95246afe2204aaf","infoHashBuffer":{"type":"Buffer","data":[112,144,123,65,233,157,101,97,67,57,63,177,185,82,70,175,226,32,74,175]},"announce":[],"urlList":[]}}