{"title":"Secretary.2002.ntsc.dvd5-cannaup","uid":5277623,"size":4538957824,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:70de6ba877340f8d14f357dfd7fecb9a6cc5fc6f&amp;dn=Secretary.2002.ntsc.dvd5-cannaup&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cannabisleaf","files":-1,"time":1263429677,"description":"CANNABISLEAF says: super awesome effin movie. its kinky so not for the kids. a tale of business and sexuality.. and lets face it maggie gyllenhaal is  supa hot.\nSource: DVD5\nMenus: Untouched\nExtras: Untouched\nLength: 104 min.\n\n\n\nLee Holloway, the socially awkward and emotionally sensitive younger daughter of a dysfunctional family, adjusts to normal life after having been hospitalized after suffering a serious injury due to her tendency for self-harm. She learns to type, starts to date an acquaintance named Peter, and begins to work as a secretary for an eccentric attorney, E. Edward Grey, who hires her despite her stilted social skills and unprofessional appearance.\n\nThough at first Grey appears highly irritated at Holloway's typos, it soon becomes apparent that he is sexually aroused by her submissive behaviour. After he confronts her about her self-injury addiction and commands that she never hurt herself again, the two embark on a BDSM relationship. Lee experiences a sexualand personalawakening, and she falls deeply in love. Edward, however, displays insecurity concerning his feelings for her, and he shows shame and disgust over his sexual habits. After a particular sexual escapade in his office, he fires Lee.\n\nPeter soon proposes to Lee, who reluctantly agrees to marry him but leaves and runs to Edward's office while trying on her wedding gown, declaring her love for him. Edward at first tells her she doesn't know what she's talking about, but finally commands her to sit in his chair without moving her hands or feet until he returns. Lee eagerly complies. Days pass, as Peter, family members, and acquaintances individually come to keep her company (and bring her food) or try to convince her to move. After three days, Edward's resistance breaks; he comes to the office and takes her to the apartment above his office. They marry and happily continue their dominant/submissive relationship. \n\n\nsites to check out: \nmegaups.com\ncinemageddon.org\n","torrent":{"xt":"urn:btih:70de6ba877340f8d14f357dfd7fecb9a6cc5fc6f","amp;dn":"Secretary.2002.ntsc.dvd5-cannaup","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70de6ba877340f8d14f357dfd7fecb9a6cc5fc6f","infoHashBuffer":{"type":"Buffer","data":[112,222,107,168,119,52,15,141,20,243,87,223,215,254,203,154,108,197,252,111]},"announce":[],"urlList":[]}}