{"title":"Halo Legends (2010) PAL(dvd 9) Retail (Multi) 2Lions-Team","uid":5423050,"size":6894926562,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:71499ba6e7267ab43bb27e2af05ac7955ce56368&amp;dn=Halo+Legends+%282010%29+PAL%28dvd+9%29+Retail+%28Multi%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Pioen","files":-1,"time":1268149857,"description":"Halo Legends (2010) PAL NEWTON\n\nDit overweldigende sciencefictionverhaal verkent het rijke Halo-universum met zeven spannende verhalen (verteld in acht delen). Ontdek het geheim van de geheimzinnige afkomst van Master Chief, de geavanceerde vechttechnieken van de Spartans en de gespannen rivaliteit tussen de Spartans en de Orbital Drop Shock Troopers (ODST's). 'Halo Legends', gemaakt in samenwerking met een aantal van 's werelds grootste animators uit Japan, sleept je mee naar het hart van de voortdurende strijd van de mensheid met het Covenant. \n\n\nEnglish\n\nA collection of seven stories from the Halo Universe created by Japan's most creative minds. First up is &quot;Origins&quot; a two part episode showing the expansive history of the Halo Universe and the history of the 100,000 year long franchise timeline, told through the eyes of Cortana. Second comes &quot;The Duel&quot; Taking place long before the Human-Covenant War, it tells the story of an Arbiter, Fal 'Chavamee, who refuses to accept the Covenant Religion. Taking a turn to the Spartan side of the story &quot;Homecoming&quot; focuses on the tragedies involving the Spartan-II recruitment in 2517, and the Spartans coming to terms with their origins. Taking a turn in tone comes &quot;Odd One Out&quot; a non-cannon parody of the Halo storyline. &quot;Prototype&quot; tells the story of a Marine who goes against his orders to destroy an advanced prototype armor and uses the suit to buy time for civilians evacuating from the planet. &quot;The Babysitter&quot; tales of the the rivalry between the Spartan-II Commandos and the Orbital Drop Shock Troopers as they're sent to Covenant-controlled world to assassinate a Covenant Prophet. And finally &quot;The Package&quot; a two-part all CGI film follows Master Chief and an elite squad of Spartan-II super soldiers as they execute a top-secret mission to retrieve a highly valuable UNSC asset on a Covenant Assault Carrier.\n\n\n\n\nType disc: DVD 9 ISO\nGenre: Animatie / Actie / Avontuur / Drama / Fantasy / Oorlog / Sience Fiction\nRegio: 0\nJaar van uitgave: 2010\nRegisseur: Shinji Aramaki, Hideki Futamura, Toshiyuki Kanno, Tomoki KyÃƒÂ´da, KÃƒÂ´ichi Mashimo, Yasushi Muraki, Daisuke Nishio, Frank O'Connor, Mamoru Oshii, Koji Sawai, Keiichi Sugiyama, Hiroshi Yamazaki \nUitgever: Warner Bros \nSpeelduur: 120 minuten \nLeeftijd: 9 Jaar \nActeurs: Emily Neves, David Wald, James Faulkner, Andy McAvin, Deke Anderson, Shelley Calene-Black, Luci Christian, John Swasey, David Matranga, Chris Patton, Greg Ayres, John Gremillion\n\nRip Info aanvullend op de post zelf:\n\n- Geluid sporen aanwezig: Dolby Digital 5.1 - Engels / Dolby Digital 5.1 - Duits / Dolby Digital 5.1 - Italiaans / Dolby Digital 5.1 - Frans / Dolby Digital 2.0 - Engels Audio Commentaar\n- Geluid sporen verwijderd: Geen\n- Ondertiteling: Nederlands / Engels / Duits / Italiaans / Frans / Hebreeuws\n\nThanks : ILLUMINATI  \nAC\n\nCategorie : Beeld \nFormaat : DVD9 \nBron : Retail \nCover : Yes\n\nGenre : Actie\nAvontuur\nAnimatie\nDrama\nFantasiefilm\nScience Fiction\nOorlog\n \nWeblink : http://www.imdb.com/title/tt1480660/ \n\n*****************************************\n\nBrought to you by\n2Lions Team \n\n\n\n\n\n2Lions-Team for all your Dutch MOVIES and more \n\n***************************************** \n\nDON T HIT AND RUN Niet gelijk afhaken als de CD binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n\n\n\n \n","torrent":{"xt":"urn:btih:71499ba6e7267ab43bb27e2af05ac7955ce56368","amp;dn":"Halo+Legends+%282010%29+PAL%28dvd+9%29+Retail+%28Multi%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71499ba6e7267ab43bb27e2af05ac7955ce56368","infoHashBuffer":{"type":"Buffer","data":[113,73,155,166,231,38,122,180,59,178,126,42,240,90,199,149,92,229,99,104]},"announce":[],"urlList":[]}}