{"title":"The Woman in White (1997) with incomplete SUBS","uid":5217514,"size":801187481,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:72411db1f9861355c27bd4b8e38af494cf51d6ec&amp;dn=The+Woman+in+White+%281997%29+with+incomplete+SUBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"jgordon20904","files":2,"time":1260804398,"description":"This is an experimental effort due to the coming demise of Pirate Bay. \n\nI have taught myself how to strip closed captions from a video and display them\nin a text file. At my present level of knowledge, what results is the complete set of subtitles displayed one line at a time. In other words, I do not have them in a form as they appear when playing the original disc, two or even three lines at a time. \n\nI have begun to revise and improve the subtitles resulting from the closed caption text file from The Woman in White. But since I'm old and slow it will take me a long time, probably longer than the time from now to the end of Pirate Bay, particularly if I include similar work to be done on another movie which I have acquired: Middlemarch (1994).\n\nThis may all be a waste of my time and yours. But if it's possible to do I will continue seeding these two movies and periodically update and revise the contents\nof their respective torrent files, bringing them up-to-date.\n\nI will probably fail. But, at least you will understand what comes out at the end,\nwhile being an on-going effort.\n\nI am using .ssa format for subtitles for now, thinking I may attempt hard-coding them into the video sometime or other.\n\nThis may all be a lot of nonsense. But I cannot see that yet.","torrent":{"xt":"urn:btih:72411db1f9861355c27bd4b8e38af494cf51d6ec","amp;dn":"The+Woman+in+White+%281997%29+with+incomplete+SUBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72411db1f9861355c27bd4b8e38af494cf51d6ec","infoHashBuffer":{"type":"Buffer","data":[114,65,29,177,249,134,19,85,194,123,212,184,227,138,244,148,207,81,214,236]},"announce":[],"urlList":[]}}