{"title":"POTHS - Conspiracy Theory - Part 1 - Secret Societies","uid":5420905,"size":1475354499,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:72863d82b916476562491ca75def75b6094fca93&amp;dn=POTHS+-+Conspiracy+Theory+-+Part+1+-+Secret+Societies&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"awaken888","files":5,"time":1268084368,"description":"POTHS - Pointing Out The Hellish Scumbags - POTHS - Pointing Out The Hellish Scumbags - POTHS\n\nThis POTHS - Conspiracy Theory - Secret Societies Collection has 27 parts to date. There will be more as WE are in the Middle of an INFOWAR. The information we receive on TV are all lies, it is a controlled media source that has nothing GOOD for you in it's programming. We have been scientifically &quot;brain washed&quot; Every advertising campaign you see is designed to deceive you.\n\nTake this challenge. Turn off your TV for ONE week and watch your MENTAL media programming dissipate. Watch only these downloads in this series. I PROMISE, YOU WILL BE A WHOLE NEW PERSON! THEY TRUTH WILL SET YOU FREE.\n\n&quot;THERE ARE NO SECRET SOCIETIES&quot; HA HA HA.  THEY ARE EVERYWHERE!! THIS IS A MULTI PART SERIES. PASS THIS AROUND TO EVERYONE. TIME IS SHORT MY FRIENDS. SAVE AS MANY AS YOU CAN. WAKE THEM UP FROM THE NWO BRAINWASHING US AMERICANS AND THE REST OF THE WORLD ARE ENDURING. THROW YOUR PRESCRIPTIONS AWAY AND GET OFF PROZAC. STOP KILLING YOURSELVES AND CHILDREN WITH PROCESSED FAST FOOD. BREAK OUT OF THE SYSTEM THAT IS KILLING US AND AMERICA\n\nThe Truth Will set you free, however It may cause you to get real pissed off and kick your dog or cat.\n\t","torrent":{"xt":"urn:btih:72863d82b916476562491ca75def75b6094fca93","amp;dn":"POTHS+-+Conspiracy+Theory+-+Part+1+-+Secret+Societies","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72863d82b916476562491ca75def75b6094fca93","infoHashBuffer":{"type":"Buffer","data":[114,134,61,130,185,22,71,101,98,73,28,167,93,239,117,182,9,79,202,147]},"announce":[],"urlList":[]}}