{"title":"B.I.K.E.","uid":5306847,"size":1471932416,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:73096c0696b0eca44609609f5dcd64e1cdc4dff7&amp;dn=B.I.K.E.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"copylegal","files":1,"time":1264425550,"description":"Driven by anti-materialism and a belief that the impending apocalypse will render cars useless and leave bicycles in power, Black Label Bike Club (BLBC) battles mainstream consumer culture and rival gangs for its vision of a better tomorrow.\n\nPulling threads from Critical Mass and the wider bike counterculture, B.I.K.E. explores such themes as radical politics, personal artistic vision, global responsibility, relationships, group formation, and perhaps most prominently, pain and love.\n\nCo-directors Jacob Septimus and Anthony Howard followed the Brooklyn chapter of BLBC for over two years to meetings, parties, jousts, gatherings of the tribes in Amsterdam and Minneapolis, and the protests of the 2004 Republican National Convention to create their masterpiece.\n\nThis fascinating and gorgeously gritty film provides insight into a passionate subculture, and exposes the darker aspects of living on the wild side. Edited from over 385 hours of footage spanning two years, Fountainhead Films presents B.I.K.E.: a riveting look into the ways in which identity is important for a collective of fiercely independent people","torrent":{"xt":"urn:btih:73096c0696b0eca44609609f5dcd64e1cdc4dff7","amp;dn":"B.I.K.E.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73096c0696b0eca44609609f5dcd64e1cdc4dff7","infoHashBuffer":{"type":"Buffer","data":[115,9,108,6,150,176,236,164,70,9,96,159,93,205,100,225,205,196,223,247]},"announce":[],"urlList":[]}}