{"title":"Copland OS Enterprise","uid":5256240,"size":12022877,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:730bef3400c9157eeb06ccefe68654db12996eee&amp;dn=Copland+OS+Enterprise&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"jbentusi","files":1,"time":1262558438,"description":"Copland OS Enterprise\n\nA GUI partner for Windows.\n\nUsing the Blackbox engine, I've developed this version of Copland OS, from the smash hit anime, &quot;Serial Experiments: Lain.&quot;\n\nIt's a right-click menu system that runs on Windows, it's fully portable and USB Stick ready, and you can unpack it anywhere.\n\nI FULLY RECOMMEND FOR HOME USE THAT YOU RUN IT ALONG SIDE WINDOWS EXPLORER, AND SET YOUR START BAR TO AUTO-HIDE. THIS IS THE MOST STABLE WAY TO RUN IT, AND IT ALLOWS YOU TO CALL UP THE START BAR WITH THE WINDOWS KEY ON YOUR KEYBOARD.\n\nAlso, I've designed it to startup when you want WITH A STARTUP SOUND by running the batch file included, &quot;Start Copland OS.bat&quot; I've also included several batch files integrated into the menus to help carry out common tasks, such is IP Config, Netstat, Shutdown, Shutdown Abort, Connectivity testers and Network resetters, and my favorite for getting out of a hot spot fast, &quot;CUT THE HARD LINE!&quot; Relax, it just releases the network and performs an immediate shutdown.\n\nINCLUDED:\nThe Blackbox bbLean core (Obviously), my theme (Copland OS), the theme and wallpaper from the actual Lain OS project (http://lainos.sourceforge.net/), several other themes, Portable shortcuts folders, and the PortableApps.com Menu (So you can load your own Portable Apps into it).\n\nIf you're unsure about something, please read my Readme.doc file!\n\nYou can also refer to the Blackbox documentation which comes with this release. I've left everything fully open to coding, so you can remake it how you see fit. Most of the .rc files have backup copies in the main folder in case you fuck something up.\n\nFINAL NOTE: I am in no way affiliated with the Blackbox for Windows project. I did not write the kernel, I only coded the .rc files that drive Blackbox, and this is just my personal variant of it (Like Linux), if you should have a error with the actual program, you'll have to take it up with the BBLean project.\nThough I never infect my files, I always refer people to Virus Total, just to be safe!\n\nI really hope you enjoy this release! You can find my contact info in the Readme.doc if you have any ideas, questions, or whatnot.\n\nDonations are highly unlikely, but very much appreciated.","torrent":{"xt":"urn:btih:730bef3400c9157eeb06ccefe68654db12996eee","amp;dn":"Copland+OS+Enterprise","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"730bef3400c9157eeb06ccefe68654db12996eee","infoHashBuffer":{"type":"Buffer","data":[115,11,239,52,0,201,21,126,235,6,204,239,230,134,84,219,18,153,110,238]},"announce":[],"urlList":[]}}