{"title":"Huey Lewis &amp; The News - Hip To Be Square  (2nafish)","uid":5210946,"size":137875460,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:738767c7378e565ae2fb13738f03b631f7936e8e&amp;dn=Huey+Lewis+%26+The+News+-+Hip+To+Be+Square++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1260590408,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Hip to Be Square&quot; is a song by Huey Lewis and the News, written by Bill Gibson, Sean Hopper, and Huey Lewis, and released as the second single from the multi-Platinum album, Fore!, in 1986. The song features Pro Football Hall of Famers and then-San Francisco 49ers Joe Montana and Ronnie Lott singing backup vocals. The single reached number three on the Billboard Hot 100. In concert, Huey Lewis now normally sings the song as &quot;(Too) Hip to Be Square&quot;, as performed on their live album, Live at 25.\n\nThe song was featured in the film American Psycho during a scene in which Patrick Bateman dances to the song and brutally murders a colleague with an axe. Before doing so he talks to his colleague:\n\n    Their early work was a little too New Wave for my taste, but when Sports came out in '83, I think they really came into their own, commercially and artistically. The whole album has a clear, crisp sound, and a new sheen of consummate professionalism that really gives the songs a big boost. He's been compared to Elvis Costello, but I think Huey has a far more bitter, cynical sense of humor. In '87, Huey released this, Fore!, their most accomplished album. I think their undisputed masterpiece is &quot;Hip to Be Square,&quot; a song so catchy, most people probably don't listen to the lyrics. But they should, because it's not just about the pleasures of conformity, and the importance of trends, it's also a personal statement about the band itself.\n\nIt was originally featured on the accompanying soundtrack, but shortly after it was released, the album was pulled from the shelves and the song was removed before being reissued, but a small number had already been sold. Reports suggested that Huey Lewis had objected to the context in which his song was used in the film and demanded it be removed from the album. In reality, the film's production team had paid for the rights to use the song in the film, but overlooked receiving the rights to include it on the soundtrack. When the soundtrack was released with the song on it, Huey Lewis had it withdrawn, as the soundtrack rights had not been secured.\n\nFore! is the fourth album by American rock band Huey Lewis and the News, released in 1986. The album hit number one on the Billboard 200 album chart and contained five top-ten Billboard Hot 100 singles, including the number-one hits: &quot;Stuck with You&quot; and &quot;Jacob's Ladder.&quot;\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:738767c7378e565ae2fb13738f03b631f7936e8e","amp;dn":"Huey+Lewis+%26+The+News+-+Hip+To+Be+Square++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"738767c7378e565ae2fb13738f03b631f7936e8e","infoHashBuffer":{"type":"Buffer","data":[115,135,103,199,55,142,86,90,226,251,19,115,143,3,182,49,247,147,110,142]},"announce":[],"urlList":[]}}