{"title":"Picture Resize Genius (version 2.9.8)","uid":5244226,"size":2167259,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:743390446fa236ef99ae82293ff08fd02230973e&amp;dn=Picture+Resize+Genius+%28version+2.9.8%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"muryucu","files":4,"time":1261923825,"description":"Picture Resize Genius includes the ability to batch resize pictures, batch resize photos, and perform batch image resize functions for the purpose of email and Web sites, or just to save space on your hard drive, or whatever reason you might have. The resizing allows you to force a specified width or height and keep the proportions, or define fixed image dimensions. Besides, the program can add a text or image logo overlay (watermark), rename file and more. You will be able to process thousands of files in a few seconds. Picture Resize Genius can keep all metadata information (Jpg EXIF,Tiff Tags etc) and creating date time for your pictures,Images and photos. Picture Resize Genius support more than 40 picture file format. And it can convert the file format to GIF, JPG, TIFF, PNG, BMP, MIFF or TGA etc.\n\nFeatures:\n The output files can be saved as JPG, GIF, PNG, BMP, TIF, PCX, TGA\n EXIF information settings include an ability to copy EXIF information from original file\n You can change width and height of the image separately or at the same time\n You can indicate new image size by pixels or percentage from the initial size, keep or ignore aspect\n Place a text watermark on your images\n You can set position, opacity level, font parameters and optionally place a name of converted file for watermark\n You can create new names of processed files\n","torrent":{"xt":"urn:btih:743390446fa236ef99ae82293ff08fd02230973e","amp;dn":"Picture+Resize+Genius+%28version+2.9.8%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"743390446fa236ef99ae82293ff08fd02230973e","infoHashBuffer":{"type":"Buffer","data":[116,51,144,68,111,162,54,239,153,174,130,41,63,240,143,208,34,48,151,62]},"announce":[],"urlList":[]}}