{"title":"Rob Zombie - Sick Bubblegum [2010]","uid":5400983,"size":98402308,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:746c5035e004ceaccf521962624351663e9d8752&amp;dn=Rob+Zombie+-+Sick+Bubblegum+%5B2010%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"claudeq","files":-1,"time":1267416811,"description":"Rob Zombie (born Robert Bartleh Cummings;[3] January 12, 1965) is an American musician, film director, screenwriter and film producer. He founded the heavy metal band White Zombie and has been nominated three times as a solo artist for the Grammy Award for Best Metal Performance.\n\nZombie has also established a successful career as a film director, creating the movies House of 1000 Corpses, The Devil's Rejects, the 2007 remake of Halloween, its sequel, and The Haunted World of El Superbeasto. His next film will be the upcoming Tyrannosaurus Rex.\n\n\nHellbilly Deluxe 2: Noble Jackals, Penny Dreadfuls and the Systematic Dehumanization of Cool[1] (shortened to Hellbilly Deluxe 2) is the fourth solo studio album by former White Zombie frontman Rob Zombie. The album is a companion to Rob Zombie's debut album Hellbilly Deluxe. It was released on February 2, 2010, through Roadrunner Records\n\n\n\nRob Zombie had finished recording the album before the end of 2008, but the release had been delayed until November 2009 due to his commitments with Halloween II, and again until February 2010 due to a lack of promotion. According to Rob Zombie, there was not enough time to release advance copies to the press or create a music video for the first single, &quot;What?,&quot; before their tour. Though originally intended to be released through Geffen Records, Zombie's record label of 18 years starting with White Zombie, the album was released through Roadrunner Records/Loud &amp; Proud Records.\n\nHellbilly Deluxe 2 is also the first release where Rob Zombie worked with his full touring band. Previous albums were written and recorded by Rob Zombie himself and a rotating set of musicians. Commenting on the change, Zombie stated, &quot;I've always had a revolving roster of studio and touring musicians, but the three guys in my band now have been on tour with me for years. So we're making it as a band. It's called Rob Zombie, but we're treating it like a band.&quot;\n\nDue to the recent decline in physical CD sales and increase in digital downloads, Hellbilly Deluxe 2 may be the last CD released by Rob Zombie. Zombie called the CD format &quot;dead&quot; and stated &quot;all you will have left is digital downloads.&quot; As a result of this belief, the artwork featured on the CD release of Hellbilly Deluxe 2 is said to be &quot;the best yet.&quot; Rob Zombie has enlisted the help of artists Dan Brereton (creator of Nocturnals), Alex Horley (of Image Comics and DC Comics) and David Hartman (storyboard artist) to create the album artwork. British dark/steampunk artist Sam Shearon (artwork for Godhead's At the Edge of the World and tour merchandise for Iron Maiden and HIM) will also contribute to the artwork of Hellbilly Deluxe 2.\n\nRob Zombie began touring in support of the new album shortly before its release date. The &quot;Hellbilly Deluxe 2 Tour&quot; will also feature Nekromantix and Captain Clegg &amp; The Night Creatures (the fictional band from Halloween II). Uncle Seymour Coffins (also from Halloween II) will host at least one date of the tour.\n\nThe song, &quot;What?&quot;, the first single from the album, starting playing on radio stations October 6 and was released on iTunes October 13.[9] Another new song, &quot;Burn&quot;, was released on Rock Band on October 27 as part of a triple pack which also includes the hits &quot;Dragula&quot; and &quot;Superbeast&quot;. They were released for Xbox Live. &quot;Burn&quot; was later released as a free download on December 17, 2009 via the band's website.\n\n","torrent":{"xt":"urn:btih:746c5035e004ceaccf521962624351663e9d8752","amp;dn":"Rob+Zombie+-+Sick+Bubblegum+%5B2010%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"746c5035e004ceaccf521962624351663e9d8752","infoHashBuffer":{"type":"Buffer","data":[116,108,80,53,224,4,206,172,207,82,25,98,98,67,81,102,62,157,135,82]},"announce":[],"urlList":[]}}