{"title":"Aleksey Vayner (giant twat) - Impossible Is Nothing","uid":5398301,"size":17243381,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:75cfaaf00a671bc7e8b100ac76f5a2919fa07489&amp;dn=Aleksey+Vayner+%28giant+twat%29+-+Impossible+Is+Nothing&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Goatmaster","files":1,"time":1267317047,"description":"This is hilarious! The dude is a giant twat, and it seems he's been busy recently making infringment claims against people hosting the video. So fuck him!\n\n\nTaken from wikipedia:\n\n\nIn October 2006, Yale University student Aleksey Vayner applied for a job with UBS AG. Amused by Vayner's apparent puffery, an unknown member of UBS staff emailed his application materials to other investment banks. They were soon posted on various blogs, thenfrom where they became an immense viral Internet phenomenon.[3]\n[edit] Summary\n\nThe video opens with a staged interview between Vayner and an offscreen voice. However, the &quot;interview&quot; ultimately consists of a single question, to which Vayner gives a lengthy, rambling response. Using considerable amounts of business-speak jargon, Vayner praises himself and shares his various insights on success, talent, and overcoming adversity. Interspliced with the interview we see clips of Vayner performing various feats designed to look impressive, including bench pressing, skiing, playing tennis, ballroom dancing, and finally karate-chopping a stack of bricks. The video ends with a dedication to Radomir Kovacevic, and a fairly lengthy credits sequence.","torrent":{"xt":"urn:btih:75cfaaf00a671bc7e8b100ac76f5a2919fa07489","amp;dn":"Aleksey+Vayner+%28giant+twat%29+-+Impossible+Is+Nothing","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75cfaaf00a671bc7e8b100ac76f5a2919fa07489","infoHashBuffer":{"type":"Buffer","data":[117,207,170,240,10,103,27,199,232,177,0,172,118,245,162,145,159,160,116,137]},"announce":[],"urlList":[]}}