{"title":"Atlas de geografia humana[DVDrip][Spanish]","uid":5306502,"size":733915136,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:76183e7dae576cc4f7f2f1557f8fd518d4601847&amp;dn=Atlas+de+geografia+humana%5BDVDrip%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sahae","files":1,"time":1264412725,"description":"    *\n\n\n      TÃƒÂ­tulo original: Atlas de GeografÃƒÂ­a Humana\n      AÃƒÂ±o: 2007\n      PaÃƒÂ­s: EspaÃƒÂ±a\n      DuraciÃƒÂ³n: 106 min\n      Director: Azucena RodrÃƒÂ­guez\n      Reparto: David Selvas, Montse GermÃƒÂ¡n, MarÃƒÂ­a Bouzas, Cuca Escribano, Rosa Vila\n      GuiÃƒÂ³n: Azucena RodrÃƒÂ­guez, NicolÃƒÂ¡s Saad (Novela: Almudena Grandes)\n      MÃƒÂºsica: Luis Mendo, Bernardo Fuster\n      Productora: Tornasol Films / Messidor Films / Milou Films\n      GÃƒÂ©nero: Cine espaÃƒÂ±ol - Drama\n\n\n      Sinopsis: Basado en la novela homÃƒÂ³nima de Almudena Grandes. Fran, Rosa, Ana y Marisa trabajan en el Departamento de Obras de Consulta de un grupo editorial. Durante varios meses tienen que realizar en equipo un Atlas de GeografÃƒÂ­a que se venderÃƒÂ¡ en fascÃƒÂ­culos. En ese tiempo surgen algunos problemas propios del trabajo en equipo, pero lo que verdaderamente importa es que las cuatro, cada una a su manera y en circunstancias muy distintas, estÃƒÂ¡n redefiniendo sus vidas. Fran, la jefa, ha sido siempre una privilegiada. Fue educada en un ambiente ideal, estÃƒÂ¡ casada con el que fue el hombre de sus sueÃƒÂ±os, es una mujer moderna, culta e inteligente. Pero ahora estÃƒÂ¡ atravesando una crisis. No ha sabido cÃƒÂ³mo reubicarse en un mundo en el que han muerto las utopÃƒÂ­as de su juventud. Rosa estÃƒÂ¡ aburrida de su propia cara. Su marido la ignora y su rutina hace ya tiempo que ha dejado de depararle la mÃƒÂ¡s mÃƒÂ­nima satisfacciÃƒÂ³n. Hasta que durante un viaje que debe hacer a causa del Atlas, tiene un romance furtivo con un fotÃƒÂ³grafo casado y entonces, a los 37 aÃƒÂ±os, vive una pasiÃƒÂ³n adolescente. Otra que se relaciona con un hombre casado es Ana. Pero Ana es muy diferente a Rosa. En primer lugar, es tremendamente atractiva. AdemÃƒÂ¡s, hace ya mucho tiempo que se divorciÃƒÂ³ de un hombre con el que se casÃƒÂ³ demasiado joven, por error de planificaciÃƒÂ³n. Y, por fin, se cuida mucho de no caer en la trampa de las amantes que esperan mÃƒÂ¡s de lo que la situaciÃƒÂ³n normalmente ofrece. En las antÃƒÂ­podas de Ana estÃƒÂ¡ Marisa, la informÃƒÂ¡tica. Es poco agraciada, tartamuda, solitaria. Sus mayores aventuras se la han proporcionado los libros. Una noche, por azar, se cruza con un viejo fotÃƒÂ³grafo de la editorial, un hombre derrotado por los aÃƒÂ±os pero con una capacidad de cariÃƒÂ±o intacta, y tiene con ÃƒÂ©l un tÃƒÂ­mido romance, que luego no se atreve a contarle a sus compaÃƒÂ±eras. Pero ÃƒÂ©l la espera todo lo que haga falta. Cada una de las cuatro, finalmente, se anima a tomar esa decisiÃƒÂ³n tanto tiempo postergada que le permite reorientar su vida.\n\n","torrent":{"xt":"urn:btih:76183e7dae576cc4f7f2f1557f8fd518d4601847","amp;dn":"Atlas+de+geografia+humana%5BDVDrip%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76183e7dae576cc4f7f2f1557f8fd518d4601847","infoHashBuffer":{"type":"Buffer","data":[118,24,62,125,174,87,108,196,247,242,241,85,127,143,213,24,212,96,24,71]},"announce":[],"urlList":[]}}