{"title":"Sting - Fortress Around Your Heart (Long Version) (2nafish)","uid":5351496,"size":165580804,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:77c9b69cc07980e8947fdb4a581399c680a96637&amp;dn=Sting+-+Fortress+Around+Your+Heart+%28Long+Version%29+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1265760601,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Fortress Around Your Heart&quot; is a song from Sting's 1985 album The Dream of the Blue Turtles. The song was also released as a single, and reached #8 and #49 on the U.S. and U.K. singles charts, respectively. It also reached #1 for two weeks on the Billboard Top Rock Tracks chart, becoming his second consecutive #1 hit on this chart. \n\nSting wrote the song in the studio in Barbados in 1985. A Branford Marsalis sax solo is the highlight of the song. The inspiration for this song was the pain he felt from the failure of his first marriage. In a Musician magazine interview later that year, he said:\n\n    &quot;Fortress is about appeasement, about trying to bridge the gaps between individuals. The central image is a minefield that you've laid around this other person to try and protect them. Then you realise that you have to walk back through it. I think it's one of the best choruses I've ever written.&quot;\n\nDuring one of Sting's first performances of the song in concert in Paris, his crew lowered a tiny fortress onto the stage in a parody of the similar Stonehenge scene from the film This Is Spinal Tap.\n\nThe song was included on the U.S. release of the Fields of Gold: The Best of Sting 1984-1994 compilation album.\n\nThe Dream of the Blue Turtles is the first solo and debut studio album released by British pop singer-songwriter Sting, released in the United States on June 1, 1985. It includes ten tracks and was released in 1985, only a year after The Police had unofficially broken up. The album features some of Sting's strongest political songs, including &quot;Russians&quot; (about Cold War nuclear anxieties, which had peaked in the 1980s); &quot;Children's Crusade&quot; (comparing the destruction of the younger generation in World War I to the devastation brought about by heroin addiction in modern-day London); and &quot;We Work the Black Seam&quot; (about the recent U.K. Miners' Strike).\n\nIt also includes Sting's first hit after The Police, &quot;If You Love Somebody Set Them Free&quot;; a jazzed-up reworking of The Police song &quot;Shadows in the Rain&quot;; and a song inspired by Anne Rice's book Interview with the Vampire, &quot;Moon over Bourbon Street&quot;.\n\nThe movie Bring on the Night documents some of the recording work that produced this album, as well as the subsequent tour.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:77c9b69cc07980e8947fdb4a581399c680a96637","amp;dn":"Sting+-+Fortress+Around+Your+Heart+%28Long+Version%29+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77c9b69cc07980e8947fdb4a581399c680a96637","infoHashBuffer":{"type":"Buffer","data":[119,201,182,156,192,121,128,232,148,127,219,74,88,19,153,198,128,169,102,55]},"announce":[],"urlList":[]}}