{"title":"Fast &amp; Furious [2009] DVDRip","uid":5226211,"size":493927935,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7913efa270b81780e5595337e70a63697f56401a&amp;dn=Fast+%26+Furious+%5B2009%5D+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Raymond-ryche","files":-1,"time":1261135658,"description":"Fast &amp; Furious [2009] DVDRip\n\nThe movie opens up with Dominic Toretto and his new crew hijacking fuel tankers in the Dominican Republic. The crew consists of Letty, Rico, Tego and Han Lue. After a heist, Dominic believes that the trail is too hot and tells Han that is time for him &quot;to do his own thing&quot;. Dom subsequently leaves Letty to go elsewhere for her own good when the heat comes down. While he is in Panama City, Toretto gets a call from his sister Mia, who tells him that Letty has been murdered. Dom heads back to Los Angeles and examines the car crash that Letty was in and finds traces of nitromethane. Dom then goes to the only car mechanic that uses nitromethane and coerces him into giving him the name David Park, the man who ordered the fuel.\n\nMeanwhile, FBI agent Brian O'Conner is trying to track down a drug dealer named Arturo Braga. His search leads him to David Park. Dom arrives at Park's apartment first and hangs him out of the window by his ankles before letting go. Brian, who was also on his way to Park's place, saves Park and Park becomes the FBI's new informant. Park gets Brian into a street race through Los Angeles; the winner will become the last driver on a team that traffics heroin between the United States-Mexico border for Braga. Brian selects a Nissan Skyline GT-R (actually being a modified GT-T R34) from the police impound lot to race. Dom also shows up to race. At the end, Dom and Brian are neck-and-neck, and Dom wins when he hits Brian's rear fender and causes him to spin out. Brian then uses his power as an FBI agent to arrest another driver, Dwight Mueller, and takes his place on the team.\n\nThe day after, the team meets Fenix, one of Braga's men. It was revealed to Dom that Fenix was the person who murdered Letty. They drive across the border, using underground tunnels to avoid detection. Brian had prior knowledge that, after delivering the heroin, Braga ordered the drivers to be killed (he was able to plant Letty undercover to capture Braga in exchange for Dom's freedom when she was murdered). Upon all the drivers getting out of their cars, Dom, who senses that something is wrong, rigs his Chevelle to explode by unscrewing a tube that connects to his car's nitrous oxide tank and priming the car's cigarette lighter. After a tense stand-off, Dom's car detonates, distracting Braga's men long enough for Brian to hijack a Hummer with USD $60 million worth of heroin. Both men drive back to Los Angeles and hide the heroin in a police impound lot. The next day, Brian tells his superiors that he can lure Braga into a trap, forcing him to personally show up to exchange money for the heroin, so that the police can arrest him. He says he will do this if they will pardon Dom. At the drop site, however, the man who claims to be Braga is a decoy and Campos, the real Braga, escapes and flees to Mexico.\n\nBrian and Dom head out to Mexico on their own to catch Braga. They find him at a church and apprehend him. As Braga's henchmen come down to rescue their leader, Brian and Dom drive through the underground tunnels back to the United States. During the final moments of the chase, Brian crashes his car and is injured after being T-boned by Fenix at the end of the tunnel. Before Fenix can kill Brian, Dom drives out of the tunnel ruins and into Fenix, killing him instantly. As police and helicopters start streaming to the crash site on the U.S. side, Brian tells Dom to get out of there. Dom says he is tired of running. Despite Brian's request for clemency, the judge sentences Dom to 25 years to life. In the last scene of the movie, Dom boards a prison bus that will take him to Lompoc penitentiary. As the bus drives down the road, Brian, Mia, and Rico and Tego are seen following the bus in a attempt to free Dom.\n\nPLEASE SEED, Thanks.","torrent":{"xt":"urn:btih:7913efa270b81780e5595337e70a63697f56401a","amp;dn":"Fast+%26+Furious+%5B2009%5D+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7913efa270b81780e5595337e70a63697f56401a","infoHashBuffer":{"type":"Buffer","data":[121,19,239,162,112,184,23,128,229,89,83,55,231,10,99,105,127,86,64,26]},"announce":[],"urlList":[]}}