{"title":"Aggression [Strategico-Guerra - 1DVD - Multi5] TNT Village","uid":5324109,"size":1723711488,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7aa5dc90f6c71f0130b27d75a062e38be08b3858&amp;dn=Aggression+%5BStrategico-Guerra+-+1DVD+-+Multi5%5D+TNT+Village&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"robbyrs3","files":1,"time":1264960984,"description":" Aggression [Strategico-Guerra - 1DVD - Multi5] TNT Village\n\n[IMG]http://img172.imageshack.us/img172/639/logorobbyrstntvillagetraz8.gif[/IMG]\n\n[IMG]http://img300.imageshack.us/img300/2371/tnt.jpg[/IMG]\n\n[IMG]http://img187.imageshack.us/img187/5669/titolo.gif[/IMG]\n\n[color=blue]Aggression: Europe 1914 [/color] \n\n[b][color=gray]Il termine ucronÃƒÂ¬a, coniato dallo scrittore francese Charles Renouvier in un saggio apparso nel 1857, deriva dal greco e significa letteralmente &quot;nessun tempo&quot; (da ou = non e chronos = tempo), e indica la narrazione letteraria, grafica o cinematografica di quel che sarebbe potuto succedere se un preciso avvenimento storico fosse andato diversamente. \nÃƒË† ucronÃƒÂ¬a chiedersi, ad esempio, cosa sarebbe successo se l'Inghilterra avesse invaso l'Austria dando origine in tal modo alla prima guerra mondiale, oppure se per prima avesse inventato la bomba atomica e l'avesse utilizzata avventatamente al termine del conflitto nella lotta per la dominazione della terra. \nQuesti ed altri interrogativi costituiscono la base di partenza dalla quale prende le mosse il nuovo RTS di Buka Entertainment (creatori del piÃƒÂ¹ che discreto Pacific Storm), dal titolo Aggression: Europe 1914 previsto sugli scaffali per la prossima primavera.\nIl giocatore avrÃƒÂ  l'effettiva possibilitÃƒÂ , con le proprie scelte, di riscrivere e trasformare la storia continentale dell'ultimo secolo, modificando effetti e conseguenze delle due guerre mondiali, della Guerra Fredda e decidendo, a proprio piacimento, quale nazione incoronare sul trono d'Europa.\nIn realtÃƒÂ  Aggression: Reign over Europe nasce originariamente come unper il mercato russo, ed ÃƒÂ¨ solo grazie all'intervento ed agli sforzi dello sviluppatore Lesta e del distributore Playlogic, che il gioco, rinominato nel frattempo Aggression: Europe 1914, viene proposto al pubblico occidentale debitamente localizzato con esemplari audio del tutto nuovi, oltre che rivisto e &quot;riverniciato&quot; dal punto di vista grafico. [/color][/b]\n\n[IMG]http://img294.imageshack.us/img294/854/coverl.jpg[/IMG]\n\n[b][color=gray]Aggression: Europe 1914, miscelando sapientemente elementi di strategia tattica, combinati con elementi di Real Time Strategy, conduce ed accompagna il giocatore nel periodo che va dal 1910 al 1950 alla ricerca dell'ambizioso obiettivo finale, rappresentato dalla dominazione globale. \nCome d'altronde suggerisce il titolo stesso, sebbene vi sia una fase iniziale in cui il giocatore dovrÃƒÂ  pianificare la propria strategia e le proprie mosse, con possibilitÃƒÂ  di stringere alleanze e negoziare con gli avversari digitali, in maniera simile a quanto giÃƒÂ  sperimentato nella serie Total War, vero fulcro del gioco sarÃƒÂ  l'azione pura, ovvero gli ininterrotti e reiterati attacchi continui, finalizzati ad ottenere l'agognata vittoria definitiva.\nIl giocatore inizierÃƒÂ  la propria campagna scegliendo uno dei quattro stati a disposizione (Francia, Russia, Regno Unito o Germania) e con esso intraprenderÃƒÂ  il percorso gestionale-bellico che lo porterÃƒÂ , a seconda delle proprie capacitÃƒÂ , alla vittoria o alla disfatta totale.\nScelta la nazione da condurre - e con essa l'allineamento politico corrispondente (ad es. scegliendo la Gran Bretagna, si erediterÃƒÂ  uno stato monarchico) - si verrÃƒÂ  catapultati nella fase strategica. Saranno presenti circa duecento personaggi storici da impersonare, ed ognuno sarÃƒÂ  caratterizzato da propri ideali, relativamente alla gestione dei conflitti, ed avrÃƒÂ  delle specifiche capacitÃƒÂ  di negoziazione.\nOccorre precisare che l'ideologia politica inizialmente conferita con la scelta della nazione, potrÃƒÂ  successivamente anche essere modificata con una delle altre sei disponibili, sebbene ciÃƒÂ² non possa avvenire in breve termine, pena gravi ripercussioni interne.\nCome anticipato, il giocatore muoverÃƒÂ  i primi passi all'interno di una mappa tridimensionale raffigurante l'intera Europa, molto curata graficamente ed ottimamente modellata, che si estende dal Nord Africa alla Svezia e, dalla parte occidentale della Russia, fino allo stretto di Gibilterra; in questa fase, prevalentemente tattica, il giocatore si occuperÃƒÂ  della gestione delle proprie provincie e delle proprie truppe, della creazione di proficui accordi commerciali con gli alleati e della crescita scientifica e tecnologica.\nI comandi potranno essere impartiti direttamente al proprio leader storico, la cui peculiaritÃƒÂ  sarÃƒÂ  determinata da tre abilitÃƒÂ  liberamente assegnabili (da inserire nei relativi slots), selezionabili da un totale di 15 capacitÃƒÂ  specifiche, che contribuiranno a rendere ogni personaggio unico ed originale (ad es. sarÃƒÂ  possibile trasformare Albert Einstein in una spia e farlo infiltrare in territorio nemico sotto copertura!). \nA causa dell'attuale mancanza di localizzazione, non ÃƒÂ¨ ancora chiaro in che modo avverrÃƒÂ , nello specifico, la gestione delle risorse, la costruzione di edifici ed il reclutamento delle armate, anche se il filmato dimostrativo non si preoccupa di celare, ma anzi, lascia intendere ed intravedere evidenti similitudini con quanto giÃƒÂ  visto in Medieval: Total War.[/color][/b][/align]\n\n[b][color=orange]DATI FILE\n\n[color=green]Dimensione: 1684 mb\nLingua: Multi\nSito Ufficiale: [URL=http://www.lesta.ru/]http://www.lesta.ru/[/URL]\ntitolo: Aggression: Reign over Europe\npiattaforma: PC Windows\ngenere: Strategico in Tempo Reale \nsviluppatore: Lesta Studio\ndistributore: Atari\npublisher: Playlogic International\ndata di uscita: 02-05-2008\nsistema video: PAL\nsupporto: DVD\netÃƒÂ  consigliata: da 16 anni in su[/color]\n\n[b][color=orange]SCREENSHOT[/color][/b]\n\n[IMG]http://img186.imageshack.us/img186/4093/13011g1.jpg[/IMG]\n[IMG]http://img513.imageshack.us/img513/294/13011g3.jpg[/IMG]\n[IMG]http://img237.imageshack.us/img237/4274/13011g4.jpg[/IMG]\n[IMG]http://img239.imageshack.us/img239/5036/13011g5.jpg[/IMG]\n\n\n[color=green]SCANSIONATO CON  AVAST 4.8 AGGIORNATO AL 05-03-2009\nNEL FILE ISO E' PRESENTE LA CURA[/SIZE][/color][\n\n","torrent":{"xt":"urn:btih:7aa5dc90f6c71f0130b27d75a062e38be08b3858","amp;dn":"Aggression+%5BStrategico-Guerra+-+1DVD+-+Multi5%5D+TNT+Village","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7aa5dc90f6c71f0130b27d75a062e38be08b3858","infoHashBuffer":{"type":"Buffer","data":[122,165,220,144,246,199,31,1,48,178,125,117,160,98,227,139,224,139,56,88]},"announce":[],"urlList":[]}}