{"title":"Blondie - Rapture  (2nafish)","uid":5211102,"size":166844420,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:7ab29f07df7d4e918262d07c45427ef274ea0e69&amp;dn=Blondie+-+Rapture++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1260598163,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Rapture&quot; is a single by the American new wave band Blondie. It was released in January 1981 and became one of the first substantial hit singles to involve rap music, and the first rap-influenced single to reach number one on the US Billboard Chart. It was the second and final song to be released from the band's 1980 album Autoamerican, the first being &quot;The Tide Is High&quot;, which had topped the chart in the US and UK. &quot;Rapture&quot; went on to reach number one on the U.S. Billboard Hot 100, number one on the U.S. Hot Dance Music/Club Play chart, and number five in the UK singles chart. The B-side was &quot;Walk Like Me&quot;, also from Autoamerican.\n\nFollowing the release of &quot;Rapture&quot;, Blondie took a break from recording and touring. The summer of 1981 saw the release of Debbie Harry's first solo single, &quot;Backfired&quot; and the album Koo Koo, co-written and produced by Bernard Edwards and Nile Rodgers of Chic. It was apparently Chic's track &quot;Good Times&quot; that inspired Harry and Chris Stein to write &quot;Rapture&quot;.\n\nDebuting in 1981, this music video was the first rap video ever broadcast on MTV. Set in the Upper East Side, the &quot;Man from Mars&quot; or &quot;voodoo god&quot; (dancer William Barnes in the white suit and top hat) is the introductory and central figure. Barnes also choreographed the piece. The final shot is a one-take scene of Debbie Harry dancing along the street, passing by graffiti artists, Uncle Sam, a Native American and a goat. Fab Five Freddy and graffiti artists Lee Quinones and Jean-Michel Basquiat make cameo appearances. Basquiat was hired when Grandmaster Flash did not show for the filming.\n\nRapture was a combination of New Wave pop, funk, jazz and rap music, with the rap section forming an extended coda. While it was not the first single involving rap to be successful, it was the first to top the charts. The Sugarhill Gang's 1979 hit &quot;Rapper's Delight&quot;, a straightforward rap track also based on Chic's &quot;Good Times&quot;, reached #36 on the U.S. Hot 100 chart and was certified Gold. Kurtis Blow's &quot;The Breaks&quot; was released in 1980, and became the second rap single to be certified Gold. The lyrics of &quot;Rapture&quot; included references to hip-hop pioneers Fab Five Freddy and Grandmaster Flash.\n\nAutoamerican is the fifth studio album by the US new wave band Blondie. It was released in November 1980 and reached no.3 in the UK charts, and no.7 in the US.\n\nThe album proved to be a radical departure for the band, with opening track &quot;Europa&quot; setting the pace. The track was a dramatic instrumental overture featuring orchestral arrangements and ending with vocalist Debbie Harry reciting a poem about the importance of the car in American society. Besides rock and pop tracks, the band explored a wide range of other musical genres; &quot;Here's Looking At You&quot; and &quot;Faces&quot; show jazz and blues influences, the reggae hit &quot;The Tide Is High&quot; was a cover of The Paragons 1965 Jamaican ska hit, whereas &quot;Rapture&quot; combined funk, rock, jazz, and even saw them embracing the then budding genre of rap. The closing track, &quot;Follow Me&quot;, was a cover of a torch song from Alan Jay Lerner and Frederic Loewe's 1960 Broadway musical Camelot, based on the King Arthur legend.\n\nThe band released two singles from this album, &quot;The Tide Is High&quot; and &quot;Rapture&quot;. &quot;The Tide Is High&quot; hit number one in several countries, including the U.S. and the UK. &quot;Rapture&quot; became the first rap song not only to be released from the band but also the first ever to reach number one on the singles chart in the U.S. (it also reached no.5 in the UK). The first edition of the US pressing of the album had a sticker on the cover stating Including &quot;The Tide Is High&quot;, &quot;Rapture&quot; and &quot;T-Birds&quot;, suggesting that the track was planned as the third single release.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:7ab29f07df7d4e918262d07c45427ef274ea0e69","amp;dn":"Blondie+-+Rapture++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ab29f07df7d4e918262d07c45427ef274ea0e69","infoHashBuffer":{"type":"Buffer","data":[122,178,159,7,223,125,78,145,130,98,208,124,69,66,126,242,116,234,14,105]},"announce":[],"urlList":[]}}