{"title":"Big Joe Turner - Greatest Hits - FLAC","uid":5368765,"size":315675237,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7b768bd91bf38e6b70534825dda7879dadfa5a48&amp;dn=Big+Joe+Turner+-+Greatest+Hits+-+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"aiel1","files":23,"time":1266355822,"description":"Big Joe Turner\nGreatest Hits\n1989\nFLAC\n\nThe definitive 'Blues in the Night.'\n\n1. Chill Is On\n2. After My Laughter Came the Tears\n3. Bump Miss Suzie\n4. Chains of Love\n5. I'll Never Stop Loving You\n6. Sweet Sixteen\n7. Baby I Still Want You\n8. Honey Hush\n9. Crawdad Hole\n10. Oke-She-Monke-She-Pop\n11. Shake, Rattle &amp; Roll\n12. Well All Right\n13. Hide and Seek\n14. Flip Flop and Fly\n15. Chicken and the Hawk\n16. Boogie Woogie Country Girl\n17. Corrine Corrina\n18. Midnight Special Train\n19. Red Sails in the Sunset [*]\n20. Feeling Happy\n21. Blues in the Night [*] \n\n\nThank you.  Enjoy!\n\nComments:  &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;8afdefeffdefefe2e5fff8f9caede7ebe3e6a4e9e5e7&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\n\n--\nThe premier blues shouter of the postwar era, Big Joe Turner's roar could \n\nrattle the very foundation of any gin joint he sang within -- and that's \n\nwithout a microphone. Turner was a resilient figure in the history of \n\nblues -- he effortlessly spanned boogie-woogie, jump blues, even the \n\nfirst wave of rock &amp; roll, enjoying great success in each genre.\n\nTurner, whose powerful physique certainly matched his vocal might, was a \n\nproduct of the swinging, wide-open Kansas City scene. Even in his teens, \n\nthe big-boned Turner looked entirely mature enough to gain entry to \n\nvarious K.C. niteries. He ended up simultaneously tending bar and singing \n\nthe blues before hooking up with boogie piano master Pete Johnson during \n\nthe early '30s. Theirs was a partnership that would endure for 13 years.\n\nThe pair initially traveled to New York at John Hammond's behest in 1936. \n\nOn December 23, 1938, they appeared on the fabled Spirituals to Swing \n\nconcert at Carnegie Hall on a bill with Big Bill Broonzy, Sonny Terry, \n\nthe Golden Gate Quartet, and Count Basie. Turner and Johnson performed \n\n&quot;Low Down Dog&quot; and &quot;It's All Right, Baby&quot; on the historic show, kicking \n\noff a boogie-woogie craze that landed them a long-running slot at the \n\nCafe Society (along with piano giants Meade Lux Lewis and Albert Ammons).\n\nAs 1938 came to a close, Turner and Johnson waxed the thundering &quot;Roll \n\n'Em Pete&quot; for Vocalion. It was a thrilling up-tempo number anchored by \n\nJohnson's crashing 88s, and Turner would re-record it many times over the \n\ndecades. Turner and Johnson waxed their seminal blues &quot;Cherry Red&quot; the \n\nnext year for Vocalion with trumpeter Hot Lips Page and a full combo in \n\nsupport. In 1940, the massive shouter moved over to Decca and cut &quot;Piney \n\nBrown Blues&quot; with Johnson rippling the ivories. But not all of Turner's \n\nDecca sides teamed him with Johnson; Willie &quot;The Lion&quot; Smith accompanied \n\nhim on the mournful &quot;Careless Love,&quot; while Freddie Slack's Trio provided \n\nbacking for &quot;Rocks in My Bed&quot; in 1941.\n\nTurner ventured out to the West Coast during the war years, building \n\nquite a following while ensconced on the L.A. circuit. In 1945, he signed \n\non with National Records and cut some fine small combo platters under \n\nHerb Abramson's supervision. Turner remained with National through 1947, \n\nbelting an exuberant &quot;My Gal's a Jockey&quot; that became his first national \n\nR&amp;B smash. Contracts didn't stop him from waxing an incredibly risquÃƒÂ© \n\ntwo-part &quot;Around the Clock&quot; for the aptly named Stag imprint (as Big \n\nVernon!) in 1947. There were also solid sessions for Aladdin that year \n\nthat included a wild vocal duel with one of Turner's principal rivals, \n\nWynonie Harris, on the ribald two-part &quot;Battle of the Blues.&quot;\n\nFew West Coast indie labels of the late '40s didn't boast at least one or \n\ntwo Turner titles in their catalogs. The shouter bounced from RPM to Down \n\nBeat/Swing Time to MGM (all those dates were anchored by Johnson's piano) \n\nto Texas-based Freedom (which moved some of their masters to Specialty) \n\nto Imperial in 1950 (his New Orleans backing crew there included a young \n\nFats Domino on piano). But apart from the 1950 Freedom 78, &quot;Still in the \n\nDark,&quot; none of Turner's records were selling particularly well. When \n\nAtlantic Records bosses Abramson and Ahmet Ertegun fortuitously dropped \n\nby the Apollo Theater to check out Count Basie's band one day, they \n\ndiscovered that Turner had temporarily replaced Jimmy Rushing as the \n\nBasie band's frontman, and he was having a tough go of it. Atlantic \n\npicked up his spirits by picking up his recording contract, and Turner's \n\nheyday was about to commence.\n\nAt Turner's first Atlantic date in April of 1951, he imparted a \n\ngorgeously world-weary reading to the moving blues ballad &quot;Chains of \n\nLove&quot; (co-penned by Ertegun and pianist Harry Van Walls) that restored \n\nhim to the uppermost reaches of the R&amp;B charts. From there, the hits came \n\nin droves: &quot;Chill Is On,&quot; &quot;Sweet Sixteen&quot; (yeah, the same downbeat blues \n\nB.B. King's usually associated with; Turner did it first), and &quot;Don't You \n\nCry&quot; were all done in New York, and all hit big.\n\nTurner had no problem whatsoever adapting his prodigious pipes to \n\nwhatever regional setting he was in. In 1953, he cut his first R&amp;B \n\nchart-topper, the storming rocker &quot;Honey Hush&quot; (later covered by Johnny \n\nBurnette and Jerry Lee Lewis), in New Orleans, with trombonist Pluma \n\nDavis and tenor saxman Lee Allen in rip-roaring support. Before the year \n\nwas through, he stopped off in Chicago to record with slide guitarist \n\nElmore James' considerably rougher-edged combo and hit again with the \n\nsalacious &quot;T.V. Mama.&quot;\n\nProlific Atlantic house writer Jesse Stone was the source of Turner's \n\nbiggest smash of all, &quot;Shake, Rattle and Roll,&quot; which proved his second \n\nchart-topper in 1954. With the Atlantic braintrust reportedly chiming in \n\non the chorus behind Turner's rumbling lead, the song sported enough pop \n\npossibilities to merit a considerably cleaned-up cover by Bill Haley &amp; \n\nthe Comets (and a subsequent version by Elvis Presley that came a lot \n\ncloser to the original leering intent).\n\nSuddenly, at the age of 43, Turner was a rock star. His jumping \n\nfollow-ups -- &quot;Well All Right,&quot; &quot;Flip Flop and Fly,&quot; &quot;Hide and Seek,&quot; \n\n&quot;Morning, Noon and Night,&quot; &quot;The Chicken and the Hawk&quot; -- all mined the \n\nsame good-time groove as &quot;Shake, Rattle and Roll,&quot; with crisp backing \n\nfrom New York's top session aces and typically superb production by \n\nErtegun and Jerry Wexler.\n\nTurner turned up on a couple episodes of the groundbreaking TV program \n\nShowtime at the Apollo during the mid-'50s, commanding center stage with \n\na joyous rendition of &quot;Shake, Rattle and Roll&quot; in front of saxman Paul \n\n&quot;Hucklebuck&quot; Williams' band. Nor was the silver screen immune to his \n\nconsiderable charms: Turner mimed a couple of numbers in the 1957 film \n\nShake Rattle &amp; Rock (Fats Domino and Mike &quot;Mannix&quot; Connors also starred \n\nin the flick).\n\nUpdating the pre-war number &quot;Corrine Corrina&quot; was an inspired notion that \n\nprovided Turner with another massive seller in 1956. But after the \n\ntwo-sided hit &quot;Rock a While&quot;/&quot;Lipstick Powder and Paint&quot; later that year, \n\nhis Atlantic output swiftly faded from commercial acceptance. Atlantic's \n\nrecording strategy wisely involved recording Turner in a jazzier setting \n\nfor the adult-oriented album market; to that end, a Kansas City-styled \n\nset (with his former partner Johnson at the piano stool) was laid down in \n\n1956 and remains a linchpin of his legacy.\n\nTurner stayed on at Atlantic into 1959, but nobody bought his \n\nviolin-enriched remake of &quot;Chains of Love&quot; (on the other hand, a revival \n\nof &quot;Honey Hush&quot; with King Curtis blowing a scorching sax break from the \n\nsame session was a gem in its own right). The '60s didn't produce too \n\nmuch of lasting substance for the shouter -- he actually cut an album \n\nwith longtime admirer Haley and his latest batch of Comets in Mexico City \n\nin 1966!\n\nBut by the tail end of the decade, Turner's essential contributions to \n\nblues history were beginning to receive proper recognition; he cut LPs \n\nfor BluesWay and Blues Time. During the '70s and '80s, Turner recorded \n\nprolifically for Norman Granz's jazz-oriented Pablo label. These were \n\nsuper-relaxed impromptu sessions that often paired the allegedly \n\nilliterate shouter with various jazz luminaries in what amounted to \n\nloosely run jam sessions. Turner contentedly roared the familiar lyrics \n\nof one or another of his hits, then sat back while somebody took a \n\nlengthy solo. Other notable album projects included a 1983 collaboration \n\nwith Roomful of Blues, Blues Train, for Muse. Although health problems \n\nand the size of his humongous frame forced him to sit down during his \n\nlatter-day performances, Turner continued to tour until shortly before \n\nhis death in 1985. They called him the Boss of the Blues, and the \n\nappellation was truly a fitting one: when Turner shouted a lyric, you \n\nwere definitely at his beck and call. ~ Bill Dahl, All Music Guide","torrent":{"xt":"urn:btih:7b768bd91bf38e6b70534825dda7879dadfa5a48","amp;dn":"Big+Joe+Turner+-+Greatest+Hits+-+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b768bd91bf38e6b70534825dda7879dadfa5a48","infoHashBuffer":{"type":"Buffer","data":[123,118,139,217,27,243,142,107,112,83,72,37,221,167,135,157,173,250,90,72]},"announce":[],"urlList":[]}}