{"title":"Jane Feather - The Widow's Kiss","uid":5221111,"size":236176844,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:7dac6b88caeccd4a9912c2751fdbebdc62f770b4&amp;dn=Jane+Feather+-+The+Widow%5C%27s+Kiss&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"fonduboy","files":17,"time":1260935340,"description":"Beautiful, brilliant, and sophisticated, Lady Guinevere Mallory is only 28 but has buried four wealthy husbands. When seasoned soldier Hugh of Beaucaire contests her ownership of a parcel of land, he brings Guinevere's rich estates to the attention of financially needy King Henry VIII, setting in motion events that threaten her status and her life. Traveling to her estate on the King's orders to investigate her fourth husband's death, Hugh expects to find a woman who has earned the label &quot;The Black Widow.&quot; Instead, he discovers a lady whose elegance, quick wit, and warmth threaten to make him her next willing victim.\n\nDespite the danger that Hugh poses to her family and holdings, Guinevere finds herself drawn to the handsome soldier but knows she dare not give in to the attraction nor can she allow herself to trust him. In the end, perhaps only Hugh has the power to save her from Henry and Thomas Cromwell's scheme to claim her wealth and destroy her family. Cromwell is not a man who gives up easily, and family members may die if Hugh doesn't learn to trust in Guinevere in time to save them.","torrent":{"xt":"urn:btih:7dac6b88caeccd4a9912c2751fdbebdc62f770b4","amp;dn":"Jane+Feather+-+The+Widow%5C%27s+Kiss","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7dac6b88caeccd4a9912c2751fdbebdc62f770b4","infoHashBuffer":{"type":"Buffer","data":[125,172,107,136,202,236,205,74,153,18,194,117,31,219,235,220,98,247,112,180]},"announce":[],"urlList":[]}}