{"title":"terry riley - 1986 - the harp of new albion [celestial harmonies","uid":5373026,"size":158595276,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7e7afb7748c4a0a38c3087356745bc98e6ce55f8&amp;dn=terry+riley+-+1986+-+the+harp+of+new+albion+%5Bcelestial+harmonies&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bbandi83","files":10,"time":1266491383,"description":"&quot;The Harp of New Albion is a transfixing solo piano recording, conceived and performed by world-renowned minimalist composer, the ever-innovative Terry Riley. His inspiration for this work came from a legendary harp, left behind in the New World in 1579, on the shores of Nova Albion, which is now called San Francisco Bay. A Native American medicine man is said to have found the harp and placed it on a cliff where the westerly winds played upon it and temperature and humidity changes created an ever-shifting set of tonalities. Riley bases the ten movements of The Harp of New Albion on the concept of tonalities. The liner notes explain the complicated ratios Riley devised for tuning his octaves. He says, &quot;The idea of piano as harp influences my method of playing, as does the tuning from which the particular consonances and dissonances determine the emerging energies that flow through both instrument and performer.&quot; Although Riley improvises throughout The Harp of New Albion, each movement is defined by structural or composed elements. Astonishingly, the halo of harmonics drifting above his solo piano creates an orchestral sound, complete with horns, reeds, strings and voices. At times, the melodic interplay is ethereal, the micro-tonal relationships within the standing waves of sounds creating a haunting spectrum. Special note should be taken of the majestic Bosendorfer Imperial grand piano, especially tuned for Riley to play in the acoustically-fabulous Academy of Music in Munich, Germany. The entire recording was accomplished during one incredible night of inspired piano performance.&quot; (Amazon.com)","torrent":{"xt":"urn:btih:7e7afb7748c4a0a38c3087356745bc98e6ce55f8","amp;dn":"terry+riley+-+1986+-+the+harp+of+new+albion+%5Bcelestial+harmonies","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e7afb7748c4a0a38c3087356745bc98e6ce55f8","infoHashBuffer":{"type":"Buffer","data":[126,122,251,119,72,196,160,163,140,48,135,53,103,69,188,152,230,206,85,248]},"announce":[],"urlList":[]}}