{"title":"005-Coast to Coast-George Knapp-Sarfatti-Stonehill 22 Feb 10","uid":5386345,"size":108930318,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:7e85d600dca35104660fdef9c9125bc59f183a49&amp;dn=005-Coast+to+Coast-George+Knapp-Sarfatti-Stonehill+22+Feb+10&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"panzerfaust69","files":1,"time":1266907181,"description":"Rogue Science &amp; Soviet UFOs\n\nDate:\n02-21-10\n\nHost:\nGeorge Knapp\n\nGuests:\nJack Sarfatti, Paul Stonehill\n\nIn the first half of the program, George Knapp welcomed physicist Jack Sarfatti for a discussion on cutting edge scientific concepts like the &quot;holographic universe&quot; theory. He explained that this theory postulates that the universe is one giant hologram being created by a conscious computer which exists in the future. &quot;In this theory, we are all 'avatars' in a certain sense,&quot; Sarfatti said, referencing the blockbuster film which mirrors this concept. He contended that, while this idea may seem radical, it is being given serious consideration by academia. &quot;It's not just me, it's a network of the greatest minds on the planet,&quot; Sarfatti said of the researchers who are investigating the &quot;holographic universe&quot; theory.\nSarfatti theorized that this concept could connect to an incident from his youth where he allegedly received a phone call from a computer claiming to be aboard a flying saucer in the future. He explained that the robotic voice told him that he was among 400 &quot;bright young minds&quot; chosen to be taught by these forces. Skeptical of the call, Sarfatti remembered that he was &quot;scared but fascinated.&quot; Upon accepting the option of receiving this education, the voice told him to wait on his fire escape for an incoming UFO due to arrive in ten minutes. Sarfatti rounded up his friends and they waited for the craft, but nothing arrived. Interestingly, the voice also told him that, in 20 years, he'd meet some of the other youths who were chosen and, two decades later, Sarfatti was invited to visit Stanford Research Institute where he met such luminaries as Hal Puthoff, Edgar Mitchell, and Russell Targ.\nSoviet UFOs\nIn the latter half of the program, preeminent Eastern Bloc ufologist and author Paul Stonehill talked about Soviet UFO events. One truly bizarre story that he shared involved Lake Baikal, which he called &quot;one of the strangest lakes in the world.&quot; According to Stonehill, in 1982, the Soviets detected &quot;gigantic beings who could swim underwater&quot; without the aid of any breathing apparatus. He said that the military lost several soldiers when they tried to capture these beings. Stonehill contended that he's received confirmation of this event from a variety of credible and disparate sources. This connection between UFOs and water was repeatedly noted by Stonehill, who also cited a Soviet cosmonaut who claimed that there was a UFO base in the Indian Ocean.\nOn the infamous Tunguska incident, he theorized that the event was actually the result of a conflict between two UFOs. He also revealed that there were two secret expeditions to the site soon after the event, but that their findings remain mysterious. One of the expeditions, reported on by the local residents of the area, consisted of &quot;strange people&quot; that were not Russians. These investigators collected data and subsequently disappeared and &quot;nobody knows who they were, up to this day.&quot; Stonehill also discussed the black triangle filmed over Moscow this past December, UFO reports from cosmonauts, and the state of contemporary Soviet Ufology.\nWebsite(s):\nstardrive.org\nhealingsofatlantis.com\nBook(s):\nUFO Case Files of Russia\n","torrent":{"xt":"urn:btih:7e85d600dca35104660fdef9c9125bc59f183a49","amp;dn":"005-Coast+to+Coast-George+Knapp-Sarfatti-Stonehill+22+Feb+10","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e85d600dca35104660fdef9c9125bc59f183a49","infoHashBuffer":{"type":"Buffer","data":[126,133,214,0,220,163,81,4,102,15,222,249,201,18,91,197,159,24,58,73]},"announce":[],"urlList":[]}}