{"title":"Antonamasia - Keeping Nothing [EP] (2006)","uid":5336245,"size":38718528,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:80d8c6ae1a86a00ba2695d81c28f1030264339d1&amp;dn=Antonamasia+-+Keeping+Nothing+%5BEP%5D+%282006%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Xeely","files":8,"time":1265326275,"description":"Antonamasia\nKeeping Nothing EP (2006)\n\n\n.: Dati Album :.\nTitolo: Keeping Nothing EP\nAnno:  2006                                    \nGenere: Melodic/Gothic Metal\nEtichetta: Faultline Records\n\n\n.: Tracklist :.\n1. Gone\n2. Keeping Nothing\n3. Still I Bleed\n4. Asphyxiation Theory\n5. Shatter\n6. Driven Away\n\n\n.: Recensione :.\nLet me begin by first putting to rest any beliefs that this band resides in the wake of the insanely popular and commercial Heavy Gothic Rock band Evanescence. Not only do Antonamasia produce more powerful and melodic guitar riffs, but they accomplish this with just one guitarist. About the only thing that can be said for their frequent comparison are their female lead vocals. (Once you pass the ignorance of 'just another female-fronted metal band', you'll realise that Antonamasia clearly aren't).\n\nThis is Antonamasia's first release, but after the first minute of the opening track &quot;Gone&quot; you would beg to differ. From the word go, this track showcases perfectly what Antonamasia are all about. Melodic keyboard lines courtesy of Gonzales, dark passionate lyrics of love and desperation delivered flawlessly by Dallas, coupled with powerful melodic guitar and bass riffs provided by King and Barrington, all backed by Carter's energetic drumming. Not to mention the clearly metalcore influenced screams of Carter and Gonzales that accompany Dallas' stunning vocals.\n\nThe title track &quot;Keeping Nothing&quot; is exactly as it states. Antonamasia give it their all and hold nothing back. This track is flawless from start to finish. The focus-point being the sheer power delivered throughout. With the exception of a nice keyboard intro to the second verse which gathers momentum leading into the chorus. Carter claims the bridge as his own, launching into a full assault, but the punch doesn't stop there. The best is saved for last, and so it should be. The last chorus fuses Carter's raw screams and Dallas' powerful yet passionate vocals to end the track with twice the energy it started with.\n\nThe standout track lyrically is without a doubt &quot;Still I Bleed&quot;. What I love about this track is that the instrumentation emphasizes the lyrics. While the track begins with a fairly heavy intro, during the verses the layers are peeled back to mostly keyboards and drums, averting the listener's focus to the emotional lyrics. The chorus is hard and heavy, thus the lyrics and Dallas' dominant delivery match the strength and emotion of the chorus.\n\n&quot;Asphyxiation Theory&quot; another great track, however I find it doesn't have as much to offer as the other tracks. There aren't too many focus points or standout sections, apart from another hard-hitting bridge, which Carter executes brilliantly. In saying that though, the track is not to be overlooked by any stretch of the imagination. It retains it's heaviness throughout and makes for a solid performance.\n\nThe only part that went wrong with &quot;Driven Away&quot; is the fact that it's far too short. It seems that it's over as soon as it started. With fast tempo verses the chorus appears to arrive prematurely and before you know it the song has left you wanting more but fails to deliver longevity. This is an outstanding track harnessing terrific emotional lyrical content, strong addictive guitar riffs, and a faultless performance by Dallas and Carter. It's just a shame the song is so short. Maybe an extra line or two in the chorus, or even a longer instrumental break leading into the last chorus?\n\nAs the EP comes to a close, &quot;Shatter&quot; is a more than appropriate choice for the last track position. Strong, heavy, melodic, haunting, beautifully powerful and addictive. Clearly the most sophisticated track on the album, expect to find everything you've heard of Antonamasia until now and compile it into one 'super-track'. Delivering intoxicating muscular instrumentation, compelling lyrical essence, vigorous song structure and a remarkable vocal performance as well as a dynamic instrumental outro, concludes this demonstration of sheer gothic metal beauty.\n\n\n.: Dati Tecnici :.\nMP3 con bitrate variabile intorno ai 256 kb.","torrent":{"xt":"urn:btih:80d8c6ae1a86a00ba2695d81c28f1030264339d1","amp;dn":"Antonamasia+-+Keeping+Nothing+%5BEP%5D+%282006%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80d8c6ae1a86a00ba2695d81c28f1030264339d1","infoHashBuffer":{"type":"Buffer","data":[128,216,198,174,26,134,160,11,162,105,93,129,194,143,16,48,38,67,57,209]},"announce":[],"urlList":[]}}