{"title":"Office Space (1999) (iPod, PSP, Zune) mp4","uid":5264967,"size":585349369,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:829351d8738b33fc1a7d4130e61a817297855fef&amp;dn=Office+Space+%281999%29+%28iPod%2C+PSP%2C+Zune%29+mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"azayii","files":-1,"time":1262863854,"description":"Office Space is a 1999 American comedy film written and directed by Mike Judge. It satirizes work life in a typical software company during the 1990s, focusing on a handful of individuals who are fed up with their jobs. The film's sympathetic portrayal of ordinary IT workers garnered it a cult following among those in that profession, but the film also addresses themes familiar to office workers and white collar employees in general. It was filmed in Dallas and Austin, Texas.\n\nOffice Space is based on the Milton series of cartoons created by Mike Judge. Office Space was Mike Judge's foray into live action film and his second full length motion picture release (the first being the animated Beavis and Butt-head Do America). The promotional campaign for Office Space often associated it with Beavis and Butt-head, leading audiences to expect the brand of humor of the creator's previous animated efforts rather than the relatively low-key ironic humor of the film.\n\nWhile not a box office success, the film has become a cult classic; it has since sold very well on VHS and DVD.\n\n\nConverted from AVI file to MP4 for iPods, Zunes and PSPs.","torrent":{"xt":"urn:btih:829351d8738b33fc1a7d4130e61a817297855fef","amp;dn":"Office+Space+%281999%29+%28iPod%2C+PSP%2C+Zune%29+mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"829351d8738b33fc1a7d4130e61a817297855fef","infoHashBuffer":{"type":"Buffer","data":[130,147,81,216,115,139,51,252,26,125,65,48,230,26,129,114,151,133,95,239]},"announce":[],"urlList":[]}}