{"title":"Viola.Di.Mare.NST,2009.iTALiAN.DVDRip.XviD-TRL","uid":5315115,"size":1467994112,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:82a932254afac3faf43d949511488f21ba08e782&amp;dn=Viola.Di.Mare.NST%2C2009.iTALiAN.DVDRip.XviD-TRL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"lasart10","files":2,"time":1264689772,"description":"Viola.Di.Mare.NST,2009.iTALiAN.DVDRip.XviD-TRL\n\nDrammatico\n\nCast\n\nUn film di Donatella Maiorca. Con Valeria Solarino, Isabella Ragonese, Ennio Fantastichini, Giselda Volodi, Maria Grazia Cucinotta. continuaÃ‚Â» Drammatico, Ratings: Kids+16, durata 105 min. - Italia 2009. - Medusa uscita venerdÃƒÂ¬ 16 ottobre 2009.\n\nRecensione\n\nUn'isola intorno alla Sicilia, seconda metÃƒÂ  dell'800. Angela e Sara crescono insieme ma le loro infanzie sono difficili: la prima subisce i soprusi di un genitore violento; la seconda perde il padre in guerra, mentre la guerra la strapperÃƒÂ  all'amica e alla sua terra. Al suo ritorno, Angela si innamora di Sara e inizia il suo ostinato corteggiamento, da cui nascerÃƒÂ  una relazione che, con il suo sviluppo inusuale, intaccherÃƒÂ  riti millenari.\nViola di mare ÃƒÂ¨ il secondo film di Donatella Maiorca. Per il ritorno al cinema dopo tanta tv sceglie una storia difficile per il periodo storico che sta vivendo il nostro Paese: tratto dal romanzo &quot;Minchia di Re&quot; di Giacomo Pilati, racconta di due donne che si amano e, in qualche modo, spezzano le ritualitÃƒÂ  di una terra sempre uguale a se stessa. Angela e Sara, piegando ai propri scopi quei modelli consolidati, realizzano il loro sogno d'amore: grazie al potere del padre violento e al senso di colpa di un prete, Angela diventa Angelo. \nQui la Maiorca intraprende un sentiero imprevisto. Assaggiando la libertÃƒÂ  degli uomini Angela rischia di esserne travolta e, suo malgrado, di diventare come il genitore che odia. Inutile negare o trascurare l'impatto che un film come Viola di mare puÃƒÂ² avere: due donne che vivono in Sicilia (nella terra di Divorzio all'italiana, non dimentichiamolo) ma potrebbero essere in qualsiasi altra regione d'Italia; ÃƒÂ¨ il XIX secolo ma, anche grazie alla colonna sonora di Gianna Nannini, potrebbero essere i nostri tempi; insomma, un luogo e un tempo in cui il continuo conflitto tra tradizione e modernitÃƒÂ  ÃƒÂ¨ trasposto nelle scene di violenza, un modo di comunicare che sembra improntare una terra spigolosa e dura come le sue rocce. \nSolide le interpretazioni: la Solarino algida e mascolina, la Ragonese sempre piÃƒÂ¹ brava e un Fantastichini sempre al livello dei suoi altissimi standard.\n\nGOOD JOB  :)","torrent":{"xt":"urn:btih:82a932254afac3faf43d949511488f21ba08e782","amp;dn":"Viola.Di.Mare.NST%2C2009.iTALiAN.DVDRip.XviD-TRL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82a932254afac3faf43d949511488f21ba08e782","infoHashBuffer":{"type":"Buffer","data":[130,169,50,37,74,250,195,250,244,61,148,149,17,72,143,33,186,8,231,130]},"announce":[],"urlList":[]}}