{"title":"Medal of Honor Hereos 2 [PAL] [WiiTorrentZ]","uid":5305813,"size":4452115482,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:8540192b7ae69cbce4a57514dbf76aa57758e394&amp;dn=Medal+of+Honor+Hereos+2+%5BPAL%5D+%5BWiiTorrentZ%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ecabuk","files":-1,"time":1264381943,"description":"NAME: Medal of Honor: Heroes 2\nREGI: PAL\nLANG: ENG\nGENR: Action\nSIZE: 4.14GB\n\nProduct Description\nMedal of Honor: Heros 2 Wii Pick up your weapon and take WWII into your hands! It's June 6th, 1944, and the war is far from over. Step into the boots of OSS Operative John Berg and infiltrate Normandy from behind enemy lines to undermine the Nazi regime. As a special agent of the Office of Strategic Services, you must use tactics of combat, infiltration, assassination, reconnaissance and sabotage to carry out the covert operations that will help defeat the Nazi war machine once and for all. Designed from the ground up for the Nintendo Wii, Medal of Honor Heroes 2 will be the first game on the Nintendo Wii to feature 32-player online multiplayer. Choose to tackle all-new missions in traditional single player campaign, or engage in an all new casual mode built specifically for Nintendo Wii. Featuring innovative combat controls and gestures built specifically for the Wii, plus full support of the Nintendo's Wii Zapper, Medal of Honor Heroes 2 puts all the action of WWII into your hands.\n&gt;Pick up and Play Action The all-new casual mode built specifically for Nintendo Wii allows gamers of all skill levels to pick up the Wii-mote and jump into the action. Let the Wii move you around while you focus on the most fun part -- shooting and gesturing.\n&gt;First ever 32-player Multiplayer on Wii Jump into the epic 32-person multiplayer action at any time, in three different multiplayer modes across six maps.\n&gt;Take the War Into Your Hands The WWII experience is more immersive than ever with controls built for the Nintendo Wii that allow you to carry out your top secret OSS objectives. Fire a bazooka, pump a shotgun, blast away with artillery and mortar, throw grenades and fire an arsenal of weapons with the power of the Wii-mote. Maneuver across minefields, find and tune enemy radios to receive intel, and set demolition charges using unique Wii gestures.","torrent":{"xt":"urn:btih:8540192b7ae69cbce4a57514dbf76aa57758e394","amp;dn":"Medal+of+Honor+Hereos+2+%5BPAL%5D+%5BWiiTorrentZ%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8540192b7ae69cbce4a57514dbf76aa57758e394","infoHashBuffer":{"type":"Buffer","data":[133,64,25,43,122,230,156,188,228,165,117,20,219,247,106,165,119,88,227,148]},"announce":[],"urlList":[]}}