{"title":"TweakNow PowerPack Pro 2.2","uid":5363349,"size":8021086,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:88b148d2ce3852acfbbb31f45ce5be84c2011920&amp;dn=TweakNow+PowerPack+Pro+2.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"donkeydick121","files":-1,"time":1266178698,"description":"Platform: Windows 95, 98, ME, NT4, 2000, XP, 2003, Vista, Windows 7.\n\nPlease seed (share) these programs. Most people (just like me when I started) don't know how to do this. It simply means that when the download is complete, don't press stop or close down your program. It will then be available to anyone who wants to download it from you. Thanks.\n\nTweakNow PowerPack is a fully-integrated suite of utilities that let you fine-tune every aspect of your computer's operating system and Web browser. \n\nThe RAM Idle program manages the free memory that is available to run Windows programs. It prevents performance from degrading as you swap files and programs in and out of memory. \n\nThe AutoShutdown program lets you suspend, hibernate, or shut down your computer after a specified period of time. In addition to saving resources, this program keeps your system more secure by making it unavailable to unauthorized people. \n\nThe CD AutoRun is an extension of Windows' CD and DVD autorun features, giving you additional options for starting programs or listening to music. \n\nThe Virtual Desktop program lets you run as many as four custom-designed desktop configurations simultaneously, allowing you to tailor your computer screen to your mood and your work requirements. The suite gives you a complete picture of all aspects of your computer's hardware, including detailed information about your motherboard, processor, video card, memory, hard disk and network.","torrent":{"xt":"urn:btih:88b148d2ce3852acfbbb31f45ce5be84c2011920","amp;dn":"TweakNow+PowerPack+Pro+2.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88b148d2ce3852acfbbb31f45ce5be84c2011920","infoHashBuffer":{"type":"Buffer","data":[136,177,72,210,206,56,82,172,251,187,49,244,92,229,190,132,194,1,25,32]},"announce":[],"urlList":[]}}