{"title":"The Lord of the Rings - The Two Towers - 2Lions-Team","uid":5257914,"size":9362290295,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:898476813aceb6c9b3a1f2056932473b094be368&amp;dn=The+Lord+of+the+Rings+-+The+Two+Towers+-+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SAIMOR","files":-1,"time":1262632819,"description":"The Two Towers - De Two DVD Edition\n\n\nNieuw-Zeeland / Verenigde Staten\nAvontuur / Fantasie\n179 minuten \n\nRegisseur: Peter Jackson\nmet Elijah Wood, Alan Howard, Noel Appleby, Billy Boyd, Ian McKellen, Viggo Mortensen, Dominic Monaghan, Sean Astin, Sala Baker, Liv Tyler \nSchrijver: J.R.R. Tolkien \n\n\nBeschrijving:\n\nHet reisgenootschap is uit elkaar gevallen na de dood van Boromir (Sean Bean). \nDe vrienden Frodo (Elijah Wood) en Sam (Sean Astin) wacht de onmogelijke taak onbeschermd en ongezien naar Mordor te komen en daar de Ring te vernietigen. \nNaarmate zij dichter bij de Doemberg komen, waar de Ring ooit werd gesmeed, wordt de reis zwaarder en de Ring voor Frodo steeds moeilijker te weerstaan. \nZij krijgen tijdens hun queeste echter onverwacht hulp van de minst waarschijnlijke persoon. \nSamen met deze nieuwe medestander gaan zij de strijd aan met de duistere Sauron, die een onzalig verbond heeft gesloten met de boosaardige tovenaar Saruman (Christopher Lee). \nOndertussen proberen Aragorn (Viggo Mortensen), de elf Legolas (Orlando Bloom) en de dwerg Gimli (John Rhys-Davies) de hobbits Merijn (Dominic Monaghan) \nen Pepijn (Billy Boyd) te vinden en te bevrijden uit de handen van het Orc-leger van Saruman, die veronderstelt dat de twee hobbits de Ring bij zich dragen. \nTijdens de zoektocht belandt het driemanschap in Rohan, het land van koning Theoden (Bernard Hill), in wie zij een onverwachte bondgenoot vinden in het gevecht tegen de heersers van de twee torens, Saruman en Sauron.\n\n\nCategorie:   Beeld  \nBron:        DVD\nTaal:        Engels \nOndertitels: Engels/Nederlands\nAudio:       Dolby Digital 2.0 / 5.1 Ch\n\n*****************************************************************************\nThe Two Towers - The Two DVD Edition\n\n\nNew Zealand / United States \nAdventure / Fantasy \n179 minutes\n\nDirector: Peter Jackson \nwith Elijah Wood, Alan Howard, Noel Appleby, Billy Boyd, Ian McKellen, Viggo Mortensen, Dominic Monaghan, Sean Astin, Sala Baker, Liv Tyler \nWriter: J.R.R. Tolkien\n\n\nDescription:\n\nThe Fellowship has fallen apart after the death of Boromir (Sean Bean). \nThe friends Frodo (Elijah Wood) and Sam (Sean Astin) awaits the impossible task unprotected and unseen to Mordor to enter and destroy the Ring. \nAs they come closer to Mount Doom, where once the ring was forged, the journey of Frodo and the Ring heavier and more difficult to resist. \nThey get in their quest, however unexpected help from the least likely person. \nAlong with this new ally they go into battle with the evil Sauron, who has signed an unholy alliance with the evil wizard Saruman (Christopher Lee). \nMeanwhile, Aragorn (Viggo Mortensen), the eleven Legolas (Orlando Bloom) and dwarf Gimli (John Rhys-Davies) the hobbits Merry (Dominic Monaghan) \nand Pippin (Billy Boyd) to find and break out of the hands of the Orc-army of Saruman, which assumes that the two hobbits the ring with him. \nDuring the search the trio ends up in Rohan, the land of King Theoden (Bernard Hill), in whom they found an unexpected ally in the fight against the rulers of the two towers, Saruman and Sauron. \n\n\nCategory:  Image \nSource:    DVD \nLanguages: English   \nSubtitels: English/Dutch\nAudio:     Dolby Digital 2.0 / 5.1 Ch\n\n*****************************************************************************\n\nBrought to you by \nROMIAS\n2Lions Team \n\n\nmeer zien?? \nKom dan eens kijken op ons forum \n     &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt; \n\n2Lions-Team for all your Dutch MOVIES and more \n\n****************************************************************************** \n\nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding.\n\n******************************************************************************\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n\n*******************************************************************************\t\t\n \n","torrent":{"xt":"urn:btih:898476813aceb6c9b3a1f2056932473b094be368","amp;dn":"The+Lord+of+the+Rings+-+The+Two+Towers+-+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"898476813aceb6c9b3a1f2056932473b094be368","infoHashBuffer":{"type":"Buffer","data":[137,132,118,129,58,206,182,201,179,161,242,5,105,50,71,59,9,75,227,104]},"announce":[],"urlList":[]}}