{"title":"A la recherche du Bonheur, In search of Happyness 2007 DVDrip Fr","uid":5230790,"size":1061694044,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8a56ca063810913ac1ccc474a480a0727bb7d4fe&amp;dn=A+la+recherche+du+Bonheur%2C+In+search+of+Happyness+2007+DVDrip+Fr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"inuit1","files":1,"time":1261325237,"description":"Based on a true story about a man named Christopher Gardner. Gardner has invested heavily in a device known as a &quot;Bone Density scanner&quot;. He feels like he has made these devices. However, they do not sell as they are marginally better than the current technology at a much higher price. On top of that, one of these does not work. As Gardner tries to figure out on how to fix the faulty one and sell the others, his wife leaves him, he loses his house, his bank account, and credit cards. Forced to live out in the streets with his son, Gardner is now desperate to find a steady job; he takes on a job as a stockbroker, but before he can receive pay, he needs to go through 6 months of training, and to sell his devices.  \n\nSynopsis : ReprÃƒÂ©sentant de commerce, Chris Gardner a du mal ÃƒÂ  gagner sa vie. Il jongle pour s'en sortir, mais sa compagne supporte de moins en moins leur prÃƒÂ©caritÃƒÂ©. Elle finit par quitter Chris et leur petit garÃƒÂ§on de cinq ans, Christopher.\nDÃƒÂ©sormais seul responsable de son fils, Chris se dÃƒÂ©mÃƒÂ¨ne pour dÃƒÂ©crocher un job, sans succÃƒÂ¨s. Lorsqu'il obtient finalement un stage dans une prestigieuse firme de courtage, il se donne ÃƒÂ  fond, mÃƒÂªme si pour le moment il n'est pas payÃƒÂ©. Incapable de rÃƒÂ©gler son loyer, il se retrouve ÃƒÂ  la rue avec Christopher. Le pÃƒÂ¨re et le fils dorment dans des foyers ou des gares, cherchant des refuges de fortune au jour le jour.\nPerdu dans la pire ÃƒÂ©preuve de sa vie, Chris continue ÃƒÂ  veiller sur Christopher, puisant dans l'affection et la confiance de son fils la force de surmonter les obstacles..\n\n[url]http://www.allocine.fr/film/fichefilm_gen_cfilm=54098.html[/url]\n\nFrench/English soundtrack\nAudio FranÃƒÂ§ais/Anglais","torrent":{"xt":"urn:btih:8a56ca063810913ac1ccc474a480a0727bb7d4fe","amp;dn":"A+la+recherche+du+Bonheur%2C+In+search+of+Happyness+2007+DVDrip+Fr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a56ca063810913ac1ccc474a480a0727bb7d4fe","infoHashBuffer":{"type":"Buffer","data":[138,86,202,6,56,16,145,58,193,204,196,116,164,128,160,114,123,183,212,254]},"announce":[],"urlList":[]}}