{"title":"Coast to Coast AM 2-2-10 - Earth Changes and Space Revelations","uid":5343356,"size":55699265,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:8a97e676a02d412702d89b45aab3272135dba25d&amp;dn=Coast+to+Coast+AM+2-2-10+-+Earth+Changes+and+Space+Revelations&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"goodgirl666","files":6,"time":1265556330,"description":"Earth Changes &amp; Space Revelations\n\nDate:02-02-10\nHost:George Noory\nGuests:Mitch Battros, Richard C. Hoagland\n\nDuring the first half of the show, researcher Mitch Battros discussed the current state of Earth &amp; space changes. New scientific discoveries are &quot;verifying what our ancestors told us millennia ago,&quot; he noted. For instance, the Hubble just found a whole new area of massive stars in our galactic core, amid reports that shifts are going on in the Milky Way, he said, connecting this data to Mayan prophecy relating to the galactic center.\n\nBattros talked about Solar Cycle 24, and the dangers of X-class flares which could bring down power grids, as well as cause cracks in the magnetic field that allow damaging charged particles to filter through. He also offered analysis of recent quake swarms at Yellowstone, and suggested a possible connection between earthquake activity and volcanoes. We're in a period of escalating earth changes, yet these changes are helping people return to a sense of community, he commented.\n\n---------------------------------------\n\nIn the latter half of the show, C2C Science Advisor Richard C. Hoagland reacted to Obama's budget plan that would scrap NASA's return to the moon, and connected this decision to the Norway Spiral. The ending of the space program as we know it is a &quot;stunning development,&quot; and was possibly brought about by the &quot;secret space program&quot; who presented the Norway Spiral as a kind of &quot;blackmail&quot; message to Russia and the United States, he explained.\n\nHoagland, working with a number of researchers, determined that the Norway Spiral wasn't simply caused by a Russian Bulava missile malfunction, but rather it was a demonstration of a Torsion or Tesla-styled weapon that was able to grab the missile like a tractor beam. Referencing the work of Joseph Farrell, he theorized that a kind of Nazi International, started by escapees from Germany after WWII, could be behind the secret space program, and advanced torsion weaponry. For more, see Hoagland's extensive report, A &quot;Nobel Torsion Message&quot; Over Norway? Part III.\n","torrent":{"xt":"urn:btih:8a97e676a02d412702d89b45aab3272135dba25d","amp;dn":"Coast+to+Coast+AM+2-2-10+-+Earth+Changes+and+Space+Revelations","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a97e676a02d412702d89b45aab3272135dba25d","infoHashBuffer":{"type":"Buffer","data":[138,151,230,118,160,45,65,39,2,216,155,69,170,179,39,33,53,219,162,93]},"announce":[],"urlList":[]}}