{"title":"Shrek 1 + Shrek 3D The Story Continues 2Lions-Team","uid":5445482,"size":8009581082,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:8a9845b5c61aabc670541812cf3d9bd0b60c5496&amp;dn=Shrek+1+%2B+Shrek+3D+The+Story+Continues+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Pioen","files":-1,"time":1268959504,"description":"Shrek + Shrek 3D The Story Continues     \n \n \n  DISC 1\nNooit eerder ontmoette je een held zoals Shrek, de schattige boeman die een filmfenomeen werd en die tot ieders verbeelding sprak met... het Mooiste Sprookje Nooit Verteld! Volgens de filmrecensenten was SHREK niet alleen &quot;een schitterende animatiespeelfilm&quot; maar ook &quot;een prachtige film op elk vlak&quot; (Larry King, USA Today).\n\nHerbeleef elk moment van Shreks (Mike Myers) gewaagde onderneming waarbij hij samen met de sympathieke en luidruchtige Donkey (Eddie Murphy) de pittige prinses Fiona (Cameron Diaz) moet redden ÃƒÂ©n de eigendomsakte van zijn geliefde moeras moet terugwinnen van de sluwe Lord Farquaad (John Litgow). SHREK, betoverend oneerbiedig en &quot;monsterlijk slim&quot; (Leah Rozen, People Magazine), is een boemanavontuur dat je steeds opnieuw wilt bekijken!\n\nDISC 2\nDe 3D versie van een compleet nieuw Shrek avontuur. Shrek is terug zoals je 'm nog nooit hebt gezien!\n\nDit compleet nieuwe 3D-avontuur staat bol van opwinding en al je favoriete Shrek-figuren! Je bevindt je te midden van alle actie als Shrek, zijn bruid Fiona en hun trouwe metgezel Donkey (on Dutch dub called Ezel!!), in een hinderlaag worden gelokt door Lord Farquaad's trawant, Thelonious. Met Prinses Fiona als gevangene galoppeert Thelonious het betoverde bos in. In een wanhopige poging om Prinses Fiona te redden, springen Shrek en Donkey in hun door paardenkracht voortgetrokken uivormige koets en gaan erachteraan. De redding door Shrek en Donkey laat nog iets op zich wachten omdat de 'kleine' Lord Farquaad, zinnend op wraak, plotseling terugkomt als spookachtige verschijning. Tijdens een adembenemende, vuurspuwende veldslag rest het pasgetrouwde stel niets anders dan in een gigantische waterval te duiken. Hoe overleven ze dit en trekken zij erop uit naar hun nieuwe avonturen in Shrek 2?\n\n\nEnglish\n\nAmazon.co.uk Review\nFull of verve and wit Shrek is a computer-animated adaptation of William Steig's delightfully fractured fairy tale. Our title character (voiced by Mike Myers) is an agreeable enough ogre who wants to live his days in peace. When the diminutive Lord Farquaad (John Lithgow) evicts local fairy tale creatures (including the now-famous Seven Dwarfs, Pinocchio and the Gingerbread Man), they settle in the ogre's swamp and Shrek wants answers from Farquaad. A quest of sorts starts for Shrek and his new pal, a talking donkey (Eddie Murphy), where battles have to be won and a princess (Cameron Diaz) must be rescued from a dragon lair in a thrilling action sequence. The story is stronger than most animated fare but it's the jokes that make Shrek a winner. The PG rating is stretched when Murphy and Myers hit their strides. The mild potty humour is fun enough for the 10-year-old but will never embarrass their parents. Shrek is never as warm and inspired as the Toy Story films, but the realistic computer animation and a rollicking soundtrack keeps the entertainment in fine form. Produced by DreamWorks, the film also takes several delicious stabs at its cross-town rival, Disney. --Doug Thomas, Amazon.com \nSynopsis\nTwo features including a new adventure and the original film 'Shrek' which follows the adventures of a green ogre who enjoys living by himself in his swamp. When the evil ruler Lord Farquaad throws all the fairy tale characters out of his land, they all go to Shrek for help. Together they hatch a plan to offer Lord Farquaad a deal... \n &lt;a href=&quot;\nhttp://www.amazon.co.uk/Shrek-Story-Continues-3-D-Animated/dp/B000216XOY&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.co.uk/Shrek-Story-Continues-3-D-Animated/dp/B000216XOY&lt;/a&gt;\n\nShrek 1\nMenu: Ja\nTaal: English, Dutch\nOndertiteling: Dutch, English\nAudio: Dolby Digital 5.1\nSpotinformatie \nCategorie : Beeld \nFormaat : DVD5 \n\nShrek 3D\n&gt;&gt;&gt;Audio : English,Dutch, French, Ferman, Spanish, Italian&lt;&lt;&lt;\nMenu : Yes\nTime : -/+ 15 min\n \nGenre : Animatie \n\nWeblink : http://www.moviemeter.nl/film/172\nWeblink : http://www.imdb.com/title/tt0126029\nWeblink : http://www.imdb.com/title/tt0360985\n\n*****************************************\n\nBrought to you by\n2Lions Team \n  &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt;\n\n\n\n2Lions-Team for all your Dutch MOVIES and more \n\n***************************************** \n\nDON T HIT AND RUN Niet gelijk afhaken als de Movie binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!! \n\n\n \nEN SPECIAAL VOOR NLBESJE AKA RUKEEND AKA PIKPIRAAT ENZ\n\nALLES DOOR MEZELF INGESPROKEN EN VERTAALD  \n \n","torrent":{"xt":"urn:btih:8a9845b5c61aabc670541812cf3d9bd0b60c5496","amp;dn":"Shrek+1+%2B+Shrek+3D+The+Story+Continues+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a9845b5c61aabc670541812cf3d9bd0b60c5496","infoHashBuffer":{"type":"Buffer","data":[138,152,69,181,198,26,171,198,112,84,24,18,207,61,155,208,182,12,84,150]},"announce":[],"urlList":[]}}