{"title":"Th Bridges of Madison County(multi Subs)(2Lions-Team)","uid":5351148,"size":4228986767,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:8add498494ef4dd5cfd914956ed435add2e12d3e&amp;dn=Th+Bridges+of+Madison+County%28multi+Subs%29%282Lions-Team%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"JUULTJE","files":-1,"time":1265797725,"description":"Bridges of Madison County, The (1995) \n\n\nVerenigde Staten\nDrama / Romantiek\n135 minuten\n\ngeregisseerd door Clint Eastwood\nmet Clint Eastwood, Meryl Streep en Annie Corley\n\nDe fotograaf Robert Kincaid vraagt de weg bij de boerderij van huisvrouw Francesca Johnson, wiens echtgenoot en kinderen niet aanwezig zijn. De details van de vier-dagen durende romance houdt Francesca bij in een dagboek, welke na haar dood door haar kinderen wordt gevonden.\n\n\nEngels\n\nThe path of Francesca Johnson's future seems destined when an unexpected fork in the road causes her to question everything she had come to expect from life. While her husband and children are away at the Illinois state fair in the summer of 1965, Robert Kincaid happens turn into the Johnson farm and asks Francesca for directions to Roseman Bridge. Francesca later learns that he was in Iowa on assignment from National Geographic magazine. She is reluctant seeing that he's a complete stranger and then she agrees to show him to the bridges and gradually she talks about her life from being a war-bride from Italy which sets the pace for this bittersweet and all-too-brief romance of her life. Through the pain of separation from her secret love and the stark isolation she feels as the details of her life consume her, she writes her thoughts of the four-day love affair which took up three journals. The journals are found by her children after the lawyer was going over Francesca's will and all the contents which produces a key to her hope chest in the bedroom which contained some of hers and Robert's things. The message they take from the diaries is to what you what you have to do to be happy in life. After learning that Robert Kincaid's cremated remains were scattered off Roseman Bridge and that their mother requested that she too be cremated and her ashes to be scattered off Roseman Bridge, the children must decide whether to honor their mother's final wishes or bury her alongside their father as the family had planned. Adapted from the novel by Robert James Waller, this is the story of a special love that happens just once in a lifetime -- if you're lucky.   \n\nWeblink http://www.imdb.com/title/tt0112579/\nWeblink http://www.moviemeter.nl/?film=1590\n\n\nVideo                : DVD RIP\nAudio                : Engels \nSubs                 : Engels Frans Italiaans Nederlands Arabisch Spaans Portugees Engels voor slechthorenden\nID                   : 0xE0\nFormat               : MPEG Video\nFormat version       : Version 2\nBit rate mode        : Variable\nWidth                : 720 pixels\nHeight               : 576 pixels\nDisplay aspect ratio : 16:9\nFrame rate           : 25.000 fps\nStandard             : PAL\nCover                : Yes\nMenu                 : Yes\n\n***************************************** \n\nBrought to you by Juultje\n\n\n2Lions Team \n\n          &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt; \n\n\n2Lions-Team for all your Dutch MOVIES and more \n\n***************************************** \n\nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n \n\n\n\n\n\n","torrent":{"xt":"urn:btih:8add498494ef4dd5cfd914956ed435add2e12d3e","amp;dn":"Th+Bridges+of+Madison+County%28multi+Subs%29%282Lions-Team%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8add498494ef4dd5cfd914956ed435add2e12d3e","infoHashBuffer":{"type":"Buffer","data":[138,221,73,132,148,239,77,213,207,217,20,149,110,212,53,173,210,225,45,62]},"announce":[],"urlList":[]}}