{"title":"IP MAN.avi","uid":5377672,"size":733112320,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8af287c8ebd5a0c3e681fe6bc849a19140ff9870&amp;dn=IP+MAN.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"johnn2727","files":-1,"time":1266626215,"description":"This is Donnie Yen's best acting piece for awhile now, and he still delivers the action sequences brilliantly. At 44 years of age, he looks so energetic, confident and charismatic. I believe the combination of Yen, Sammo Hung and Wilson Yip is the right choice for this particular film and fighting style. Wing Chun is best depicted without the flamboyant ballet of acrobatics often seen in other wushu films.\n\nThe movie doesn't dwell on historical accuracy, but rather use that settings to set the mood, deliver the message and simply tells you the life journey of a Grandmaster in an fun and entertaining way.\n\nI remember that Richard Attenborough said (regarding Gandhi) that there was no way a director/movie maker could encompass and depict a person's life journey in only a 2 or 3-hour movie. But rather one should aim to emulate the spirit of that person, and the message/lesson of his story. I think this movie does that, with a quality production that raised the bar for period drama.\n\nMy rating is missing 1 point because I feel that there were plot devices that had been done-to-death before in other movies like: Fists of Fury, Fearless, Kill Bill, etc. However, Yip Man simply turns the notch to a higher sound-beating level.\n\n\nthis is my most favorite martial arts movie,and i think it will also be yours!\nit has english subs. seed!!!!!","torrent":{"xt":"urn:btih:8af287c8ebd5a0c3e681fe6bc849a19140ff9870","amp;dn":"IP+MAN.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8af287c8ebd5a0c3e681fe6bc849a19140ff9870","infoHashBuffer":{"type":"Buffer","data":[138,242,135,200,235,213,160,195,230,129,254,107,200,73,161,145,64,255,152,112]},"announce":[],"urlList":[]}}