{"title":"The.Mutant.Chronicles.2008.BluRay.H264","uid":5393974,"size":393155112,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8b0355dcae0fd33d3c99f9e6271d97ca6bbe2f3d&amp;dn=The.Mutant.Chronicles.2008.BluRay.H264&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"twentyforty","files":4,"time":1267163149,"description":"Mutant Chronicles (2008)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0490181&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0490181&lt;/a&gt;\n\nGenre: Action | Adventure | Horror | Sci-Fi \n\nWith: Thomas Jane, Ron Perlman, Devon Aoki, John Malkovich\n\nPlot: At the end of the Ice Age, The Machine came from the outer space with the purpose to change men into mutants. However, a hero defeated the device and a great seal was laid over The Machine. In 2707, the depleted world is ruled by four Corporations: Mishima, Bauhaus, Capitol and Imperial that are in constant war. During a battle between Capitol and Bauhaus, the great seal is broken and The Machine works again transforming soldiers and civilians in hordes of mutants. A small part of the population escapes to Mars, leaving millions of people behind. The man of faith and leader of an ancient brotherhood Brother Samuel is a believer of God and the Chronicles, a bible about the mutants. With the city under siege of the mutants, he visits the Corporations' leader Constantine asking for an aircraft and twenty men for a suicide mission to destroy The Machine, planting a bomb and a detonator following the knowledge of the Chronicles. He recruits the tough Major 'Mitch' Hunter; the Bauhaus Lieutenant Maximillian von Steiner; the keeper of the Chronicles Severian that is under a vow of silence; the gorgeous and lethal Corporal Valerie Duval; Corporal Juba Kim Wu; Captain John McGuire; and Corporal Jesus 'El Jesus' de Barrera. Together they become the last hope of Earth against the evil mutants. \n\n--------------------------------------\nREQUESTS ARE &quot;ON HOLD&quot; TILL FURTHER NOTICE.\n","torrent":{"xt":"urn:btih:8b0355dcae0fd33d3c99f9e6271d97ca6bbe2f3d","amp;dn":"The.Mutant.Chronicles.2008.BluRay.H264","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b0355dcae0fd33d3c99f9e6271d97ca6bbe2f3d","infoHashBuffer":{"type":"Buffer","data":[139,3,85,220,174,15,211,61,60,153,249,230,39,29,151,202,107,190,47,61]},"announce":[],"urlList":[]}}