{"title":"TopGrl -  ( BDSM )------Sammi Sui.","uid":5378775,"size":260758822,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:8b2365633a41d02c018db0561971d0758931459f&amp;dn=TopGrl+-++%28+BDSM+%29------Sammi+Sui.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":152,"time":1266624585,"description":" Sammi Sui\n\n(Posted: November 23, 2009)  + Pics \n      \nSister Dee as a sweet struggler at her disposal. Sammi is tied up and waiting for someone who isn't going to come nearly in time to spare her what Dee has in mind. Before she even has a chance to ask what's going on Dee has her gagged to shut her up. Suddenly Sammi can't think of anything else to say. Since she's really in no place to complain, Dee takes that opportunity to redden her ass cheeks with a dragon tail and the palms of her hands.\n\nBack bridges are a pretty fun test of flexibility, but trust in Sister Dee to find a way to turn it into a perfect bondage position. The arch that it puts Sammi into is excellet because it leaves her pussy perfectly exposed for play. Dee has a feather with a sharp pinion that isjust right for tickling and poking. Slutty Sammi loves every second and is even more pleased to have her nipples clamped down upon. Getting masked with a dirty rag and sprayed in the face causes her some stress but nothing can take away from the joy of having tits pinched. Even getting flogged on her back or caned across her chest doesn't break her.\n\nDee's interests aren't all evil. The bitches that suffer the best are allowed to cum the hardest. Dee puts Mr. Pogo in place and all Sammi has to do is fuck herself on it. Sister Dee just wants to hear moan and beg. As long as Sammi is begging to be allowed to cum she is keeping Dee happy and that's what is really important. Even the lashes from the whip don't slow the onset of her orgasm. And after she has had her first one Dee breaks out the vibrator to see how much more she has left. Sammi can barely keep fucking her own pussy so Dee takes over control of the cock. That cunt gets the work out of a lifetime while Dee enjoys the show. \n\n\nScreens &lt;a href=&quot; http://topgrl.com/pages/update_full1.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://topgrl.com/pages/update_full1.php&lt;/a&gt;\n\nCheers  :-)","torrent":{"xt":"urn:btih:8b2365633a41d02c018db0561971d0758931459f","amp;dn":"TopGrl+-++%28+BDSM+%29------Sammi+Sui.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b2365633a41d02c018db0561971d0758931459f","infoHashBuffer":{"type":"Buffer","data":[139,35,101,99,58,65,208,44,1,141,176,86,25,113,208,117,137,49,69,159]},"announce":[],"urlList":[]}}