{"title":"Anaparastassi.1970.Reconstruction.DVDRip.XViD.I.II","uid":5393838,"size":1467907917,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8b2867958a76152dbc5766e2136d183b148835bc&amp;dn=Anaparastassi.1970.Reconstruction.DVDRip.XViD.I.II&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ab-resende","files":4,"time":1267155581,"description":"The film is based on an actual event, the murder of a Greek worker living in Germany by his barmaid wife Eleni and her lover Christos, who falsify the evidence of the husband's return to Germany but are suspected by a sister-in-law and eventually accuse each other of the crime. A woman murders her husband, upon his return home after a long absence, with the complicity of the lover who has relieved her loneliness. Costas Ghoussis, an emigrant recently returned to his native country, is coming back from the fields, a shovel on his shoulder. He pushes open the garden gate in front of his house and calls his wife: Eleni! She does not answer; the reason: she is hidden behind the door of the kitchen with another man, Christos, a gamekeeper, the lover that she took during her husband's absence. Just as Costas crosses the threshold he is attacked and strangled. Despite their precautions, a relative of the victim suspects them and alerts the police. The criminals confess their crime. The reconstruction is that of the examining magistrate, whose inquiries are interspersed with sequences of the crime - although the actual murder is never shown - and with a social documentary which a TV unit (including the director himself) is making about the crime and the village. From the very first sequence, audience knows who was killed and how and who did it. The film closes as it began, cutting back to the husband's return to indicate an order which has been ruptured.\n \nRECONSTRUCTION uses the actual event - a local murder - as a point of departure for a devastating view of something far more important: the death of a village, of a whole world.\n\n\nÃ‚Â«In the old days these villages were better off.\nThere was plenty of work around.\nNow all the young ones are leaving.\nIt's only us old ones who are left.\nThen we'll die and the villages will be empty...\nand when the villages are empty, \nthat won't be too good for the cities either.Ã‚Â»\n\nReconstruction \nÃ‚Â«What do I want to happen? I simply want our life here to become more human. We need to return to those places to find much of what is still important and authentic to our lives.Ã‚Â»\n\nTheo Angelopoulos\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0065396/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0065396/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0065396/awards&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0065396/awards&lt;/a&gt;\n\n\nAudio: Greek\n\nSubtitles: English\n\n","torrent":{"xt":"urn:btih:8b2867958a76152dbc5766e2136d183b148835bc","amp;dn":"Anaparastassi.1970.Reconstruction.DVDRip.XViD.I.II","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b2867958a76152dbc5766e2136d183b148835bc","infoHashBuffer":{"type":"Buffer","data":[139,40,103,149,138,118,21,45,188,87,102,226,19,109,24,59,20,136,53,188]},"announce":[],"urlList":[]}}