{"title":"Voyage to the Bottom of the Sea Season 4 Volume 2 Special Editio","uid":5395766,"size":4283793455,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8b3a44d64cc55c50a5e6afe0b0bb4dce559fd3eb&amp;dn=Voyage+to+the+Bottom+of+the+Sea+Season+4+Volume+2+Special+Editio&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TheTooleMan","files":-1,"time":1267224801,"description":"Voyage to the Bottom of the Sea \n\n\nSPECIAL EDITION\nSEASON 4 VOLUME 2 DVD 6\n\n\nWe've all waited impatiently while a certain video company, stuck in the last century,\nput off the release of the final season of Voyage.\nAnd we've waited some more for the second half of season four.\n\nWell... THE WAITING IS OVER!\n\nThe Seaview first sailed across American TV screens on September 14, 1964.\nNow, 45 years later, TooleMan TV presents the final 13 episodes of \nVoyage to the Bottom of the Sea.\nAll episodes have been remastered from excellent broadcast recordings for the best video and audio.\nThese are FULL RESOLUTION NTSC DVD's.\n\nIncluded:\n\n- all 13 full-length episodes of the second half of season four\n- ABC-TV's &quot;In Color&quot; opener before each episode\n- uncut season four opening theme including &quot;brought to you by...&quot;\n- previews of the next episode, where available\n\nAND\n- special bonus features!\n\n\n\nDVD 6 contains the final two fantastic episodes of the 110 adventures of the men of the Seaview.\nStories that take you on a strange and frightening psychedelic trip to the world of tomorrow,\nthen back in time to a face-to-face meeting with Benedict Arnold during the American Revolutionary War.\n\n\nEpisode 25, first aired March 24, 1968\nCaptain Crane is caught in a nightmarish world of the fourth dimension, created by Mallory and his time travel device.\nCrane's alter-ego guns down Admiral Nelson in cold blood, then sets the Seaview on a course to disaster.\n\n\nEpisode 26, first aired March 31, 1968\nAdmiral Nelson helps Mr. Pem create a new time-travel device in order to save the Seaview from destruction.\nBut Mr. Pem has plans of his own - changing the course of history.\n\n\nRemember... TooleMan TV is TheTooleMan's labor of love.\nIf you love Voyage like TheTooleMan, be sure to post a comment\nwhen you download these rare and special DVD's.\n\nHelp keep them seeded for others to enjoy.\n\nAnd don't even think about selling them, EVER!","torrent":{"xt":"urn:btih:8b3a44d64cc55c50a5e6afe0b0bb4dce559fd3eb","amp;dn":"Voyage+to+the+Bottom+of+the+Sea+Season+4+Volume+2+Special+Editio","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b3a44d64cc55c50a5e6afe0b0bb4dce559fd3eb","infoHashBuffer":{"type":"Buffer","data":[139,58,68,214,76,197,92,80,165,230,175,224,176,187,77,206,85,159,211,235]},"announce":[],"urlList":[]}}