{"title":"Yes - Time and a Word (1970) [FLAC] {2003 Rhino Remaster} - [tro","uid":5210553,"size":430205348,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8c6d9f2d6425722217b2a1b34abf640859218d9a&amp;dn=Yes+-+Time+and+a+Word+%281970%29+%5BFLAC%5D+%7B2003+Rhino+Remaster%7D+-+%5Btro&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tromaster","files":-1,"time":1260572308,"description":"Yes - Time and a Word [2003 Rhino Remaster]\n\n\nBob Eichler ponders at Ground and Sky:\nAlthough this was only the band's second album, it would be their last with guitarist Peter Banks, who was unceremoniously dumped shortly after this disc's release. To add insult to injury, the band photo on the [US] album cover features Steve Howe despite his not playing a lick of the music.\n\nListening to the album, the writing was pretty much on the wall for Banks; his guitar parts are few and far between, and when they do appear they're usually buried in the mix and overwhelmed by Squire's thunderous bass or the orchestral backing tracks that the band experimented with on this album. The orchestration works well on some tracks, such as the grand, sweeping majesty of &quot;No Opportunity Necessary&quot;. But there are some songs that it just can't save, such as Anderson's sappy little ditty &quot;Clear Days&quot;.\n\nApart from the orchestration, this album sounds much closer to the band's first effort than to their later prog masterpieces, although they were making strides in the right direction. &quot;Then&quot; and &quot;The Prophet&quot; are fairly solid numbers, and I consider &quot;Astral Traveller&quot; to be the band's first really proggy song. One would think from the title (and the era it was released) that &quot;Traveller&quot; would be pure psychedelia, but it has a lot of progressive rock touches to it -- sudden changes of style, a long instrumental section, a complex arrangement (even a couple fugue-like bits), the rhythm section playing tight little runs, flashy solos, etc. The highlight song of the &quot;Peter Banks era&quot; as far as I'm concerned.\n\nIf you're one of those Yes fans whose collection starts with The Yes Album, you might want to consider giving those first two &quot;lost&quot; Yes albums a try. You might be surprised.\n\nThe tracks:\n01. No Opportunity Necessary, No Experience Needed\n02. Then\n03. Everydays\n04. Sweet Dreams\n05. The Prophet\n06. Clear Days\n07. Astral Traveller\n08. Time and a Word\nBonus tracks:\n09. Dear Father\n10. No Opportunity Necessary, No Experience Needed [Original Mix]\n11. Sweet Dreams [Original Mix]\n12. The Prophet [Single Version]\n\nThe musicians:\nJon Anderson (written as &quot;John Anderson&quot; on the original LP) - vocals, percussion\nPeter Banks - electric and acoustic guitars, vocals\nTony Kaye - piano, organ\nChris Squire - bass, vocals\nBill Bruford - drums, percussion\nwith:\nDavid Foster - acoustic guitars on &quot;Time and a Word&quot;\n\n\nRecorded at Advision Studios, London, England, between November 1969 and January 1970.\nReleased on 2 November 1970.\nOrchestral arrangements by Tony Cox.\nProduced by Tony Colton.\nEngineered by Eddie Offord.\nThis remastered and expanded edition released in January 2003.\nLabel: Elektra/Rhino.\nGenre: Progressive Rock.\n\n\nRipped with EAC in Secure mode, Test &amp; Copy.\nEncoded with FLAC Frontend at level 8, with full tagging.\nIncludes full artwork, EAC CUE and LOG files, AudioChecker log, and NFO file.\n\nBe fair &amp; share!\n\n","torrent":{"xt":"urn:btih:8c6d9f2d6425722217b2a1b34abf640859218d9a","amp;dn":"Yes+-+Time+and+a+Word+%281970%29+%5BFLAC%5D+%7B2003+Rhino+Remaster%7D+-+%5Btro","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c6d9f2d6425722217b2a1b34abf640859218d9a","infoHashBuffer":{"type":"Buffer","data":[140,109,159,45,100,37,114,34,23,178,161,179,74,191,100,8,89,33,141,154]},"announce":[],"urlList":[]}}