{"title":"Brad Paisley - American Saturday Night  (2nafish)","uid":5278660,"size":166676484,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:8d8fa24f702799827056c27ff55a8d7738f89726&amp;dn=Brad+Paisley+-+American+Saturday+Night++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1263427639,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;American Saturday Night&quot; is the title of a song written by Ashley Gorley and Kelley Lovelace, and co-written and recorded by American country artist Brad Paisley. The song originally charted as an album cut based on unsolicited airplay, charting at #59 on the Billboard Hot Country Songs charts, and #21 on the Billboard Bubbling Under Hot 100. It was then released as the third single from his ninth studio album, also titled American Saturday Night, in November 2009. Following its official release as a single, it re-entered the country charts at #41.\n\nThe music video was released to cmt.com on December 16, 2009. It is largely animated, and includes stop motion. Graphics make it lok like a pop-up-book. Every person in this video is flat, like a board game piece. It was directed by Scott Scovill, &amp; Craig Countryman.\n\nIn the song, the narrator lists off various foreign-themed items such as &quot;Brazilian leather boots,&quot; a German car, Canadian bacon and toga parties, using each as illustrative examples of the cultural diversity in the United States. In the last verse, he also addresses the country's acceptance of foreign immigrants.\n\nCM Wilcox of The 9513, in his review of the album, said that &quot;the heart of the album is in the the title track and 'Welcome to the Future', which see Paisley easing into an armchair and commenting on the world around him from a smart historical perspective.&quot; Matt Bjorke of Roughstock said that it was &quot;a nice, observational piece of songwriting[.]&quot; Chris Neal of Country Weekly magazine gave the single four-and-a-half stars out of five, citing it as an example of Paisley's &quot;us[ing] his knack for clever lyrical details to address a hefty theme.&quot; Both Bjorke and Neal compared the song's theme to that of &quot;Welcome to the Future.&quot;\n\nAmerican Saturday Night is the seventh studio album by American country music artist Brad Paisley. It was released on June 30, 2009, by Arista Nashville. Like all of his previous studio albums, it is produced by Frank Rogers. The first single, &quot;Then,&quot; has become his fourteenth Number One on the Hot Country Songs chart. iTunes released songs from the album weekly as part of the countdown to the album's release. &quot;Water&quot; was released on June 9, 2009, followed by the title track on June 16 and &quot;Everybody's Here&quot; on June 23. The second radio single is &quot;Welcome to the Future&quot; which Paisley said is his favorite song on the album.  The title track was released as the third single on November 16, 2009. As of December 2009, it has sold 440, 000 copies in the U.S. \n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:8d8fa24f702799827056c27ff55a8d7738f89726","amp;dn":"Brad+Paisley+-+American+Saturday+Night++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d8fa24f702799827056c27ff55a8d7738f89726","infoHashBuffer":{"type":"Buffer","data":[141,143,162,79,112,39,153,130,112,86,194,127,245,90,141,119,56,248,151,38]},"announce":[],"urlList":[]}}