{"title":"Puppy Arcade 6 - emulation live cd","uid":5321548,"size":122973628,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:8d9672f67c3b9effffcde51bb4d596d5790eb874&amp;dn=Puppy+Arcade+6+-+emulation+live+cd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sc0ttman","files":3,"time":1264875511,"description":"Puppy Arcade 6 - the emulation focused linux live CD\n\n\nHomepage - http://scottjarvis.com/page105.htm  \n\nSee homepage for more info, files and screenshots \n\n\nAn emulation focused linux live CD that can be run totally in RAM or optionally installed to nearly anything! Puppy Arcade 6 works well even on older PCs.\n\nSystems emulated in Puppy Arcade 6:\n\nAmiga, Atari, Amstrad, Arcade Machines, Colecovision, Commodore (64/128/VIC20/PET), GameBoys (GB, GBC, GBA), GameGear, Genesis, MasterSystem, MS DOS, NeoGeo, NeoGeo CD, NES/Famicom, PC Engine/TurboGrafix 16, PSX, Scumm, SNES and ZX Spectrum\n\nHelp Guide\n\n1. Getting Started\n2. The desktop\n3. The control panel\n4. Configuring emulators\n5. Getting ROMs\n6. Accessing your drives\n7. Saving your settings\n8. Tips &amp; Tricks\n9. Enable 3D acceleration (optional)\n10. Install to hard drive or USB (optional)\n\n\n1. Getting Started:\n\n- Download the ISO file, then either burn to CD, or install to a USB drive.\n- Insert your media and reboot, making sure your PC's set to boot from either your CD or USB.\n- When Puppy Arcade boots, choose your keyboard and display options to load the desktop.\n\n2. The desktop:\n\n- left-click on the deskop for a small 'apps' menu, with links to the most useful apps and tools\n- right-click on the desktop for the full puppy menu\n- you'll see an animated icon bar at the bottom, showing all the emulators available\n- left-click on the emulator you want to load, then browse for a rom file.\n- right-click on the emulator icons to reset/refresh the menu\n- you've got a start menu, quick links menu and taskbar at the very bottom, set to auto-hide\n- the wallpaper can be changed by right clicking on any image any choosing 'Set as wallpaper'\n- the file manager has all the most important bookmarks added already, in the toolbar\n\n3. The control panel:\n\n- a tabbed navigation panel showing most of the settings and tools available\n- choose the 'Gaming' tab to configure your emulators config files\n- if needed, use one of the network wizards to setup your internet connection\n\n4. Configuring emulators:\n\nSome emulators require not only roms, but a system file too.\n\n- Amiga: Find and download a kickstart file (kick13, kick20, kick31), put it in '/usr/lib/uae' and rename (or symlink) to 'kick.rom'.\n- Commodore:You'll need to download a pack of system roms, and extract to '/usr/lib/vice/[system]'\n- Prboom: get doom2.wad or freedoom.wad. You already have '/usr/share/games/doom/prboom.wad' installed\n\nNOTES: You are not allowed to own the BIOS of any systems that you have never purchased.\nMupen64Plus also requires OpenGL (3D acceleration, see below)\n\n5. Getting ROMs\n\n- I cannot include roms with this release, but here are some links where you can get them:\n- Rom-World.com, Romhustler.net, Emuparadise.org, Snes-O-Rama.us, CPS2 XOR Files, ROM Keeper, LemonAmiga\n\nNOTE: You are not allowed to own the ROMs of any games released commercially, that you have never purchased.\n\n6. Accessing your drives:\n\n- all your storage drives can be found at '/mnt/' - but not until you 'mount' them\n- left-click on the desktop and choose 'Drives' to see all your drives\n- hard drives are listed as sda1, sda2, sda3 and so\n- double-click on a drive to mount it, it will then open up in a file manager window\n- after saving your settings (see below), you can use 'startmount' you open your drives at boot\n\n7. Saving your settings\n\n- choose 'pupsaveconfig' from the 'utility' menu to create your save file before you shutdown, so you don't lose any changes\n- when you shutdown for the first time, you should be asked to save your session\n- a nice menu should popup when you shutdown to help you create a savefile, if needed\n- after creating a savefile, you will be asked whether to save to it or not, at each shutdown\n\n8. Tips &amp; Tricks\n\na. Run Puppy Arcade without a hard drive:\n\n- After booting, you can simply replace your Puppy Arcade live-CD with a CD/DVD full of roms.\n- Mount the DVD/CD drive and your roms will be available at '/mnt/sr0/'\n\nb. Hard drive/USB install:\n\n- Put your savefile on the same drive as your roms, and your roms will be available at '/mnt/home/path/to/your/roms'\n\nc. Create an easy to remember ROM directory:\n\n- You can symlink your roms folder to /roms/ - so it's easy and quick to reach them\n- To do this, type 'ln -s /path/to/your/roms /roms' in the terminal\n\nd. Use you joypad or joystick:\n\n- Plug in your device before the Puppy Arcade deskop loads\n- Your joypad will be loaded automatically and should be called '/dev/js0'\n- You can now update the controller settings in your emulators to use your joypad\n\n9. Enabling OpenGL (for 3D acceleration - only required for N64):\n\nYou'll simply need to download and install the correctpet file for your graphics card.\nThen (optionally) follow the softwares' instructions and restart X.\n\nPETS FOR NVIDIA CARDS:\nThe 'nvidia-7186.pet' is for ancient nvidia graphics cards (riva TNT to Geforce 1).\nThe 'nvidia-9643.pet' is for most nvidia cards (officially Gf2 to Gf4 but tested on Gf7 OK).\nThe 'nvidia-100.14.19.pet' is for latest cards (Gf5 to Gf8).\n\nAll Nvidia drivers are available http://download.tuxfamily.org/nop/\nMore Nvidia info http://www.murga-linux.com/puppy/viewtopic.php?t=22272\n\nAlternatively, you could find and download &quot;NVIDIA-Linux-x86-180.22-pkg1_412.sfs&quot; to add a large collection of proprietry Nvidia drivers.\n\nPETS FOR ATI CARDS:\nCatalyst 9.9: For newer cards, go to http://www.murga-linux.com/puppy/viewtopic.php?t=46507\nCatalyst 9.3: For older cards, go to http://www.murga-linux.com/puppy/viewtopic.php?t=45601\nYou can find out which one you need at the pages above.\n\nPETS FOR INTEL CARDS:\nA few drivers and details about compatibility can be found at http://www.murga-linux.com/puppy/viewtopic.php?t=44388\nFinally, for one more .PET, you can check out http://murga-linux.com/puppy/viewtopic.php?p=291587#291587\n\nPETS for OLDER / VARIOUS CARDS:\nHere are a load of .PET files for SiS, framebuffer, 3dfx, Voodoo, Intel, Matrox, VIA and others, see this post: &lt;a href=&quot;\nhttp://www.murga-linux.com/puppy/viewtopic.php?t=48019&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.murga-linux.com/puppy/viewtopic.php?t=48019&lt;/a&gt;\n\nIf you STILL can't find what you are looking for, then try a search at http://pupplinux.ca or the puppy forums\n\n10. Install to Hard Drive or USB (optional):\n\n- See scottjarvis.com/page105.htm, to download the files below\n\n- Installation is not required - you can simply boot Puppy Arcade straight from CD\n- However, Puppy Arcade can also be installed using a number of easy methods:\n\n- Install to any USB drive, using Windows: Download the ISO file and this USB installer, then follow this great guide at PendriveLinux.com\n- Install to anything, using Puppy Arcade: Load the live CD, select 'Menu-&gt;Utility-&gt;Universal Installer' and follow the guide\n- Install a dual-boot system, using Windows: Get the exe installer. You'll need either a FAT32, or fully-defragmented and uncompressed NTFS drive!","torrent":{"xt":"urn:btih:8d9672f67c3b9effffcde51bb4d596d5790eb874","amp;dn":"Puppy+Arcade+6+-+emulation+live+cd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d9672f67c3b9effffcde51bb4d596d5790eb874","infoHashBuffer":{"type":"Buffer","data":[141,150,114,246,124,59,158,255,255,205,229,27,180,213,150,213,121,14,184,116]},"announce":[],"urlList":[]}}