{"title":"VLC Portable for USB","uid":5319364,"size":20450184,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8dc3b70dc48d30843c90b81d84a6f5c116f78735&amp;dn=VLC+Portable+for+USB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SevenTwentySeven","files":371,"time":1264816744,"description":"This is the Portable version of VLC player\nThis Portable App was made by the Portable App Company. (i guess)\nits a extremely great alternative to windows media player and quicktime media player.\nIts fully usable and has just about every codec out there.\nIt can play AVI, MKV, MP4, FLV and so on.\nThis is pretty useful specially when you go to school or you have a job and those school computers dont allow AVI or something.\nit can play .MKV 720p high def video only if youre cmoputer can support high-def video (nvidia geforce 6600 or above works fine i believe)\n\nThis is all integrated into one folder which you move into your usb drive, after moving the folder in there it can be launched from any laptop just by clicking the VLCPortable.exe file\nall codecs and needed files are in subfolder in the folder.\nits been tested on windows xp, vista and windows 7.\nits compatible in Linux Mint and Ubuntu if and only if you have WINE.\nthe GUI isnt all fancy but it looks a bit like a windows 98 GUI but it increases performance and runs great.\nthis also works if you have a new computer without codecs and you just want to watch a movie you download or something.\nthis also plays audio and im pretty sure it supports just about every audio file out there.]\n\nFile info\n----------------\n\nFile Size: 19.7 MB\n\nNo. Of files (including sub-folders): 394 items\n\nExecutable file: VLCPortable.exe (executable)\n\nSupported Systems: Windows NT, 95, 98, ME, 2000, XP (sp1-sp3), Windows Vista, Windows 7, Linux Mint (w/ Wine), Ubuntu 7.0+ (w/ Wine)\n\n\nPlease Download, Seed, and Enjoy!\n If you need any help be glad to post a comment and ill answer as fast as possible. \n\n\n","torrent":{"xt":"urn:btih:8dc3b70dc48d30843c90b81d84a6f5c116f78735","amp;dn":"VLC+Portable+for+USB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8dc3b70dc48d30843c90b81d84a6f5c116f78735","infoHashBuffer":{"type":"Buffer","data":[141,195,183,13,196,141,48,132,60,144,184,29,132,166,245,193,22,247,135,53]},"announce":[],"urlList":[]}}