{"title":"Sothink SWF Quicker v4.7 Build 466","uid":5244294,"size":19863278,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:8e6d25677d4243c774b9ccc1522b54ae5dc8568d&amp;dn=Sothink+SWF+Quicker+v4.7+Build+466&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"andy_19","files":4,"time":1261926901,"description":"SWF Quicker is the leading Flash SWF Editor. It is the best flash animation editor to edit an existing SWF file or create a professional Flash animation from scratch. It is a powerful yet low cost Flash Animation Software. With SWF Quicker, both professionals and novices can create interactive contents for websites. As Flash has developed into the standard for animation on the web, Sothink SWF Quicker, a versatile Flash Maker, has emerged as an advanced and low cost option for Flash design. All elements of a Flash including text, shape, URL, ActionScript, etc. can be edited into your own style. You can capture Flash movie when viewing a page containing Flash, and import them to SWF Quicker. SWF Catcher, a FREE tool that can capture Flash, will be added to Internet Explorer's toolbar as a button after you install Sothink SWF Quicker.\n\nFeatures:\n Fully support creating and editing Flash 8 files\n Support applying Flash filters to add special animating visual effects to objects\n Support exporting the movie as Animated GIF file and Windows AVI video\n Provide Object Snapping, Pixel Snapping and Snap Alignment to align objects\n Support creating Shape morph effect\n Support creating photo morph effect\n Provide various built-in Flash Album, Banner, Navigation Button and Slide Show templates\n Provide a group of tools for you to create vector graphics and texts in the way of WYSIWYG\n Support importing various kinds of media types, such as AI, MP3, MPEG, AVI, MOV, etc\n Fully support syntax of Flash ActionScript 2.0 to control the animations\n Provide an intelligent ActionScript Editor, which supports Syntax Highlighting, Auto Completion and Dynamic Prompt\n Support specifying keyframes to generate Tween Animations automatically\n Provide a large number of built-in animated effects\n Support importing and editing SWF files and the EXE files compressed from SWF files\n","torrent":{"xt":"urn:btih:8e6d25677d4243c774b9ccc1522b54ae5dc8568d","amp;dn":"Sothink+SWF+Quicker+v4.7+Build+466","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e6d25677d4243c774b9ccc1522b54ae5dc8568d","infoHashBuffer":{"type":"Buffer","data":[142,109,37,103,125,66,67,199,116,185,204,193,82,43,84,174,93,200,86,141]},"announce":[],"urlList":[]}}