{"title":"Zeitgeist 9/11","uid":5371533,"size":734383367,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8f5ff0cf5bfc18b9c10086270fe388e2fd641390&amp;dn=Zeitgeist+9%2F11&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"golgos","files":-1,"time":1266438674,"description":"Esta distribucion contiene los subtitulos en castellano.\n\nUn fluido cambio social solo puede ser materializado si dos circunstancias son encontradas. Uno, el sistema de valores humanos, que consiste en nuestra comprensiÃƒÂ³n y creencias, debe de estar actualizado y cambiar a travÃƒÂ©s de la educaciÃƒÂ³n y una atenta introspecciÃƒÂ³n. Dos, el medio ambiente alrededor del sistema de valores debe de cambiar para apoyar la nueva visiÃƒÂ³n del mundo. La interacciÃƒÂ³n entre el sistema de valores de las personas y su medio ambiente es lo que influencia el comportamiento humano.\n\nFluid social change can only materialize if two circumstances are met. One, the human value system, which consists of our understandings and beliefs, must be updated and changed through education and thoughtful introspection. Two, the environment surrounding that value system must change to support the new world view. The interaction between a person's value system and their environment is what influences human behavior.\n\nTiene un tremendo contenido con el mensaje en el movie AVATAR de James Cameron\n\nplease help seed ...\nplease help seed ...\n","torrent":{"xt":"urn:btih:8f5ff0cf5bfc18b9c10086270fe388e2fd641390","amp;dn":"Zeitgeist+9%2F11","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f5ff0cf5bfc18b9c10086270fe388e2fd641390","infoHashBuffer":{"type":"Buffer","data":[143,95,240,207,91,252,24,185,193,0,134,39,15,227,136,226,253,100,19,144]},"announce":[],"urlList":[]}}