{"title":"Performers Of The Year (2010)","uid":5305037,"size":2918991872,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:9006290842973f41e50b51f7d9c86d184b5984c8&amp;dn=Performers+Of+The+Year+%282010%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"webchella","files":4,"time":1264360214,"description":"Performers Of The Year (2010) \n &lt;a href=&quot;\nhttp://www.imagengratis.org/images/performers.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imagengratis.org/images/performers.jpg&lt;/a&gt;\n\nStudio  Elegant Angel \nRelease Date  Jan 19, 2010\nAdditional Info  Special 2-Disc Collector's Edition \nCategory  Feature, HD - Shot In High Def, Star-Power \nDirector  William H. \nStarring  Julia Ann, Jenna Haze, Alexis Texas, Kristina Rose, Tori Black, Bobbi Starr, Kagney Linn Karter \n\nAdult entertainment studio, Elegant Angel, is proud to announce the latest volume of its annual series, &quot;Performers Of The Year 2010,&quot; scheduled for release on January 19th. \n\nThe movie will be a 2-Disc Set, featuring 7 scenes, and starring the biggest names of the year: Tori Black, Kristina Rose, Jenna Haze, Julia Ann, Kagney Linn Karter, Bobbi Starr, and &quot;Buttwoman&quot; Alexis Texas. The movie is shot in 1080p HD, and will be released on DVD and Blu-Ray. The package of extras on the DVD and Blu-Ray include a making of featurette, interviews with cast members, multiple bonus scenes, and a director interview. &quot;Performers Of The Year 2010&quot; is the ultimate porn collector's item.  \n\nAlso released in January from Elegant Angel is big butt superstar, Ava Rose's 1st Interracial Anal Scene in &quot;White Booty Worship 2,&quot; directed by L.T. Sam No also returns with &quot;Battle Of The Asses 2&quot; starring Kelly Divine, Ava Rose, Gracie Glam, and Isis Taylor.  \n\nElegant Angel heads into the new year with a record 61 AVN Award Nominations for the production studio. &quot;2009 has posed a great deal of challenges to the adult industry,&quot; says General Manger, Graham Travis, &quot;but, it's been heartening to see that there is still a marketplace for quality movies. I want to take this opportunity to thank all of our customers, distributors and retailers this year. Your support has been amazing and I hope we have delivered for you.&quot; &quot;From movies like Pornstar Workout, Big Wet Asses 15 with Gianna's 1st anal scene, Superstar September, and a host of others, our directors have worked very hard to deliver high quality products. I'm very proud of their work, but I know we can do even better in 2010, and that is our objective. Ultimately, it's all about the wonderful girls that have contributed to our movies over the past 12 months, and that's what our &quot;Performers Of The Year&quot; series celebrates. With in depth interviews, glamorous tease sequences in epic locations, and great hardcore sex, this movie is the epitome of everything we're striving for at the company.&quot; \n","torrent":{"xt":"urn:btih:9006290842973f41e50b51f7d9c86d184b5984c8","amp;dn":"Performers+Of+The+Year+%282010%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9006290842973f41e50b51f7d9c86d184b5984c8","infoHashBuffer":{"type":"Buffer","data":[144,6,41,8,66,151,63,65,229,11,81,247,217,200,109,24,75,89,132,200]},"announce":[],"urlList":[]}}