{"title":"Girls Kissing Girls 4","uid":5400749,"size":1460744192,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:906fec627c4c7d9e622324791aa210623bd17e24&amp;dn=Girls+Kissing+Girls+4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"trxt","files":2,"time":1267410501,"description":"The pleasures of osculation reach new heights in the fourth volume of Girls Kissing Girls - Young Lesbians in Love. Featuring all young, beautiful girls who love to french kiss, bite and suck on each other's lips and tongue -- and everywhere ... Full Descriptionelse! Mia Presley is worried when Kristina Rose returns from a hot date looking sad and dejected. When Kristina confides that her date told her she 'can't kiss,' Mia takes matters into her own hands, with some scorchingly hot results! Next, teenage blonde Nicole Ray challenges exotic beauty Jessica Bangkok to a friendly game of pool. But when Nicole tells Jessica the loser has to be the winner's slave, will Jessica run, or submit to lesbian pleasures she's never known before? Samantha Ryan is fed up with Alyssa Reece's flirting with ex-lovers, but when a pleading Alyssa finally gives up hope, will Samantha choose hot make up sex instead of a break up? And finally, newly recovered Sinn Sage returns from her snowboarding accident a slightly different person - for one thing, her hair is shorter. She confides her insecurities to Elexis, who responds by showing her that there's one thing she can always count on -- Elexis' sapphic love. ","torrent":{"xt":"urn:btih:906fec627c4c7d9e622324791aa210623bd17e24","amp;dn":"Girls+Kissing+Girls+4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"906fec627c4c7d9e622324791aa210623bd17e24","infoHashBuffer":{"type":"Buffer","data":[144,111,236,98,124,76,125,158,98,35,36,121,26,162,16,98,59,209,126,36]},"announce":[],"urlList":[]}}