{"title":"HORSE the band - 48 Hours In Ukraine","uid":5413478,"size":4363751707,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:90ba00f4b8c0dc4ca28f4a0188604500ca74353f&amp;dn=HORSE+the+band+-+48+Hours+In+Ukraine&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Shadowtheweak","files":3,"time":1267825146,"description":"&quot;Horse the Band toured the world -- several dozen countries that plenty of folks wouldn't dare to visit or vacation in -- a bit years ago, and they're now releasing 'We Flooded It, and There's Yoghurt Everywhere, aka 48 Hours in Ukraine' via Vagrant. The band didn't do the DVD just to show what touring these regions looks like. In fact, as the title suggests, it shows what 48 hours in Ukraine looks like, when you're HTB.\n\n&quot;I think one of the first things that will dawn on the viewer is that touring the world with Horse the Band is not like touring the world with any other band,&quot; synthesizer master Erik Engstrom, aka 'Lord Gold,' told Noisecreep. &quot;While going through our 120 hours of footage from the 45-country Earth Tour, we found a DVD worth of usable material just from two days in Ukraine. We said to each other, 'We should just make a DVD about two days on tour and call it '48 Hours in Ukraine,' so, we did.&quot;\n\nEngstrom continued, &quot;I think for some people, this DVD could be the soul's equivalent to the eyes looking directly into the sun. Kind of like how some people had to see psychiatrists after watching 'Avatar' and became suicidal after realizing they could never live in that world. It might be too much. But for us, it's still just not enough.&quot;\n\nHorse the Band experienced some insanity while touring some of the world's undiscovered -- at least by mainland, white-bread America -- territories, and it affected them profoundly. The band experienced some incredible highs as well as seemingly bottomless lows. &quot;I think we were at one of many high points of exhaustion, recovery from feelings of certainty that you will die, experienced just hours beforehand, curiosity and elation, which formed a perfect storm of vodka-fueled, 'next-level' partying one night followed by a necessary and astronomical fall into misery and despondency the next,&quot; Engstrom said.&quot;It was a pretty cool dynamic to show the highest of highs to the lowest of lows, all within 24 hours, in this exotic land that no one from our part of the world really knows about: Ukraine.\n\n&quot;Additionally, it was sandwiched between two other once-in-a-lifetime moments: skirting Transnistria, a rogue nation not on any maps, and flying to Belarus secretly as the first American band to play there in five years. So, after seeing the DVDs other bands were pushing on their poor fans with 24 camera angles in a 1000-person venue and studio-edited live sound, we decided something more interesting, relevant and real needed to be out there immediately. The whole thing serves as a preview to our 15-hour Earth Tour DVD, novel and live DVD plus photo book, which should be completed in late March.&quot;\n\nKnowing how Horse the Band are, we wouldn't be shocked if they did complete that multi-media monster.&quot;\n\nThis was a straight ISO rip of the DVD.\n\nIf you love this band and the DVD considering buying it and supporting their reign of orgasmic terror: http://new.merchnow.com/products/110990\n\nThank you and please seed like a motherfucker.","torrent":{"xt":"urn:btih:90ba00f4b8c0dc4ca28f4a0188604500ca74353f","amp;dn":"HORSE+the+band+-+48+Hours+In+Ukraine","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90ba00f4b8c0dc4ca28f4a0188604500ca74353f","infoHashBuffer":{"type":"Buffer","data":[144,186,0,244,184,192,220,76,162,143,74,1,136,96,69,0,202,116,53,63]},"announce":[],"urlList":[]}}