{"title":"Black Brigade (aka Carters Army) (Xvid)","uid":5304659,"size":864452608,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:90e59a722902b7e47ddb6ace5980145138100a6b&amp;dn=Black+Brigade+%28aka+Carters+Army%29+%28Xvid%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"2mean2die","files":-1,"time":1264349830,"description":"BLACK BRIGADE\n\nA redneck officer (Stephen Boyd) is put in charge of a squad of all black troops charged with the mission of securing an important hydro dam in Nazi Germany. Their failure would delay the Allies advance into Germany, thus prolonging the war. These African-Americans are relegated to cleaning latrines and have little real military training, but Captain Beau Carter has no choice. He leads the rag-tag unit to secure the dam and they turn out to be heroic.\nThis relatively short war movie (aka &quot;Carter's Army) has all the elements that make such a movie good: it brings out the personality of individuals and their personal struggle with their situation.  Furthermore, superimposed on the scenario of men coping with being in war, which is always something deep, is the issue of racial conflict between those men (the captain being a white southerner leading a detail of black soldiers and their lieutenant). As the end of the story draws near, it becomes a cliffhanger, building to a climax, during which the men that have survived that far manifest themselves... I have heard some people criticize some details of this production, but in the big picture I believe those details are insignificant. The story, as a whole, is very profound and moving. It would be fitting to give them all medals: the actors and the characters that they portrayed. Finally, although from 1970, there is no profanity or graphic violence, perhaps because it was a TV production. It is, though, as any good war movie should be, emotionally wrenching. You may find yourself wishing that some loose ends were tied up, but perhaps the most important ones were.\nDirected by George McCowan \nProduced by Aaron Spelling \nWritten by Aaron Spelling\nDavid Kidd \nStarring Stephen Boyd\nRobert Hooks\nBilly Dee Williams\nRichard Pryor\nMoses Gunn\nRoosevelt Grier\nGlynn Turman \nMusic by Fred Steiner \nDistributed by American Broadcasting Company \nRelease date(s) January 27, 1970 \nRunning time 70 min. \nLanguage English\n","torrent":{"xt":"urn:btih:90e59a722902b7e47ddb6ace5980145138100a6b","amp;dn":"Black+Brigade+%28aka+Carters+Army%29+%28Xvid%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90e59a722902b7e47ddb6ace5980145138100a6b","infoHashBuffer":{"type":"Buffer","data":[144,229,154,114,41,2,183,228,125,219,106,206,89,128,20,81,56,16,10,107]},"announce":[],"urlList":[]}}