{"title":"Magellan RoadMate US &amp; CAN 1.2 IPA TGCLEADER","uid":5386880,"size":1452310433,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:91026141742c3d35438f094f64771df15fbf22c2&amp;dn=Magellan+RoadMate+US+%26+CAN+1.2+IPA+TGCLEADER&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tgcleader","files":1,"time":1266925092,"description":"*************************************TGCLEADER*************************************\n     \n*******************Magellan Roadmate US &amp; CANADA 1.2 IPA ************************* \n\nFor iPhone 3G and 3GS only. (not 2G) or iPod Touch Second Generation only. (not orignal iPod Touch)\n\nThis includes all the files and tools to get Magellan Roadmate 1.2 to run correctly including: WinSCP, My Modified Info.plist so that you dont get the resolution error and how to stnc the Magellan Roadmate 1.10 app to your iPhone/iPod Touch without getting an error. Just follow the instructions below or the rar file inclused the same instructions.\n\nIm not sure what this versions update 1.2 includes but I have heard from people that it drains your battery fast even if you have it plugged in and charging and they said that I would do this before but now its alot faster. But i bever really Noticed this but I also wasent paying that close attention eather. I will check on this. So some people switched back to 1.1 and like i said I dont know what this update includes.\n\nTo get what all of the new features are go to the app store and review the features on the Magellan app.\n\n\n\n\n***BEFORE CONTINUING YOU MUST HAVE A JAILBROKEN IPHONE OR IPOD TOUCH FOR IPOD TOUCH IT MUST BE SECOND GENERATION \nAND FOR IPHONE USERS IT ONLY WORKS ON 3G AND 3GS NOT 2G***\n\n\n\nHOW TO ADD THE MAGELLAN APP TO YOUR IPHONE/IPOD TOUCH \n\n(NOTE: IF YOU ALREAD HAVE YOUR PHONE PATCHED TO \nALLOW PIRATED APPS ON YOUR IPHONE/IPOD TOUCH YOU CAN SKIP TO STEP 12.) \n\nALSO IF YOU HAVE MAGELLAN INSTALLED ON \nYOUR IPHONE/IPOD TOUCH AND YOU ARE GETTING A RESOLUTION ERROR YOU NEED TO FOLLOW INSTRUCTIONS BELOW AFTER STEP 14.\n\n1. Go to Cydia.\n\n2. Go to manage tab.\n\n3. Go to sources.\n\n4. Click on edit.\n\n5. Click on add.\n\n6. Type ''http://cydia.hackulo.us'' (without quotes) and click add source\n\n7. It will pop up a message saying that the app is know for copyright infringement but just click continue anyways.\n\n8.once the source has been added go to the search tab.\n\n9. Type in ''AppSync'' (without quotes)\n\n10. Install AppSync.\n\n11. Once installed reset your iPhone/ iPod Touch.\n\n12. Extract the folder Winrar to the destination you can easly find the fokder and once done go in to the folder.\n\n13. Open up iTunes and drag the Magellan Roadmate 1.10 app to the applications folder or if you dont have any app in ituse there \nwont be an applications folder  so just drag ove the Magellan app. If you already have the previous version of\nMagellan in iTunes just drag it over and it will tell you that you already have the app and if you want to replace\nand just replace it.\n\n14. Plug in your iPhone/iPod Touch and sync it. If you have a previous version installed on your iphone/iPod Touch\nyou still need to sync your device so that it can update to the newest version so that you have the latest\nfeatures. \n\n********HOW TO FIX THE RESOLUTION ERROR FOR MAGELLAN SO THAT IT WORKS*************\n\nI have found a new way to do that that can be easier so you dont even have to be connected to wifi and us openSSH. Try it its alot better and you can do it directly off your phone. ***READ BELOW THIS TUTORIAL TO SEE HOW TO DO IT***\n\nMAKE SURE YOUR IPHONE/IPOD TOUCH HAS OPENSSH. IF IT DOESNT GO TO CYDIA AND SEARCH FOR OPENSSH AND INSTALL IT. \nALSO MAKE SURE YOU HAVE A WIRELESS NETWORK YOU CAN CONNECT TO AND THAT YOUR IPHONE/IPOD TOUCH AND YOUR PC IS\nCONNECTED TO THE SAME WIRELESS NETWORK.\n\n\n1. Install WinSCP.\n\n2. On your iPhone/iPod Touch go to settings.\n\n3. Turn on Wifi.\n\n4, Connect to a wireless network thats available.\n\n5. Once connected click on the blue arrow icon next to the network your connected to.\n\n6. Keep now of the IP address your connected to.\n\n7. Run WinSCP.\n\n8, In the host name field put in the IP address your connect to.\n\n9. In the username field put in ''root''(without quotes).\n\n10. In the password field enter ''alpine'' (without quotes).\n\nNOTE: if its not connecting then at some point of having OpenSSH you have changed your username and password or\nyour wifi network isnt connected to the internet.\n\n11. Go to the right side and click the drop down directory list and click /.\n\n12. Go to ''Private'' folder.\n\n13. ''Var'' folder.\n\n14. ''mobile'' folder.\n\n15. ''Applications '' folder.\n\n16. Now you need to find the Magellan app folder and since the folders are named letters and numbers it might be\ndifficult to find it. So the easiest way to find it is at the top of the window click changed so that it organizes\nthe folders by date and if your last app you added was the Magellan app then it will be the top folder.\n\n17. Now that you are in the folder you will see ''Roademate.app''folder click that and go into the folder.\n\n18. Now look for ''Info.plist'' select that and delete it.\n\n19. Now on the left window go to the directory of where you downloaded my torrent file and drag my modified \n''Info.plist'' into the left window in the ''Roadmate/app'' folder/\n\n20. Thats It enjoy.\n\nHow to fix the resolution error a much easier way directly on your iphone or ipod touch not using Winscp.\n\n****NOTE: YOU STILL NEED APPSYNC INSTALLED BUT BY DOING IT THIS WAY IT WILL ALSO ALLOW YOU TO INSTALL APPSYNC IF YOU ALREADY DONT HAVE IT.\n\n1. Go to Cydia.\n\n2. Go to manage tab.\n\n3. Click Sources.\n\n4. Click edit button.\n\n5. Click add button.\n\n6. In the address url dont delete the http:// but continute to enter sinfuliphonerepo.com so that it looks like this ''http://sinfuliphonerepo.com/'' without quotes.\n\n7. Click add source and wait for it to add the source and refresh.\n\n8. Now if you havent already add AppSync Go to the search tab and search AppSync this allows you to download ipa files off the internet and drag them into itunes and sync them to your iphone with out errors so you can use the apps free.\n\n9. Install AppSync if you dont have it already.\n\n10. It might as you to restart your phone or something. If so do that.\n\n11. Go to Cydia.\n\n12. Click on the search tab.\n\n13. Search for iFile.\n\n14. Install iFile and if it asks you to restart or anythind do so.\n\n15. Go into iFile and now that is is is like Winscp where you can view your files and foldes on your phone so you will go to the same place as you would on opneSSH except when you go to the applications folder its now just a whole bunch of folders with random letters and numbers. Its the actual app names so its easier to find the RoadMate app but here are the steps.\n\n16. In iFile if your already not in the ''/'' directory go there now by clicking the tab in the left top corner til you are there.\n\n17. Go to ''privete''.\n\n18. ''var''.\n\n19. ''mobile''.\n\n20. ''applications''.\n\n21.  Then scroll down to the r's and find ''RoadMate'' and click into that folder.\n\n22. Now click the folder ''RoadMate.app'' and go into there.\n\n23.  Now find ''Info.plist'' and click that.\n\n24. Then at the top left corner click edit.\n\n25.Then scroll dow to the bottom and find ''SignerIdentity'' and delete that whole thing and make sure you delete all the way up so that there is no gap from the text below.\n\n26. Then below that you will see ''Apple iPhone OS Application Signing'' and you will also delete that whole text and once agaon make sure you delete all the way up so that there is no gap from the text below.\n\n27. so not it shouls read that the bottom like this:\n MainWindow\n UIPrerenderedIcon\n \n\n\n\nNot Like This:\n\n MainWindow\n \nUIPrerenderedIcon\n \n\n\n\n28. Once you have done that click save in the top right hand corner.\n\n29. Then click done and press the home button.\n\n30. Thats it!!!!!!\n\n\nNow if you find you dont like that way which I find is much easier you can just get my modified Info.plist file i have included in this torrent and follow the steps using Winscp and delete the old one and drag in the new one.\n\nIf you want to donate for all my time and effort you can do so on paypal email at &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;304457535c5551545542705d435e1e535f5d1e&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt; You can also you that email to contact me if you have any other questions or comments or just post a comment here and me or someone else will do are best to help you.\n\n\nAlso i want to make a website but know just the basics of html and barely any php so and i want to make a forum site and chat. So if anyone whats to help I will make them staff.\n\nPlease Seed!!!!!!\t\t","torrent":{"xt":"urn:btih:91026141742c3d35438f094f64771df15fbf22c2","amp;dn":"Magellan+RoadMate+US+%26+CAN+1.2+IPA+TGCLEADER","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91026141742c3d35438f094f64771df15fbf22c2","infoHashBuffer":{"type":"Buffer","data":[145,2,97,65,116,44,61,53,67,143,9,79,100,119,29,241,95,191,34,194]},"announce":[],"urlList":[]}}