{"title":"F1 2009 [PAL] [WiiTorrentZ]","uid":5358554,"size":1875770717,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:91c5a74ce4cdf13bfe9c37b544792c0e7a5078a8&amp;dn=F1+2009+%5BPAL%5D+%5BWiiTorrentZ%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ecabuk","files":-1,"time":1266025221,"description":"NAME: Family Trainer Outdoor Collection\nREGI: PAL\n\nLANG: MULTI-5\n\nGENR: Sports\nSIZE: 3.61GB\n\n\nProduct Description:\n\nThe game includes the specially designed Family Trainer mat controller which, when combined with the Wii Remote, lets players get totally physical in a series of crazed challenges. Unlike other games for the Wii which only focus on the arms, Family Trainer gets the feet involved too for total body gameplay. Simple controls and intuitive play make the game easy to just pick up and play, and let players of any age get involved, get physical and have maximum fun.\nThere are over a dozen frantic single and multiplayer challenges to choose from all based on outdoor challenges amusingly interpreted for the world of Family Trainer, such as river rafting, mine karting, log jumping, rope skipping and much more. The activities take place in a variety of colourful locations including jungle forests full of ancient ruins, a haunted mansion complete with hordes of zombies, and a fairytale world where riding on toys and floating amongst the clouds is the order of the day.\nPlayers can challenge friends or family members on the same mat, or cooperate together, for example trying to balance a runaway mine kart as it hurtles round a gravity defying track. Players can track their progress and set new records for their friends and family to beat, bringing a dose of healthy competition into the madcap mix.","torrent":{"xt":"urn:btih:91c5a74ce4cdf13bfe9c37b544792c0e7a5078a8","amp;dn":"F1+2009+%5BPAL%5D+%5BWiiTorrentZ%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91c5a74ce4cdf13bfe9c37b544792c0e7a5078a8","infoHashBuffer":{"type":"Buffer","data":[145,197,167,76,228,205,241,59,254,156,55,181,68,121,44,14,122,80,120,168]},"announce":[],"urlList":[]}}