{"title":"Pitbull feat. Akon - Shut It Down  (2nafish)","uid":5261742,"size":159715332,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:9230160851f72ca7c633cf953ef0059d670f9a01&amp;dn=Pitbull+feat.+Akon+-+Shut+It+Down++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1262759343,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 4000 Kb/s\nAudio: Linear PCM, 48000 Hz, Stereo, 1536 kbps\n\n\nThis video has no logo.\n\n&quot;Shut It Down&quot; is a song by hip-hop artist and rapper Pitbull released as the fourth single from his album, Rebelution. It features Akon.\n\nOn the week ending December 19, 2009, &quot;Shut It Down&quot; debuted on the Billboard Hot 100 at #85. It moved up in its second week to #83 and has since reached #69.\n\nRebelution is the fourth studio album by Miami rapper Pitbull, released on September 1, 2009. Featured guests include Akon, Avery Storm, Nayer, Lil Jon, The New Royales, Bass III Euro &amp; Slim of 112. It is also his first major-label release, his first album to be released on his own Mr. 305 Inc. label and also Polo Grounds' second release since Hurricane Chris's 51/50 Ratchet.\n\n    * The first single from the album was &quot;Krazy&quot;, produced and featured Lil Jon. It peaked at #30 on the Billboard Hot 100. The song samples Federico Franchi's 2007 song, &quot;Cream&quot;.\n    * The second single released was &quot;I Know You Want Me (Calle Ocho)&quot;, which has so far peaked at #2 on the Billboard Hot 100, making it his most successful song to date. The song is a remix of &quot;75, Brazil Street&quot; by Nicola Fasano Vs Pat Rich.\n    * The third single released was &quot;Hotel Room Service&quot; and has currently peaked at #8 on the Billboard Hot 100. The song recreates elements from &quot;Push the Feeling On&quot; by Nightcrawlers.[4]\n    * The fourth single is &quot;Shut It Down&quot;, featuring Akon. The music video was released on November 2, 2009.\n\nThe album debuted at #8 on the Billboard 200, selling 41,000 copies its first week. This is Pitbull's highest charting album since his debut album, M.I.A.M.I..\n\nArmando Christian PÃƒÂ©rez (born January 14, 1981), better known by his stage name Pitbull, is an American rapper. His first recorded performance was from the Lil Jon album Kings of Crunk in 2002, after which he released his debut album in 2004 titled M.I.A.M.I. (short for Money Is a Major Issue) under TVT Records. Since then, he has released two other albums under the label, El Mariel in 2006 and The Boatlift in 2007. He is also the host of his own Spanish-language program on the cable channel Mun2 titled La Esquina (Spanish for The Corner).\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:9230160851f72ca7c633cf953ef0059d670f9a01","amp;dn":"Pitbull+feat.+Akon+-+Shut+It+Down++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9230160851f72ca7c633cf953ef0059d670f9a01","infoHashBuffer":{"type":"Buffer","data":[146,48,22,8,81,247,44,167,198,51,207,149,62,240,5,157,103,15,154,1]},"announce":[],"urlList":[]}}