{"title":"Zeitgeist: Addendum - Sottotitoli in italiano","uid":5240350,"size":1080951570,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:931e463a1b1fba5fbb6d1fdb6bc8130c05f9ce9a&amp;dn=Zeitgeist%3A+Addendum+-+Sottotitoli+in+italiano&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Tarumbo","files":1,"time":1261736614,"description":"Zeitgeist: Addendum \n\nE' un web film non profit del 2008, diretto, prodotto e distribuito da Peter Joseph ed ÃƒÂ¨ il secondo capitolo di Zeitgeist, the Movie; ÃƒÂ¨ uscito in lingua inglese sottotitolato in diverse lingue, tra cui l'italiano.\n\nIl film discute riguardo il sistema della Federal Reserve negli Stati Uniti, della CIA, delle corporation americane e altro, concludendo con la presentazione del Venus Project, creato dall'ingegnere sociale Jacque Fresco. In accordo con Peter Joseph, il film ha come scopo di localizzare le radici della dilagante corruzione sociale, offrendo allo stesso tempo una soluzione. In conclusione Addendum sottolinea il bisogno di eliminare ogni barriera che divide gli uomini e individua i passi concreti da fare per indebolire il sistema monetario. Il film suggerisce azioni di &quot;trasformazione sociale&quot;, come boicottare le grandi banche, i media, il sistema militare e le multinazionali dell'energia.\n\n\n\n\n\n\nZeitgeist: Addendum ÃƒÂ¨ diviso in tre parti:\n\n    * Prima parte: viene criticata la tecnica della riserva frazionaria che permette la creazione di moneta tramite debiti. Secondo l'autore i dollari vengono stampati quando la Federal Reserve compra i titoli del tesoro americano. Questo denaro finisce nelle banche commerciali, dove viene moltiplicato attraverso il sistema della riserva frazionaria e quindi viene prestato ai consumatori. Nel film si afferma che tale sistema ÃƒÂ¨ assurdo in quanto il denaro che dev'essere pagato per saldare i debiti corrisponde alla totalitÃƒÂ  del denaro in circolazione, eccezion fatta per la richiesta di interessi sullo stesso che ne genera una quantitÃƒÂ  addirittura superiore, con la conseguente impossibilitÃƒÂ  a reperire, se pur ipoteticamente, una cifra sufficiente a saldare tale debito.\n    * Seconda parte: viene intervistato John Perkins, che si autodefinisce un killer economico. Perkins racconta di come ha aiutato la CIA e le elite politiche e industriali per le quali lavorava per minare dalle fondamenta legittimi regimi stranieri che ponevano gli interessi della propria popolazione prima di quelli delle multinazionali.\n    * Terza parte: viene intervistato Jacque Fresco, fondatore del &quot;Venus Project&quot;, progetto concepito per la liberazione della societÃƒÂ  dal denaro, utilizzando sapientemente la tecnologia e le risorse, in contrapposizione all'attuale societÃƒÂ  basata sul profitto e sulla scarsitÃƒÂ  delle risorse. Fresco propone numerose soluzioni per poter &quot;migliorare&quot; il mondo: in materia energetica, di trasporti, di lavoro (Fresco sostiene che:&quot;l'America oggi ÃƒÂ¨ incline al fascismo, la sua filosofia religiosa e dominante ha una propensione verso il sostegno di punti di vista fascisti; l'industria americana ÃƒÂ¨ essenzialmente un'istituzione fascista&quot;) utilizzando l'ingegno umano, dunque la tecnologia (&quot;Abbiamo la tecnologia per dare case e ospedali a tutta la popolazione&quot;).\n","torrent":{"xt":"urn:btih:931e463a1b1fba5fbb6d1fdb6bc8130c05f9ce9a","amp;dn":"Zeitgeist%3A+Addendum+-+Sottotitoli+in+italiano","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"931e463a1b1fba5fbb6d1fdb6bc8130c05f9ce9a","infoHashBuffer":{"type":"Buffer","data":[147,30,70,58,27,31,186,95,187,109,31,219,107,200,19,12,5,249,206,154]},"announce":[],"urlList":[]}}