{"title":"Starcraft 2 Beta, /w Lazy Launcher, /w Starcrack Launcher","uid":5416552,"size":1917375879,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:94c855e46eda4cb81c9ec9cca06f3fea2399925d&amp;dn=Starcraft+2+Beta%2C+%2Fw+Lazy+Launcher%2C+%2Fw+Starcrack+Launcher&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"FreeSCV","files":377,"time":1267945475,"description":"================================================================================\nIt's been a good 2 YEARS + since Blizzard made the news about SC2. It's like heaven.\n\nThen they decided to not let the Mormons and Jehovah's Witness into Heaven!\n\nYa it's cool, no one uses lan play for games anymore right? Get FUCKED Blizzard!\n\nI can understand wanting people to use Bnet but this is the Internet were talking about!\n\nLet the best server willing to make Sim Ant stye maps for conquerable territory win. Bnet server or whatever emulated one comes along.\n\nIf they are shut down like torrent servers are, well, we'll have more then enough servers. :D\n\n\nAnyways after getting this to work I thought I'd share what I got /w the rest of you looking for that &quot;one click download for Starcraft 2&quot;\n\n================================================================================\n\nSo we got some maps in here, the Lazy Loader 2.0 will open the installed Starcraft 2 in program files.\n\nThe original Starcraft 2.exe in program files won't do anything. Alt + F4 to close it.\n\nThere is also a Starcrack loader that can change races. For now just restart the game to get a different random race. :)\n\nThere is a GUI to change the difficulty or you can use a mod version for harder comps. Seems it's only 4 players, 1 human, 3 comps all ffa for this beta.\n\n\n================================================================================\n\n\nAVG Antivirus is alright to detect trojans. Didn't run into any problems. Only 1 lazy launcher had a trojan in it. Did not add that to the torrent file. :P\n\nComodo free firewall is nice for yes/no on yer net/programs\n\nPeer Block is good to block bad ip addresses while downloading. (formally Peer Guardian 2)\n\nHope I find one of your torrents FULL of maps and mods for more awesome gameplay someday. :D\n\nThanks Blizzard, great game except the lack of lan play. Least we know others will just add that in.\n\nPerhaps the pirate version WILL be better, not need a key, have conquerable territory and not just skirmishes.\n\nThanks to Lazy Launcher and all those who helped make this possible. I'm just trying to help make it easy by gathering all I've got for my swarm on here.\n\nLive for the swarm!","torrent":{"xt":"urn:btih:94c855e46eda4cb81c9ec9cca06f3fea2399925d","amp;dn":"Starcraft+2+Beta%2C+%2Fw+Lazy+Launcher%2C+%2Fw+Starcrack+Launcher","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94c855e46eda4cb81c9ec9cca06f3fea2399925d","infoHashBuffer":{"type":"Buffer","data":[148,200,85,228,110,218,76,184,28,158,201,204,160,111,63,234,35,153,146,93]},"announce":[],"urlList":[]}}