{"title":"2012 [SUBTITULADO].DVDRip XviD.AVI","uid":5431292,"size":749820368,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:94f8a1ebb8c65d1c5117901d9c303c88bbda4203&amp;dn=2012+%5BSUBTITULADO%5D.DVDRip+XviD.AVI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"eldiego90","files":-1,"time":1268421837,"description":"2012 La PelÃƒÂ­cula hablada en inglÃƒÂ©s y con subtÃƒÂ­tulos en espaÃƒÂ±ol latino.\n..................................................................................................................................................................................................................................................................................................................................................\n\nEXCELENTE AUDIO Y VIDEO\n\n\n\nResumen:\n\n\n2012 es una pelÃƒÂ­cula de catÃƒÂ¡strofes naturales dirigida por Roland Emmerich y distribuida por Columbia Pictures. El reparto incluye a John Cusack, Amanda Peet, Danny Glover, Thandie Newton, Oliver Platt, Chiwetel Ejiofor, y Woody Harrelson. La grabaciÃƒÂ³n comenzÃƒÂ³ en agosto de 2008 en Vancouver. Su lanzamiento mundial estaba originalmente previsto para el 10 de julio de 2009, pero fue pospuesto para el 13 de noviembre de 2009. La pelÃƒÂ­cula estÃƒÂ¡ ambientada en la actualidad, solo menciona superficialmente a la Cultura Maya y el calendario mesoamericano de Cuenta Larga.\n\n\n\n\nComentarios:\n\n\nDurante su estreno, la pelÃƒÂ­cula recibiÃƒÂ³ crÃƒÂ­ticas negativas por parte de los crÃƒÂ­ticos. Rotten Tomatoes informÃƒÂ³ que el 39% de los crÃƒÂ­ticos de cine dio una revisiÃƒÂ³n positiva, basada en una muestra de 174 comentarios, con una puntuaciÃƒÂ³n media de 5 sobre 10. Los crÃƒÂ­ticos citaron numerosas inexactitudes cientÃƒÂ­ficas, guiÃƒÂ³n flojo y fuerte dependencia de las imÃƒÂ¡genes CG, mientras que otros elogiaron los efectos del CG. En su secciÃƒÂ³n de &quot;Top Critics&quot;, les fue aÃƒÂºn peor con sÃƒÂ³lo el 23% de los crÃƒÂ­ticos dÃƒÂ¡ndole un examen positivo, basado en 30 comentarios, con un promedio de 4.6/10. En Metacritic, la pelÃƒÂ­cula tiene un puntaje de 51 sobre 100.\n\n\nPeter Travers de Rolling Stone criticÃƒÂ³ a la pelÃƒÂ­cula comparÃƒÂ¡ndola con Transformers: Revenge of the Fallen: &quot;Tengan cuidado con 2012, que tiene una milagrosa y dudosa coincidencia con Transformers 2, que cae en lo cÃƒÂ­nico, aturde mentalmente, pierdes el tiempo, gasto de dinero, te succiona el alma de manera estÃƒÂºpida&quot;.\n\nRoger Ebert se entusiasmÃƒÂ³ con la pelÃƒÂ­cula, dÃƒÂ¡ndole 3,5 estrellas sobre 4, diciendo que &quot;cumple lo que promete, [...] serÃƒÂ¡, para el pÃƒÂºblico, una de las mÃƒÂ¡s satisfactorias pelÃƒÂ­culas del aÃƒÂ±o&quot;.\n\nEn China, un comentarista alabÃƒÂ³ &quot;los elementos y escenas de China de la pelÃƒÂ­cula&quot;, diciendo que eran &quot;bien recibido por los cinÃƒÂ©filos locales.&quot; El artÃƒÂ­culo de un espectador para China Daily informÃƒÂ³ de que su teatro &quot;rompiÃƒÂ³ en aplausos porque un oficial del EjÃƒÂ©rcito Popular de LiberaciÃƒÂ³n saludaban a los sobrevivientes de AmÃƒÂ©rica, que llegaron a China&quot; durante la pelÃƒÂ­cula, aunque un miembro de la audiencia cercana tambiÃƒÂ©n comentÃƒÂ³ en voz alta que el director &quot;debe estar desesperado para halagar al pÃƒÂºblico chino por razones de taquilla&quot;. La sede de Apple Daily en Hong Kong informÃƒÂ³ que &quot;La pelÃƒÂ­cula describe la grandeza del gobierno chino y el pueblo chino. Esto hizo que el pÃƒÂºblico chino riera y aplaudiera. Ellos estaban muy emocionados&quot;.\n\n","torrent":{"xt":"urn:btih:94f8a1ebb8c65d1c5117901d9c303c88bbda4203","amp;dn":"2012+%5BSUBTITULADO%5D.DVDRip+XviD.AVI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94f8a1ebb8c65d1c5117901d9c303c88bbda4203","infoHashBuffer":{"type":"Buffer","data":[148,248,161,235,184,198,93,28,81,23,144,29,156,48,60,136,187,218,66,3]},"announce":[],"urlList":[]}}