{"title":"Das Leben der Anderen","uid":5209484,"size":2365521920,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:95aa83a1f71e79ae38debd9c2f83c30f6fb78ddb&amp;dn=Das+Leben+der+Anderen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"OmaBlue","files":1,"time":1260530513,"description":"Excellent depiction of a real-life &quot;1984&quot;, 14 January 2008\n\nIt is both fascinating yet somehow disturbing that this movie is about a period in history that seems so far removed from modern times yet takes place barely 20 years ago. Set in 1984 communist East Germany, &quot;The Lives of Others&quot; provides us with a behind-the-scenes look at the chillingly efficient Stasi secret police. The depressing tone of such a society is evident throughout, yet we can feel the twinge of hope that hides within its main characters, even the by-the-book secret service captain who has a writer's apartment wired and listens to everything that goes on in his life. A real-life approximation of the kind of repression depicted in the classic novel &quot;1984&quot; should give us pause. I thought it especially fitting that this movie does not show us state-sponsored torture, murders or other horrific realities that certainly existed in Stalinist regimes. Instead, the threat expressed to those who would dare speak against the regime involved loss of dreams, such as the theater director being blacklisted or the actress being robbed of her audience. Chillingly, in such a world that offered little hope, that may be a more effective threat than physical pain, or even death itself, which at least removes one from the situation. This is a movie that is not only a splendid piece of film-making, but one that has valuable worth in the real world. Those on the verge of taking freedom for granted would do well to spend two hours taking in this excellent film.","torrent":{"xt":"urn:btih:95aa83a1f71e79ae38debd9c2f83c30f6fb78ddb","amp;dn":"Das+Leben+der+Anderen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95aa83a1f71e79ae38debd9c2f83c30f6fb78ddb","infoHashBuffer":{"type":"Buffer","data":[149,170,131,161,247,30,121,174,56,222,189,156,47,131,195,15,111,183,141,219]},"announce":[],"urlList":[]}}