{"title":"Backlight Agenda 2010 Slavoj ZiÃ…Â¾ek","uid":5275063,"size":179507808,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:97518b1a7acfc55fc4fb680ce7c27d6a8e4dc77a&amp;dn=Backlight+Agenda+2010+Slavoj+Zi%C3%85%C2%BEek&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":-1,"time":1263346738,"description":"An (English-spoken) interview with the popular Slovenian philosopher and thinker Slavoj ZiÃ…Â¾ek on the Dutch program Backlight (VPRO's Tegenlicht). The first 50 \nseconds are Dutch, but are just an introduction to Slavoj ZiÃ…Â¾ek, and a translation can be found in the included text file (the rest of the program is entirely English spoken with Dutch subtitles).\n\n\nRuntime: 50:31\nResolution: 320x180\nCodec: WMV3 (.asf webrip, tried several recodes but because of the variable\nframerate of the codec the audio always drifted out of sync).\n\n\nDescription:\n\n&quot;The Elvis of culture theory&quot; is just one of the many nicknames the Slovenian philosopher has acquired. He owes his reputation to his polemic style and dazzling performances, in which he mercilessly analyses modern capitalism using the modern culture of images amongst other things.\n\nBacklight confronts the &quot;thought beast of Ljubljana&quot; with fragments of upcoming broadcasts and asks him to set the agenda for 2010.\n\nAt a recent performance in the Netherlands, Slavoj ZiÃ…Â¾ek ended his provocative \nand comical performance with the sentence: 'So yes, we communists are back!' \nThis is, despite the often capricious approach, the place where the Solvenian philosopher always arrives: the current capitalist system, that after the cold war would have been implemented around the world, is not viable. And we're on the  verge of major problems that require major solutions: climate, poverty, migration.\n\nWhat remains of the left, has allowed itself to be encapsulated in the western liberal democracy and no longer dares to come up with radical solutions. ZiÃ…Â¾ek does. Because of this, the editors of Backlight decided at the onset of the year to bombard him with images from recent and upcoming broadcasts revolving around four major themes: the economic crisis, the ecological crises, the security crisis and the crisis of democracy. And so there's actually only one question that the \n&quot;Elvis of culture theory&quot; should be asked: 'Mr. Slavoj ZiÃ…Â¾ek, what to do?'\n\nComposition: Chris Kijne\nDirection: Marije Meerman\nProduction: Mariska Schneider /Pepijn Boonstra\nResearch: Marijntje Denters/Maren Merckx\nEditing: Henneke Hagen/Jos de Putter","torrent":{"xt":"urn:btih:97518b1a7acfc55fc4fb680ce7c27d6a8e4dc77a","amp;dn":"Backlight+Agenda+2010+Slavoj+Zi%C3%85%C2%BEek","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97518b1a7acfc55fc4fb680ce7c27d6a8e4dc77a","infoHashBuffer":{"type":"Buffer","data":[151,81,139,26,122,207,197,95,196,251,104,12,231,194,125,106,142,77,199,122]},"announce":[],"urlList":[]}}