{"title":"Asses.Of.Face.Destruction.8.XviD-PORNOLATiON","uid":5448585,"size":1456935029,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:975467393c46c326248a63164946206696e20b31&amp;dn=Asses.Of.Face.Destruction.8.XviD-PORNOLATiON&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TvTeam","files":102,"time":1269101946,"description":" &lt;a href=&quot;http://www.torrentday.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.torrentday.com&lt;/a&gt; - The Hottest Scene xXx on the Web.\n\n &lt;a href=&quot;\nhttp://www.torrentday.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.torrentday.com&lt;/a&gt; :  Your Key To The Scene.\n\n\nEnjoy =)\n\n...................................NFO:....................................\n\n.                                                 `high!HoA           \n                           \n          \n  \n  \n                \n                          \n               \n                       \n                                      \n       \n                                           \n                                                                          \n           . . .: P O R N O L A T i O N : P R E S E N T S :. . .             \n\n Title         : Asses of Face Destruction 8 (c) Evil-Angel\n Release date  : Mar 20 2010\n Store Release : Mar 18 2010\n\n Size          : 2 CDs (49x15mb - 49x15mb)\n Source Format : NTSC DVD\n Format        : XviD\n Resolution    : 512 x 384\n Audio         : VBR MP3\n\n Language      : English (US)\n Category      : Fetish\n URL           : http://www.game-port.com/justrele.htm\n                                                                             \n                                                                  \n    RELEASE  INFO    \n                                              \n                                                                          \n                                                                             \n\n Scene 1: Kati Summers looks like the blue-eyed blonde next-door - if you\n happen to live by a hot, dominant face-sitter. She's cute with her natural\n tits, shamrock tattoo by her thigh and bejeweled belly button, but she means\n business. The scene starts in POV-style, with Kati teasing you with her body,\n looking into the camera eye and imploring you to worship her. Pervy Jason\n stares rudely as she lifts weights, so she sits him on the weight bench and,\n still in her workout shorts, sits on his face. His pathetic effort on the\n treadmill earns him the sting of the flogger, and once Kati nudes up, the\n real punishment happens. She grinds and bounces her butt on his face, forcing\n his nose up her ass. &quot;God, I love having an ass slave ... a pervert under me.\n I can train him well,&quot; she declares. After a thorough smothering she looks\n back into the camera and says, &quot;This could be you, slave.&quot;\n\n Scene 2: Natural-bodied, dirty blonde Kirra Lynne looks wicked in heels,\n thigh-high black latex stockings and gloves. Her tattoos and the gap in her\n teeth give her an endearing but dangerous look. Teasing and taunting the\n viewer, she flirts breathily and flaps her shapely ass cheeks hypnotically.\n &quot;This is your dream, slave,&quot; she asserts, and we see her bouncing on the\n sweaty face of slave Bubba, his tongue pressing firmly in her groove. Next\n she's dominating cellophane-bound slave Jason. As he orally services her hot\n holes she forces him to say, &quot;Your pussy and ass are better than my wife's,&quot;\n and she makes him commit to daily service.\n\n Scene 3: Naked save for heels and slutty hoop earrings, longhaired Alexis\n Breeze shows off natural tits and a broad, fleshy ass. In her L.A. Latina\n accent she orders you to worship her ass and lick her asshole, but soon her\n shit-talking comes in spicy Spanish spasms. She rides slave Bubba's face and\n slaps his dick, which she claims as her own with no fight from the wimp. Still\n in his socks, he jacks off and sucks her asshole. Alexis rides his dick as she\n yanks on his leash and slaps his face. He eats her holes and pledges his loyalty\n to her holes as he masturbates.\n\n Scene 4: Nasty Sandra Romain takes the dominant role and blonde Barbara Summer\n is the submissive. The ladies share palpable passion for severe face-sitting and\n ass worship, punctuated by filthy talk. Sandra picturesquely presses her ass\n cheeks around the face of Barbara, who slides her tongue into the Mistress'\n groove. &quot;Don't cheat. Just open your eyes when you want to breathe,&quot; says Sandra,\n and, &quot;I'm not gonna let you take a shower after this, so you'll have my smell\n everywhere.&quot; Among rim jobs and wet, genuine kisses, Sandra's sweet nothings\n continue: &quot;You don't know how much I hate you ... how much bad stuff I talk about\n you, you fucking piece of shit.&quot; And with that Barbara's head is yanked\n energetically up Sandra's ass.\n\n Scene 5: Dirty blonde Nikki Sexx brings her huge ass to bleached blonde Cali\n Haze, who sports gigantic natural knockers. Cali perches over Nikki: &quot;Suck,\n slave. Worship that fucking shit,&quot; says Cali. &quot;You fuckin' belong underneath\n my fuckin' pussy, slave.&quot; That leads to a vigorous face-sitting complete with\n tasty rim job. Nikki eats Cali from behind, the better to view and taste all\n Cali has to offer. And the girls kiss goodbye.\n\n Starring: Barbara Summer, Cali Haze, Kati Summers, Kirra Lynne, Nikki Sexx,\n           Sandra Romain, Alexis Breeze, Bubba, Jason.\n\n                                                                             \n                                                                  \n        NEWS         \n                                              \n                                                                          \n                                                                             \n We Release Movies For Free. We Do It For Fun, And We Do It For No Profit\n Except The Satisfaction Of Spreading The Wealth.\n\n WE DO NOT ACCEPT MONEY BRIBES\n WE DO NOT GIVE YOU LINKS OR FILL FILES FOR OUR RELEASES !!\n WE DO NOT RUN WWW LINK NOR AN IRC CHANNEL NEVER EVER !!\n WE DO NOT PROVIDE HELP FOR MISSING FILES / BAD FILES\n WE DO NOT CONDONE SELLING MOVIES FOR PROFIT &lt;-- BAD !!\n WE DO NOT NEED COURIERS\n\n IRC  : NEVER EVER.\n WWW  : NEVER EVER.\n\n                                                                             \n                                                                  \n      EDITORIAL      \n                                              \n                                                                          \n\n                                                                        \n &lt;a href=&quot; http://www.javno.com/en/world/clanak.php?id=164168&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.javno.com/en/world/clanak.php?id=164168&lt;/a&gt;\n\n\n                                                                             \n                                                                  \n       MEMBERS       \n                                              \n                                                                          \n                                                                             \n\n Here in Pornolation Nation, we pride ourselves on our outstanding crew,\n dedicated and willing to do whatever it takes. That includes, but is not\n limited to, testing all our releases with 10lbs. of crisco and a box of\n Kleenex, testing all our releases on our girlfriends and wives (if they\n run away screaming and refuse to have sex with us for a week, it's a good\n release... a month, it's outstanding), testing all our releases on a gay\n guy (if he doesn't turn straight, it's not worth releasing) and testing all\n our releases on P****** of R****** (if he likes it, it's just *wrong* and\n we will never release it).\n                                                                             \n                                                                  \n      GREETINGS      \n                                              \n                                                                          \n                                                                             \n\n Pornolation Nation salutes the competition.\n\n                                                                             \n                                                                  \n     DISCLAIMER      \n                                              \n                                                                          \n                                                                             \n\n\n We actually love women. Please, please, please, don't let me sleep on the\n couch tonight, L!\n\n We bought this release. Support the adult industry, help put Vivid and VCA\n out of their misery, buy it you, too, if you enjoyed it (Jill Kelly needs\n to get on this list, as well, we think).\n\n Pornolation Nation are not responsible for any harm, actual or hypocondric,\n caused by watching this release. Known side effects are prolonged priapism,\n pronounced musculature on either or both forearms, callused palms and\n related relationship disorders.\n\n No pornsluts were harmed in the making of this release. Contrary to popular\n belief, do not have one or more fingers or other external digits in the\n mouth of a pornslut when you shove a big dildo up her ass. She will bite\n down. It hurts.\n\n                                                                             \n                                                                  \n     FINAL WORDS     \n                                              \n                                                                          \n                                                                             \n\n Having more sex reduces the chance of erectile dysfunction, provides stress\n release, and more than a dozen other benefits\n\n                                                                             \n                                                                    \n        \n                                           \n                                                                          \n                -[ ASCii By `high24[7 @ HighOnASCii 2006 ]-","torrent":{"xt":"urn:btih:975467393c46c326248a63164946206696e20b31","amp;dn":"Asses.Of.Face.Destruction.8.XviD-PORNOLATiON","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"975467393c46c326248a63164946206696e20b31","infoHashBuffer":{"type":"Buffer","data":[151,84,103,57,60,70,195,38,36,138,99,22,73,70,32,102,150,226,11,49]},"announce":[],"urlList":[]}}