{"title":"webscarab","uid":5425192,"size":3919677,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:99118efb52091c904c157df032179ae006de2fc7&amp;dn=webscarab&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cottscriddle","files":2,"time":1268227754,"description":"WebScarab is a framework for analysing applications that communicate using the HTTP and HTTPS protocols. \n\nIt is written in Java, and is thus portable to many platforms.\nWebScarab has several modes of operation, implemented by a number of plugins.\nIn its most common usage, WebScarab operates as an intercepting proxy, \nallowing the operator to review and modify requests created by the browser before they are sent to the server,\nand to review and modify responses returned from the server before they are received by the browser. \nWebScarab is able to intercept both HTTP and HTTPS communication. \nThe operator can also review the conversations (requests and responses) that have passed through WebScarab. \n\n\nThere is no shiny red button on WebScarab, \nit is a tool primarily designed to be used by people who can write code themselves, \nor at least have a pretty good understanding of the HTTP protocol. If that sounds like you, welcome!\n\nWebScarab is designed to be a tool for anyone who needs to expose the workings of an HTTP(S) based application,\nwhether to allow the developer to debug otherwise difficult problems,\nor to allow a security specialist to identify vulnerabilities in the way that the application has been designed or implemented.               ","torrent":{"xt":"urn:btih:99118efb52091c904c157df032179ae006de2fc7","amp;dn":"webscarab","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99118efb52091c904c157df032179ae006de2fc7","infoHashBuffer":{"type":"Buffer","data":[153,17,142,251,82,9,28,144,76,21,125,240,50,23,154,224,6,222,47,199]},"announce":[],"urlList":[]}}