{"title":"Super Mp3 Download-3.3.2.2","uid":5338907,"size":6479598,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:99c967044f384b0b6bfdaa678bd92f784784efa9&amp;dn=Super+Mp3+Download-3.3.2.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"muryucu","files":-1,"time":1265402656,"description":"Search, fast download and unlimited listen to 100 million MP3 online\n\nSuper MP3 Download is easy to use application created to help you search and download over 100 million MP3 files.\n\nYou can try the searched results to decide which one to download. Super MP3 download always brings you the hottest songs in the world; it recommends you the Billboard Hot 100 every week and lists the hottest songs of 14 categories, from electrical to religious, mainstream to indie, hip-hop to classical, etc. Besides, you can do advanced search by artist, title, album, and edition. You can even choose specific edition of live, piano, guitar or cover etc. to search.\n\nHere are some key features of &quot;Super MP3 Download&quot;:\n\nOver 100 Million MP3 songs:\nÃ‚Â· Super MP3 Download is free to use. You can search and download over 100 million MP3 from the largest download network fast\n\nBring You The Hottest Songs:\nÃ‚Â· Super MP3 download always brings you the hottest songs in the world. We recommend you the Billboard Hot 100 every week and list the hottest songs of every category, from electrical to religious, mainstream to indie, hip-hop to classical.\n\nUnlimited Listen To Music Online:\nÃ‚Â· You can unlimited listen to over 100 million songs online\nÃ‚Â· You can try the searched results to decide which one to download.\n\nAdvanced Search:\nÃ‚Â· Super MP3 download can search songs by title, artist, album, and edition. You can even search the live, piano, guitar or cover editions of your favorite songs","torrent":{"xt":"urn:btih:99c967044f384b0b6bfdaa678bd92f784784efa9","amp;dn":"Super+Mp3+Download-3.3.2.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99c967044f384b0b6bfdaa678bd92f784784efa9","infoHashBuffer":{"type":"Buffer","data":[153,201,103,4,79,56,75,11,107,253,170,103,139,217,47,120,71,132,239,169]},"announce":[],"urlList":[]}}