{"title":"Ranger of Brownstone &amp; Tough to be a Bird (VHS)","uid":5360802,"size":884681176,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9acb6a89868d6dd0f7245afb87d3e15789a87790&amp;dn=Ranger+of+Brownstone+%26+Tough+to+be+a+Bird+%28VHS%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":null,"files":1,"time":1266090643,"description":"This video has 2 separate episodes from &quot;The Wonderful World of Disney&quot; television show that played on Sunday nights from 1953 to 1983. The first is the very popular &quot;The Ranger of Brownstone&quot;, originally aired in 1968, and again in 74, 77, 79, and 82. The episode is basically a compilation of six animated shorts that are edited into one long storyline. The best is the one with the music that every kid gets up and dances to, as the ranger directs the bears to pick up trash. Most of the stories feature the hilarious Humphrey the Bear trying to outwit the ranger in getting food where he is told not to... This predates Yogi by the way. Ranger Woodlore tries to run his forest in an orderly fashion but with Humphrey around anything and everything goes wrong. This compilation works and is hysterically funny. \n\nThis next episode first aired in 1970, then 71, and 77. &quot;Its Tough to be a Bird&quot; is the theatrical featurette that won an Academy Award Ã‚Â® for Best Cartoon Subject 1969. It had been edited to lengthen it for the TV episode, and features a story about the trials and tribulations of being a bird in a man's world. They are shot at for starters, and yet man wishes he could fly like a bird. Very unusual animation style for Disney. ","torrent":{"xt":"urn:btih:9acb6a89868d6dd0f7245afb87d3e15789a87790","amp;dn":"Ranger+of+Brownstone+%26+Tough+to+be+a+Bird+%28VHS%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9acb6a89868d6dd0f7245afb87d3e15789a87790","infoHashBuffer":{"type":"Buffer","data":[154,203,106,137,134,141,109,208,247,36,90,251,135,211,225,87,137,168,119,144]},"announce":[],"urlList":[]}}