{"title":"James Cameron's Avatar: Das Spiel MULTI 7","uid":5273176,"size":3890919424,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9b2664ab11cd471c9f4573e9891aae051de2ee22&amp;dn=James+Cameron%5C%27s+Avatar%3A+Das+Spiel+MULTI+7&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"den1997","files":1,"time":1263256600,"description":"James Cameron's Avatar: Das Spiel ist das offizielle Videospiel zum mit Spannung erwarteten Blockbusterfilm James Cameron's AVATAR. Der Spieler taucht in das Herz von Pandora ein, einem fremdartigen Planeten, der seine kÃƒÂ¼hnsten Vorstellungen ÃƒÂ¼bertreffen wird.\n\nMan trifft auf die Na'vi, Pandora's heimische BevÃƒÂ¶lkerung, und entdeckt Kreaturen sowie andere Lebensformen, wie sie noch nie zuvor in der Welt der Videospiele zu sehen waren.\n\nAls ein Konflikt zwischen den Na'vi und der RDA Corporation, einem Raumfahrt-Konsortium, das nach wertvollen Ressourcen sucht, ausbricht, wird der Spieler in einen Kampf um das Herz des Planeten und das Schicksal einer ganzen Zivilisation hineingezogen.\n\nFeatures Avatar\n\n    * Tauche ein in die Welt von James Cameron Blicke tief ins Herz von Pandora und entdecke James Cameron's Universum mit deinen eigenen Augen.\n    * Erlebe einen schweren Konflikt zwischen zwei Welten KÃƒÂ¤mpfe fÃƒÂ¼r deine Sache: RDA oder Na'vi. Individualisiere mehr als insgesamt 60 RDA- und Na'vi-Waffen. WÃƒÂ¤hle deine Fertigkeiten, von denen jeder Clan 20 verschiedene besitzt. Fahre Fahrzeuge und reite auf Tieren. Erweitere das Schlachtfeld im Online-Multiplayer-Modus.\n    * Erschaffe deinen eigenen Charakter und erlange im Spielverlauf stÃƒÂ¤ndig neue FÃƒÂ¤higkeiten.\n\n\nWindows XP / Vista / Windows 7\n2.66 GHz Intel Pentium D, AMD Athlon 64 3500+ oder besser\n1 GB RAM (2 GB minimum fÃƒÂ¼r Windows Vista und Windows 7)\nDirectX 9","torrent":{"xt":"urn:btih:9b2664ab11cd471c9f4573e9891aae051de2ee22","amp;dn":"James+Cameron%5C%27s+Avatar%3A+Das+Spiel+MULTI+7","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b2664ab11cd471c9f4573e9891aae051de2ee22","infoHashBuffer":{"type":"Buffer","data":[155,38,100,171,17,205,71,28,159,69,115,233,137,26,174,5,29,226,238,34]},"announce":[],"urlList":[]}}