{"title":"VII Gates - Fire walk with me 320 kps","uid":5405079,"size":100066110,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9c1ee9238ca055c5c743440c5f273b55d3e4d6bc&amp;dn=VII+Gates+-+Fire+walk+with+me+320+kps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"RRejme","files":10,"time":1267563204,"description":"This is a stricly legal upload. VII Gates first album &quot;Fire, walk with me&quot; was released in 2004 by Soundriot Records. But it was only sold for a few months before VII Gates broke with the label, and thus the album became unavailable. Until now, when it was decided to &quot;release&quot; it again, for free. Check http://www.crown.nu/wordpress/?page_id=18 for more info. \n\nThere are also a 160 kps upload, on http://thepiratebay.se/torrent/3516629/VII_Gates_-_Fire_walk_with_me for those who give prior to space on their media devices.\n\n&quot;VII Gates' heavy metal is close to perfect&quot; (Tartaeran Desire)\n\n&quot;Sound Riot have a winner in this band - perhaps they have discovered the next Rainbow or UFO!!&quot; (Battle Helm)\n\n&quot;If this band holds it together and is fortunate enough to make it bigover time, Fire, Walk With Me will eventually be hailed as a classic Metal album that will be held up by many as one of the better efforts the genre has ever produced. My advice to you is to get on the bandwagon now and be one of the first to make this realization before someone tells you you should have 10 years from now!&quot; (Metalexpressradio.com)\n\n&quot;Now its up to the metalheads to discover what a truly good band VII Gates really are.&quot; (Metal-rules.com)\n\n&quot;I'm not sure if the band knows which songs they wrote kick the most ass either&quot; (Metalcrypt.com) \n\nPerfect for anyone who likes any of the following bands: Accept, Agent Steel, Blind Guardian, Crimson Glory, Dark Moor, Deep Purple, Europe, Gamma Ray, Giant, Glenn Huhges, Halford, Hammerfall, Heaven's Gate Helloween, Iced Earth, Insania, Iron Maiden, Jag Panzer, Judas Priest, King Diamond, Leningrad Cowboys, Manowar, Nocturnal Rites, Oz, Paragon, Primal Fear Rainbow, Riot, Rough Silk, Royal Hunt, Sonata Artica, Spinal Tap, Stormwitch, Tad Morose, THunderstone, Twilightning, Whitesnake\t","torrent":{"xt":"urn:btih:9c1ee9238ca055c5c743440c5f273b55d3e4d6bc","amp;dn":"VII+Gates+-+Fire+walk+with+me+320+kps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c1ee9238ca055c5c743440c5f273b55d3e4d6bc","infoHashBuffer":{"type":"Buffer","data":[156,30,233,35,140,160,85,197,199,67,68,12,95,39,59,85,211,228,214,188]},"announce":[],"urlList":[]}}