{"title":"Hardtied-------ReneeBlaine.rm","uid":5266235,"size":225513619,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:9c4fa679d72e5e48a52fdf7a39f4b86180aeeca8&amp;dn=Hardtied-------ReneeBlaine.rm&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"merzedes","files":1,"time":1262892833,"description":" Renee Blaine\n\n(Posted: December 2, 2009)  \n      \nrenee went out with Master A and when he gets her home has another party planned for the evening. The dress she wore was elegant but he prefers her to be dressed like what she is, a slut for his amusement. she doesn't need a completely new outfit. With the help of a pair of scissors he makes a few deft adjustments and suddenly she is perfectly attired for what he has in mind. \n\nrenee is a bit of an uncooperative cunt. While Master A is dressing her up she is constantly kicking and struggling. That kind of behavior doesn't go unnoticed, or unpunished. The simple solution is to tie her feet to the floor but that isn't enough to make absolutely sure she's learned her lesson. Running another rope between her legs so that it pinches her clit is a good start. He doesn't even need to vibrate her clit directly. Putting the vibrator on the rope is enough to make the sensation travel. The lesson doesn't come from the vibrator, but from his cane. Master A keeps slapping it against her legs and tits until she learns who her body belongs to. she learns fast. When he puts a new vibrator directly onto her clit she knows better than to cum right away. she begs so nicely that he even lets her have a little orgasm. \n\nrenee made the mistake of flipping Master A off earlier. Now she's stuck holding up a sharp stick with them, hoping desperately that she doesn't drop it while he fucks with the rest of her body. He has Mr. Pogo, a rubber dick on a stick, as far into her cunt as possible and he props it up there while he flogs her back and ass. she works her hips and pussy like a dancer on that cock while he watches. \n\nMaster A decided to be a bit nicer to renee. she's spent a lot of time on her feet so now she has the chance to lay flat on her back. With her legs spread open wide it makes her cunt into the perfect bull's-eye for his flogger. He beats on her snatch a bit more because the pain gets her wet, then he starts finger fucking her while she is helplessly moaning. she really starts to vocalize like a true slut when the vibrator hits her clit. renee cums in a matter of minutes. The only thing left to do is lick the taste of her juices from his hands. \n\nScreens &lt;a href=&quot; http://hardtied.com/pages/full0.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://hardtied.com/pages/full0.php&lt;/a&gt;\n\nCheers  :-)","torrent":{"xt":"urn:btih:9c4fa679d72e5e48a52fdf7a39f4b86180aeeca8","amp;dn":"Hardtied-------ReneeBlaine.rm","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c4fa679d72e5e48a52fdf7a39f4b86180aeeca8","infoHashBuffer":{"type":"Buffer","data":[156,79,166,121,215,46,94,72,165,47,223,122,57,244,184,97,128,174,236,168]},"announce":[],"urlList":[]}}