{"title":"Democracy Now - 11 apr 2011","uid":6311144,"size":446538373,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:9d761feb0b8dcab24759ffd8ddf3b0323e005d8c&amp;dn=Democracy+Now+-+11+apr+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1302539915,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Apr 11, 2011\n\n- One Month After Quake Japan Expands Evacuation Zone, Tens Of Thousands Dead, Missing\n- President Obama To Announce Deficit Plan, Healthcare Cuts, Tax Increases For Wealthy\n- Lawmakers Reach Budget Deal, $38 Billion Cut\n- Libya: NATO Increases Attacks On Gaddafi Forces, African Leaders Seek Peace Deal\n- Syrian Security Forces Clash With Protesters, Dozens Killed\n- Egypt Army Soldiers Attack Tahrir Square Killing Two Protesters\n- Bahrain: Police Raid Home Of Prominent Human Rights Activist\n- United Arab Emirates Detains Three Activists\n- Ivory Coast: Helicopters Strike Gbagbo Residence, Ouattara Forces Accused of Atrocities\n- Israel Cracks Down on Gaza, 19 Killed\n- Worldwide Military Spending Reaches Record High\n- Wisconsin Supreme Court Race Headed For Recount Amid Calls For Investigation\n\n\nSpecial reports\n\n- &quot;Don't Punish the Poor&quot; Economist Jeffrey Sachs Slams Obama-GOP Budget Deal\n\nPresident Barack Obama and congressional leaders reached a last-minute budget deal on Friday, narrowly averting a government shutdown. The deal would cut roughly $38 billion from a federal budget expected to exceed $3.7 trillion this year. We speak to Jeffrey Sachs, director of The Earth Institute at Columbia University. &quot;Many of of us who supported President Obama just feel that he has abandoned the field,&quot; Sachs says. &quot;He has left it to the right-wing, which wants nothing more than taxes cut for the rich, whereas the American public is saying very clearly in every opinion survey that if you want to close the deficit go after taxes for the rich, raise them, cut military spending, cut the excess profits in the insurance industry and healthcare. Do things that would really make a difference-don't punish the poor.&quot;\n\n\n- As Violent Crackdown Intensifies in Syria, Freed Egyptian American Engineer Mohamed Radwan Recounts Ordeal in Syrian Jail\n\nIn an exclusive interview, Mohamed Radwan speaks to Democracy Now! correspondent Anjali Kamat at his family's home in Cairo. Radwan, an Egyptian-American engineer working in Syria, was arrested in Damascus on March 25 while photographing anti-regime protests in the city on his cell phone. He was not charged with any crime. Radwan had previously taken part in the pro-democracy uprising in Egypt. [includes rush transcript]\n\n\n- U.S. Backs Down And Grants Visa to Omar Barghouti, Palestinian Advocate Of Israel Boycott\n\nThis weekend saw the heaviest attacks on Gaza by Isreali forces since the 2008-2009 war on Gaza. Nineteen Palestinians were killed. We speak to Palestinian activist Omar Barghouti, author of the new book, Boycott, Divestment, Sanctions: The Global Struggle for Palestinian Rights. After months of extended delays and an international public pressure campaign, in March the U.S. Consulate in Jerusalem granted Barghouti a visa to visit the United States for his book tour.\n\n\n- CIA-Trained Airline Bomber Set Free After Acquittal by Texas Jury\n\nLuis Posada Carriles, a former CIA operative best known as the suspected mastermind of the deadly 1976 bombing of a Cuban airline jet, was acquitted Friday. He wasn't facing terrorism charges, but eleven charges of perjury, immigration fraud, and obstruction of justice. Although the U.S. government believes he is an international terrorist, Posada Carriles was freed on Friday. Will the Obama administration let him walk the streets of Miami?\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;","torrent":{"xt":"urn:btih:9d761feb0b8dcab24759ffd8ddf3b0323e005d8c","amp;dn":"Democracy+Now+-+11+apr+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d761feb0b8dcab24759ffd8ddf3b0323e005d8c","infoHashBuffer":{"type":"Buffer","data":[157,118,31,235,11,141,202,178,71,89,255,216,221,243,176,50,62,0,93,140]},"announce":[],"urlList":[]}}