{"title":"EXTRACT.2009.DVDrip[vice]","uid":5198650,"size":444152629,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9e2b6b11fcb97de98ef056d8e288192ab5aad93f&amp;dn=EXTRACT.2009.DVDrip%5Bvice%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"vicerock","files":-1,"time":1260046406,"description":"EXTRACT 2009 DVDrip\n\nVIDEO CODEC Xvid\nformat Avi\nsize/res 480x234[wide screen]\nrun-time 01:31:46\nvideo bitrate 512\nvideo framerate 25\nXvid profile asp5\n\nAUDIO CODEC mp3\naudio bitrate 128\nsample rate 44100\na/v sync basic\n\nCAST\n\nJason Bateman\nBen Affleck\nKristen Wiig\nMila Kunis\nJ.K. Simmons\n\nPlot\n\nJoel Reynolds is the owner and founder of Reynold's Extract, a flavor-extract company. Although his business is successful, he feels unfulfilled and frustrated due to not having sex with his wife Suzie in over a month, and must also deal with incompetence and increasing discontent among his employees. His best friend Dean, a bartender, tries to ease his mind with Xanax and various other drugs, but the strait-laced Joel refuses.\n\nOne day, a series of mishaps occurs at the extract factory, resulting in worker Step losing a testicle. Cindy, a con-woman and drifter, sees a news story about the accident and gets a job at the factory, flirting with Joel in order to find out more information about Step. Although Step initially decided not to sue the company, after a &quot;chance meeting&quot; with Cindy, and under her influence, he changes his mind and hires local ambulance-chasing lawyer Joe Adler.\n\nJoel entertains the idea of an affair with Cindy, but - in spite of their non-existent sex life - still loves Suzie and would not want to have any regrets. At the bar, Dean suggests hiring a male gigolo to seduce his wife, so that Joel can then have a guilt-free affair of his own. Joel initially balks at the idea, but - after his judgment is impaired by some of Dean's Xanax - eventually accepts and the two hire Brad to pose as a pool cleaner and have an affair with Suzie. The next morning, Joel realizes what he agreed to and tries to stop Brad from going to his house, but he is too late, and Brad subsequently returns to have sex with Suzie many more times. After spending a night with Dean and his friend Willie smoking marijuana, Joel attempts to call Cindy, but soon realizes that he is calling Willie's number. Just then, Cindy walks into the apartment, and Willie punches Joel in the face.\n\nJoel meets with Adler and his associates in the factory office to discuss the terms of the settlement. The workers, believing that the meeting is about a buy-out of the factory by General Mills, decide that they are tired of being pushed around and organize a strike. Frustrated by the unflinching negotiations of Adler and the disrespect from his employees, he storms out and goes home, where Suzie begins to admit that she had an affair with Brad. Joel admits he hired Brad to sleep with her, and Suzie gets very upset and kicks him out of the house.\n\nJoel moves into a motel where he spots Cindy staying in another room. When he goes to her room, he notices a purse that looks like one belonging to one of his employees that was stolen, as well as other stolen items, and realizes that she is attempting to scam the company and Step. He begins to call the police, but Cindy breaks down in tears. At first Joel believes that she is attempting to gain his sympathy again, but when he is convinced that her tears are real, he softens, and the two spend the night together. The next morning, Cindy disappears, but leaves the stolen items behind.\nhttp://www.imdb.com/title/tt1225822/\n\n\nPLEASE SEED AND ENJOY THANKS","torrent":{"xt":"urn:btih:9e2b6b11fcb97de98ef056d8e288192ab5aad93f","amp;dn":"EXTRACT.2009.DVDrip%5Bvice%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e2b6b11fcb97de98ef056d8e288192ab5aad93f","infoHashBuffer":{"type":"Buffer","data":[158,43,107,17,252,185,125,233,142,240,86,216,226,136,25,42,181,170,217,63]},"announce":[],"urlList":[]}}