{"title":"The Appeal by John Grisham unabridged [azoozz]","uid":5358393,"size":361558856,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9f76c8007489ff91b091f48441b5919d731ed7cd&amp;dn=The+Appeal+by+John+Grisham+unabridged+%5Bazoozz%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"azoozz","files":-1,"time":1266018841,"description":"In a crowded courtroom in Mississippi, a jury returns a shocking verdict against a chemical company accused of dumping toxic waste into a small town's water supply, causing the worst &quot;cancer cluster&quot; in history. The company appeals to the Mississippi Supreme Court, whose nine justices will one day either approve the verdict or reverse it.\n\nWho are the nine? How will they vote? Can one be replaced before the case is ultimately decided?\n\nThe chemical company is owned by a Wall Street predator named Carl Trudeau, and Mr. Trudeau is convinced the Court is not friendly enough. With judicial elections looming, he decides to try to purchase himself a seat on the Court. The cost is a few million dollars, a drop in the bucket for a billionaire like Mr. Trudeau. Through an intricate web of conspiracy and deceit, his political operatives recruit a young, unsuspecting candidate. They finance him, manipulate him, market him, and mold him into a potential Supreme Court justice. Their Supreme Court justice.\n\nThe Appeal is a powerful, timely, and shocking story of political and legal intrigue, a story that will leave listeners unable to think about our electoral process or judicial system in quite the same way ever again.\n\nthis book is read by Miccheal Beck\nrun time:12hrs 33min.\n\nazoozz","torrent":{"xt":"urn:btih:9f76c8007489ff91b091f48441b5919d731ed7cd","amp;dn":"The+Appeal+by+John+Grisham+unabridged+%5Bazoozz%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f76c8007489ff91b091f48441b5919d731ed7cd","infoHashBuffer":{"type":"Buffer","data":[159,118,200,0,116,137,255,145,176,145,244,132,65,181,145,157,115,30,215,205]},"announce":[],"urlList":[]}}