{"title":"Zombieland{2009.DVDrip}vice","uid":5257381,"size":423241463,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9fea1eb017c1781da05f629e239f1de5e40c3baa&amp;dn=Zombieland%7B2009.DVDrip%7Dvice&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"vicerock","files":-1,"time":1262622276,"description":"ZOMBIELAND 2009 DVDrip\n\nVIDEO CODEC Xvid\nformat Avi\nsize/res 480x272[wide screen]\nrun-time 01:27:42\nvideo bitrate 512\nvideo framerate 25\nXvid profile asp5\n\nAUDIO CODEC mp3\naudio bitrate 128\nsample rate 44100\na/v sync basic\n\nCast\n\n* Woody Harrelson as Tallahassee\n* Jesse Eisenberg as Columbus Ohio\n* Emma Stone as Wichita/Krysta\n* Abigail Breslin as Little Rock\n* Amber Heard as 406, Columbus's neighbor\n* Mike White as Gas Station Owner\n* Bill Murray makes a cameo appearance as himself\nPLOT\n\nThe film takes place within a post-apocalyptic world, beginning with narration from Columbus (Jesse Eisenberg), a college student from Austin, Texas, who is on his way to Columbus, Ohio to see if his parents are alive. He explains that his survival so far has been due to not having any friends to be attached to and not being close with his family, as well as a list of &quot;rules&quot; for surviving the zombie apocalypse (triggered by a virulent form of human adapted mad cow disease), which becomes a recurring motif in the film. Columbus also describes his fear of clowns and the need to use the bathroom frequently even though one of his rules is to avoid them. Losing his car to an accident and now walking he encounters Tallahassee (Woody Harrelson), whose life goal is to find the remaining Twinkies on Earth. To avoid attachment, Tallahassee insists that no real names be used and instead suggests each go by his home town: Columbus and Tallahassee.[3]\n\nDuring the drive, Columbus remembers the story of the day he found out zombies began to rule the world. He tells that he was sitting, playing World of Warcraft and drinking Mountain Dew until suddenly he hears his hot female neighbor from 406, shouting &quot;let me in!&quot;. He lets her in and she explains how she was walking home when she was attacked by a homeless-looking person who tried to bite her. She stays for the night, but Columbus doesn't realize she has been infected until he wakes up and she attacks him. Columbus is chased around his apartment but eventually stops her with a second hit to the head using the lid of the toilet cistern.\n\nAs Columbus and Tallahassee search a grocery store for Twinkies, they meet two sisters, Wichita (Emma Stone) and Little Rock (Abigail Breslin). Through a con, the sisters manage to steal their weapons and truck, but the men soon find a Hummer H2 truck loaded with weapons. Before they pursue of the sisters, Tallahassee has a few joy-filled moments firing off a few rounds into the air in celebration, and paints the number 3 on the car door same as his previous vehicle. The sisters ambush the men again and take the new truck after their previous stolen truck breaks down, this time taking the men as prisoners. After a subsequent standoff, Columbus convinces the group that it's better to stick together.[4]\n\nDuring the drive, Columbus states his intent to go home but Wichita blurts out that Columbus, Ohio has been burned to the ground, destroyed, and completely overrun by zombies. Columbus is visibly distraught and is presented with a chance to find his own way, but falling for Wichita, he decides to stay. They decide to drive towards Pacific Playland in Los Angeles, an amusement park that is supposedly zombie-free and girls' original intended destination. About midway there they all stop at a shop that sells Native American trinkets and other merchandise and after dispatching the zombified owner they are take some time to blow off a little steam and smash up the store. On the way to the park, they pass through Hollywood and Tallahassee makes Columbus risk his life for a map of the stars. Deciding to surprise the rest, Tallahassee drives them to a Mansion and only until they get inside they discover that it was owned by Bill Murray. While driving golf balls Tallahassee and Wichita meet a seemingly zombified Murray, who reveals that he only disguises himself with make-up so that he can walk safely among the zombies and play golf. Meanwhile in Murray's home movie theater Columbus shows Little Rock a Bill Murray classic, Ghostbusters. While the movie is playing Tallahassee and Wichita play out a scene from Ghostbusters with Tallahassee in full Ghostbusters props and clothing. Bill decides to scare Columbus and Little Rock as a practical joke, but Columbus shoots and kills him, thinking he is a zombie. After a makeshift funeral, Tallahassee reveals he lost his son Buck to the zombies (previously, Tallahassee told Columbus that he lost his puppy). Switching partners Wichita and Columbus hang out and she starts developing feelings for him. Little Rock meets up with Tallahassee and he shows her how to long range target shoot. Fearing this attachment, Wichita leaves with Little Rock for Pacific Playland, convincing themselves that they should go back to trusting only themselves. Columbus decides to go after Wichita, and he and Tallahassee pursue the sisters in one of Murray's vehicles after Columbus's failed attempt at riding a motorbike alone.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1156398/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1156398/&lt;/a&gt;\n\nPLEASE SEED AND ENJOY THANKS \n\nscreen shots &lt;a href=&quot;\nhttp://img704.imageshack.us/img704/7371/zombieland2009dvdripvic.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img704.imageshack.us/img704/7371/zombieland2009dvdripvic.jpg&lt;/a&gt;\nhttp://img63.imageshack.us/img63/6291/vlcsnap2010010223h38m27.png\nhttp://img12.imageshack.us/img12/8461/vlcsnap2010010223h38m48.png\nhttp://img690.imageshack.us/img690/9561/vlcsnap2010010223h39m03.png\t\n\n","torrent":{"xt":"urn:btih:9fea1eb017c1781da05f629e239f1de5e40c3baa","amp;dn":"Zombieland%7B2009.DVDrip%7Dvice","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9fea1eb017c1781da05f629e239f1de5e40c3baa","infoHashBuffer":{"type":"Buffer","data":[159,234,30,176,23,193,120,29,160,95,98,158,35,159,29,229,228,12,59,170]},"announce":[],"urlList":[]}}