{"title":"Vince Gill - Blue Christmas  (2nafish)","uid":5221753,"size":130785284,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:a05895695cb4b44b3afbebb6b331910771b15d04&amp;dn=Vince+Gill+-+Blue+Christmas++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1260963884,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Blue Christmas&quot; is a Christmas song written by Billy Hayes and Jay W. Johnson. The heart-broken tale of unrequited love during the holidays had long been considered a Christmas staple of country music, having been recorded by Ernest Tubb in 1948. In 1957, Elvis Presley effectively made &quot;Blue Christmas&quot; a steadfast rock-and-roll holiday classic by recording it in his signature style. The song has since been recorded by a host of rock and country artists alike, as well as those of other genres. The song was also featured in the children's Christmas special, The Year Without a Santa Claus. More recently, the song has been covered by CÃƒÂ©line Dion as well as the indie band Bright Eyes and Billy Idol in his 2006 Christmas album Happy Holidays.\n\nElvis Presley's famous recording of the song appeared on his 1957 LP Elvis' Christmas Album. It was also released as a single. Ernest Tubb's version of the song included an extra verse not used by Elvis' later version.\n\nIn 2009, Elvis' version was used in a TV commercial for Verizon Wireless.\n\nBreath of Heaven: A Christmas Collection is the second Christmas album from American country music artist Vince Gill. It was released in 1998 on MCA Nashville Records. The album was recorded with the Patrick Williams Orchestra.\n\nVincent Grant &quot;Vince&quot; Gill (born April 12, 1957) is an American neotraditional country singer-songwriter and multi-instrumentalist. He has achieved commercial success and fame both as frontman to the country rock band Pure Prairie League in the 1970s, and as a solo artist beginning in 1983, where his talents as a vocalist and musician have placed him in high demand as a guest vocalist, and a duet partner. Gill has recorded more than twenty studio albums, charted over forty singles on the U.S. Billboard charts as Hot Country Songs, and has sold more than 22 million albums. He has been honored by the Country Music Association with 18 CMA Awards, including two Entertainer of the Year awards and five Male Vocalist Awards. Gill has also earned 20 Grammy Awards, more than any other male Country music artist. In 2007, Gill was inducted into the Country Music Hall of Fame.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:a05895695cb4b44b3afbebb6b331910771b15d04","amp;dn":"Vince+Gill+-+Blue+Christmas++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a05895695cb4b44b3afbebb6b331910771b15d04","infoHashBuffer":{"type":"Buffer","data":[160,88,149,105,92,180,180,75,58,251,235,182,179,49,145,7,113,177,93,4]},"announce":[],"urlList":[]}}