{"title":"MERCURY MELTDOWN REMIX [NTSC].ISO","uid":5256511,"size":1880719360,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:a0b314eef7bbb75cbf39e68a2bd69861a90063dd&amp;dn=MERCURY+MELTDOWN+REMIX+%5BNTSC%5D.ISO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ps2forever","files":1,"time":1262566779,"description":"As in the first game, players tilt a substance known as Mercury. The aim is to guide the mercury to one or more finish posts in the level.\n\nThe main change in the game is the ability to now change the mercury into 3 more states. As well as the normal state, using a heater will turn the mercury into the 'Fast' state, a fine and easily splittable liquid. Using a cooler, the mercury will change into the 'Slow' state, a thick and hard to split semi-solid. Finally, using a solidifier will turn the mercury into a 'Solid' state, a round non-breakable ball, which can be used to traverse rails.\n\nThe mercury is still splittable (apart from the Solid state), and it is still a requirement in order to complete some levels. Splitting is normally done using a splitter (a sharp triangle shape built into walls), but it can also be done using sharp corners, or sitting underneath a standard or fast piledriver.\n\nColours still play a part in the game, and so a new colour chart is implemented in the top right corner to help with mixing colours. It can be turned off in the options menu. Mercury colours are changed by mixing two together, or using a paintshop to colour the mercury. New to Mercury Meltdown are multi-paintshops, triangle base pyramid shaped constructions with 3 different coloured gates on either side.\n\nHazards will try to knock or destroy the mercury, some of these include the Jacob's Ladder (an electrical generator, capable of zapping your mercury), pendulums, attractors and repulsors, Mercoids (creatures that eat mercury) and their relatives Jerkoids (zaps mercury with lightning like the Jacob's ladder), Spectroids (Mercoids that only eat a specific color) and Schizoids (explodes on impact with mercury).\n\nby\nwikipedia","torrent":{"xt":"urn:btih:a0b314eef7bbb75cbf39e68a2bd69861a90063dd","amp;dn":"MERCURY+MELTDOWN+REMIX+%5BNTSC%5D.ISO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0b314eef7bbb75cbf39e68a2bd69861a90063dd","infoHashBuffer":{"type":"Buffer","data":[160,179,20,238,247,187,183,92,191,57,230,138,43,214,152,97,169,0,99,221]},"announce":[],"urlList":[]}}