{"title":"Alexander [eng 5.1 - Dutch subs] [adventure-drama] [168min]","uid":5326675,"size":4509431808,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a1ef5b5eed7a912b54d8d3bdab5519d0e03c3518&amp;dn=Alexander+%5Beng+5.1+-+Dutch+subs%5D+%5Badventure-drama%5D+%5B168min%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rocking_cat","files":-1,"time":1265038877,"description":"ALEXANDER\n\n\nSound.....: AC3 5.1-ch English\n            AC3 2-ch English\nSubs......: Dutch\nRuntime...: 168 min\n\n\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0346491/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0346491/&lt;/a&gt;\n\n\n\n\nPlot:\nThe film is based on the life of Alexander the Great, King of Macedon, who conquered Asia Minor, Egypt, Persia and part of Ancient India. Shown are some of the key moments of Alexander's youth, his invasion of the mighty Persian Empire and his death. It also outlines his early life, including his difficult relationship with his father Philip II of Macedon, his strained feeling towards his mother Olympias, the unification of the Greek city-states under the League of Corinth[3], and the conquest of the Persian Empire in 331 BC. It also details his plans to reform his empire and the attempts he made to reach the end of the then known world.\n\nThe story begins in 356 BC with Ptolemy I Soter, who narrates throughout the film. We see Alexander's daily life and the strained relationship between his parents. Alexander grows up with his mother Olympias and his tutor Aristotle, where he finds interest in love, honor, music, exploration, poetry and military combat. His relationship with his father is destroyed when Philip marries Attalus's niece, Eurydice.\n\nAfter Philip is assassinated, Alexander becomes king of Macedonia and Greece. Having briefly mentioned his punitive razing of Thebes and burning of Persepolis, Ptolemy gives an overview of Alexander's west-Persian campaign, including his being declared as the son of Zeus by the Oracle of Amun at Siwa Oasis, his great battle against the Persian Emperor Darius III in the Battle of Gaugamela and his eight-year campaign across Asia.\n\nAlso shown are Alexander's private relationships with his childhood friend Hephaestion and later his wife Roxana. Hephaestion compares Alexander to Achilles, to which Alexander replies that, if he is Achilles, Hephaestion must be his Patroclus (Achilles's best friend). When Hephaestion mentions that Patroclus died first, Alexander pledges that, if Hephaestion should die first, he will follow him into the afterlife. Hephaestion shows extensive jealousy when he sees Alexander with Roxana and deep sadness when he marries her, going so far as to attempt to keep her away from him after Alexander murders Cleitus the Black in India. After Hephaestion succumbs to an unknown illness either by chance or perhaps poison, Alexander distances himself from his wife, despite her pregnancy, believing that she has killed Hephaeston.\n\nAfter conquering Babylon, Alexander admits that Hephaestion is the only person whom he loves and dies less than three months after Hephaeston, keeping his promise that he would follow him.\n","torrent":{"xt":"urn:btih:a1ef5b5eed7a912b54d8d3bdab5519d0e03c3518","amp;dn":"Alexander+%5Beng+5.1+-+Dutch+subs%5D+%5Badventure-drama%5D+%5B168min%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1ef5b5eed7a912b54d8d3bdab5519d0e03c3518","infoHashBuffer":{"type":"Buffer","data":[161,239,91,94,237,122,145,43,84,216,211,189,171,85,25,208,224,60,53,24]},"announce":[],"urlList":[]}}