{"title":"TibetanLounge - The Tibetan Book of Living and Dying -Full Movie","uid":5418901,"size":2580087677,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a1f481d04ab08c5ba3958fb62d6ac03062ae5f60&amp;dn=TibetanLounge+-+The+Tibetan+Book+of+Living+and+Dying+-Full+Movie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"HanuMan1.0","files":1,"time":1268024515,"description":"AudioBook Mixed With ChillOut Beats From The Ayurveda Buddha Lounge Collection.\n\nMixed By HanuMan -You Tube: iamhanuman Facebook: Hanu Man\n\nSogyal Rinpoche's acclaimed spiritual classic is widely regarded as one of the most complete and authoritative presentations of the Tibetan Buddhist teachings ever written.\nA manual for life and death and a source of inspiration from the heart of the Tibetan tradition, The Tibetan Book of Living and Dying provides a lucid and inspiring introduction to the practice of meditation, to the nature of mind, to karma and rebirth, to compassionate love and care for the dying, and to the trials and rewards of the spiritual path.\nMore than two million copies have been printed in 30 languages and 56 countries. It has been adopted by colleges, groups and institutions, both medical and religious, and is used extensively by nurses, doctors and healthcare professionals.\nWhat is it I hope for from this book? To inspire a quiet revolution in the whole way we look at death and care for the dying and the whole way we look at life, and care for the living. -Sogyal Rinpoche.","torrent":{"xt":"urn:btih:a1f481d04ab08c5ba3958fb62d6ac03062ae5f60","amp;dn":"TibetanLounge+-+The+Tibetan+Book+of+Living+and+Dying+-Full+Movie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1f481d04ab08c5ba3958fb62d6ac03062ae5f60","infoHashBuffer":{"type":"Buffer","data":[161,244,129,208,74,176,140,91,163,149,143,182,45,106,192,48,98,174,95,96]},"announce":[],"urlList":[]}}