{"title":"The Age Curve: How to Profit from the Coming Demographic Storm","uid":5331743,"size":276519002,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a261c2fe4ddb4427ddb62dc321c14e3ab867ec44&amp;dn=The+Age+Curve%3A+How+to+Profit+from+the+Coming+Demographic+Storm&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"standardsnut","files":-1,"time":1265197089,"description":"Unabridged, MP3, 96kbps\n\nBook:\n\nFor years, marketers have held on to unwavering beliefs that have dictated how they market to their consumers. But the hard truth is that the changes we see in marketing and business are based on one undeniable factor--the size of the generations we are selling to. As each generation ages, what they buy and how much they buy will change. Each product and service has a &quot;best customer&quot; that sustains a business. As these customers grow up, the smartest marketers will stay ahead of them--and their money.\n\nIn The Age Curve, marketing guru Kenneth Gronbach shows executives and entrepreneurs how to anticipate this wave of predictable demand and ride it to success. Using impeccable research, Gronbach reveals how our largest generations, the Baby Boomers and Generation Y, are redefining how we market and how businesses can anticipate their needs more effectively. Complete with entertaining examples of companies like Apple who have perfected their strategies for building a loyal customer base, as well as those who haven't (Levi Strauss and Honda Motorcycle), this book will show readers: how to determine their best customers * how successful companies are earning the loyalty of Generation Y and cultivating allegiance to their products for years to come * why Generation X is a much less valuable market than any of us have been led to believe * and much more Both shocking and compelling, The Age Curve will change the way companies look at their customers and how they market to them.","torrent":{"xt":"urn:btih:a261c2fe4ddb4427ddb62dc321c14e3ab867ec44","amp;dn":"The+Age+Curve%3A+How+to+Profit+from+the+Coming+Demographic+Storm","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a261c2fe4ddb4427ddb62dc321c14e3ab867ec44","infoHashBuffer":{"type":"Buffer","data":[162,97,194,254,77,219,68,39,221,182,45,195,33,193,78,58,184,103,236,68]},"announce":[],"urlList":[]}}