{"title":"Chasing Rickshaws [EN] /// bicycle bicicleta bicitaxi","uid":5456235,"size":82094860,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a2efcba696999da8921a149c227a75af58dc71b7&amp;dn=Chasing+Rickshaws+%5BEN%5D+%2F%2F%2F+bicycle+bicicleta+bicitaxi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"danDDv77","files":-1,"time":1269338316,"description":"''Chasing Rickshaws'', oct. 1998\nText by Tony Wheeler\nPhotographs by  Richard I'Anson\nEditor : Lonely Planet Publications Pty Ltd, Australia\nPrinted in China\n\nOriginal book:  27,7 * 24,7 cm, 190 pags.. Price USA $34.95\npdf escaned at 1534 x 1299 px.\n\n\n''Born in Japan as the 'man-powered vehicle' or jinrikisha, the rickshaw later metamorphosed into the cycle-rickshaw. Whether itÃ‚Â´s called a trishaw, sidecar, pedicar, cyclo or becak, itÃ‚Â´s the true Asian taxicab.\nInveterate Asia travelers Tony Wheeler and Richard IÃ‚Â´Anson chased rickshaws through 12 Asian cities. The riders they encountered ranged from old men in Penang to teenage, would be jeepney drivers in Manila. In Singapure trishaws are fading as day-to-day transport but simultaneously being reborn as tourist attractions. In Hong Kong theyÃ‚Â´re both city icon and endangered species.\nIn text and photographs the book visits rickshaw pullersÃ‚Â´dormitories in Calcutta, tracks down the artists who paint the dramatically colorful rickshaws of Dhaka, locates the scrapyard where confiscated rickshaws await their fate in Hanoi and rides with the city official who supervises riding tests in Penang. The ultimate rickshaw rarily, women riders, were found only in Beijing and Manila, but in many cities school children pile into rickshaws to ride to and from school each day.\nIn some cities rickshaws are standard bicycles with attached sidecars, while in others the rider is out front and the passengers sit behind, as if the front part of a bicycle had been fused with an old man-pulled rickshaw. In Hanoi, Penang and Yogyakarta the meeting of bike and rickshaw has produced precisely the opposite result: the riders pedals from behind and the passengers sit fearfully aut front.\nRickshaws, their riders and their customers haver been studied by engineers, evaluated by transport economists and analyzed by sociologist. TheyÃ‚Â´re celebrated in this book.''\n","torrent":{"xt":"urn:btih:a2efcba696999da8921a149c227a75af58dc71b7","amp;dn":"Chasing+Rickshaws+%5BEN%5D+%2F%2F%2F+bicycle+bicicleta+bicitaxi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2efcba696999da8921a149c227a75af58dc71b7","infoHashBuffer":{"type":"Buffer","data":[162,239,203,166,150,153,157,168,146,26,20,156,34,122,117,175,88,220,113,183]},"announce":[],"urlList":[]}}