{"title":"The Luck of Ginger Coffey (1964)","uid":5200854,"size":735065208,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a36bc823be2f2d1b829d9eb8752fd489be9d9adf&amp;dn=The+Luck+of+Ginger+Coffey+%281964%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"The_Rowdy_Man","files":1,"time":1260153144,"description":"Beautiful Dangerous Vision of a Canadian Immigrant's Dream, 20 December 2003\nAuthor: Roxanne Tellier from Toronto, ON Canada\n\nWhen this film first appeared in 1964 I was a child of 11, newly arrived in Montreal myself from the (then) small city of Edmonton Alberta. Montreal was the 'big cosmopolitan city' , where men were men, and women were goddesses. And so they were. Even I, a small gorfy kid, got my first wolf whistle on those very streets before I was 13.\n\nI wanted to see this vision of that time, even if in black and white, because my Montreal included only b&amp;w TV at that time, even though Montreal was a collage of colors, snow &amp; more snow. And this film IS my Montreal, complete with bilingual signs, belching buses and the beginnings of the English/French conflict that would eventually send me fleeing to English Toronto.\n\nWithin my own family, there were Irish, English, Polish immigrants and more - my father was French Albertan, my mother Quebec English - truly Canadian, we epitomized the Silent Revolution. Clinging to my Irish/English background, I understood the prejudices immigrants knew.\n\nRobert Shaw is brilliant as Ginger. He is the quintessential immigrant convinced that life in Canada will be the bright future he deserves. His wife, Vera (Mary Ure) is the terrified woman who has followed her husband's dream, but longs for home. His daughter Paulie is me - scared and defiant in a new world.\n\nGinger can't find a good job' he's hampered by the lack of a proper college degree since he ran away to War instead of finishing school. He also believes that his age and experience qualify him beyond a training position, as he feels he's quite capable of positions above his actual education and experience. He may be right, but his employers disagree. In the one instance where his natural instincts and intelligence unite to shove him above the average, he's too particular to even see that he's found his own niche.\n\nThe story of one man's struggle in the New World is not unique; Brian Moore's belief in the essential optimism of the Irish character lifts this small tragedy to a greater good. Despite the apparent spiral into despair and alcoholism, the ending suggests that there is hope, that Ginger and Vera will persevere, and that Ginger's inherent belief that &quot;Life is in the Living&quot; will pull all of them through this struggle to a future that may not be of their dreams, but will be sufficient to take them to a better world than they could have hoped for in Dublin.\n\nGinger Coffey's story is not a tragedy, it is a monument to the people who came to Canada and the US to raise the bar for those lucky enough to be born in these countries. It's a lesson for all of us who take our birthright for granted, who will never understand what it's like to be a &quot;Stranger in a New Land&quot;.\n\nIf you are lucky enough to see this film, most likely on television, take a moment to remember the time, and the circumstances, before political correctness allowed every Canadian and American, born or newcomer, to a piece of the pie we call the North American Dream. \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0058305/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0058305/&lt;/a&gt;","torrent":{"xt":"urn:btih:a36bc823be2f2d1b829d9eb8752fd489be9d9adf","amp;dn":"The+Luck+of+Ginger+Coffey+%281964%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a36bc823be2f2d1b829d9eb8752fd489be9d9adf","infoHashBuffer":{"type":"Buffer","data":[163,107,200,35,190,47,45,27,130,157,158,184,117,47,212,137,190,157,154,223]},"announce":[],"urlList":[]}}