{"title":"The World Of Ray [BangaliAddarThek]","uid":5369946,"size":663892328,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:a3a94697513f4bd0d40b8205412176d6f1964f8c&amp;dn=The+World+Of+Ray+%5BBangaliAddarThek%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"wc90","files":3,"time":1266394504,"description":"World of Satyajit Ray\n\n[img]http://img245.imageshack.us/img245/6362/packweb11.jpg[/img]\n\nAbout the CD \n\n\nThis interactive CD-ROM is a maiden endeavor on digital media on the life and works of Satyajit Ray, one of the greatest names in world cinema.\n\nLaunched on his 78th birth anniversary, May 2, 1999, it is a tribute to the great filmmaker from the house of RDB, for countless aficionados settled all over the globe, to enable them to rediscover and preserve a slice of his life and the magic of his creations in non-linear navigation.  \n\nIt is not a critique or analysis  of his works in various media, which falls under the esoteric purview of scholars and theoreticians. Nevertheless, it can definitely serve  as an authentic and ready source of information on Ray and also be of use to all those who wish to study a man of his magnificence. The piece-de-resistance of this offering is that it is a posthumous  tribute to an individual  who helped in lifting only a century old  invention into one of  the greatest contemporary art forms of our times. \n\nThe technical support for the CD ROM has been provided by The Multimedia Group of the Technology Centre of PricewaterhouseCoopers, India.  \n\nThe advisory panel consisted of eminent directors of the likes of  Sandip Ray, Gautam Ghose  and Shyam Benegal.\n\nLord Richard Attenborough   provided the introduction and narration for the CD ROM.\n\n[img]http://img245.imageshack.us/img245/305/opener.jpg[/img]\n\nContent \n\nThe content of the CD ROM is arranged in following major sections and subsections.  \n\nIntimate Portrait   \nBiographical Sketch \nFamily Tree\n\nCinematic Gaze   \nLittle Road to Big Success \nRay's World of Cinema\nUnmade Films\n\nOther Facets   \nRay - the Music Composer \nRay - the Artist\nRay - the Writer\n\nRay on Ray   \nWhy I make films? \nMy Life, my Works\nAn Exclusive Interview\n\nDossier   \nAwards \nFimography\nDiscography\nBibliography \nReviews ... etc.\n\nImage Gallery   \nDifferent Moods  \nAt Shooting \nAt Work\nSpecial Moments\n\n\n[img]http://img269.imageshack.us/img269/8476/25142531.jpg[/img]\n\nINTIMATE PORTRAIT\n\nAn introductory section and biographical sketch of Ray's bloodline and his early background right from his very childhood to his academic years in Calcutta, his days at Shantiniketan, his getting a job in a British advertising firm, his work as a graphic artist, his passion for watching and understanding cinema. \n\n\n[img]http://img10.imageshack.us/img10/1551/73118197.jpg[/img]\n\nCINEMATIC GAZE\n\nThis section focuses exclusively on Ray's films and is subdivided into three broad categories:  \nLittle road to big success: A behind-the-scenes account on how Ray made his first film, Pather Panchali (SONG OF THE LITTLE ROAD).\nRay's world of cinema : A comprehensive and chronological list of all the thirty-six films made by Ray with credit titles, the story synopsis and images from the movie, complete with over 45 minutes of video footage.\nUnmade films: This section outlines the films he planned to make, but finally never got made. It also includes a short movie on Ravi Shankar which was made from the visual script illustrated by Ray for the film.\n\n\n[img]http://img10.imageshack.us/img10/2329/96183076.jpg[/img]\n\nOther Facets\n\nThis section highlights on the other shades of Ray's genius and are subdivided into three major segments:  \nRay the - music composer: This section shows on how Ray became inclined to Western Classical music right from his very childhood, his diverse influences to his taking up the baton to compose music for his own films. A special movie montage created from Ray's own compositions is an added feature.\nRay the artist: This section showcases Ray as an artist, be it doing layouts for ads, cover designs and illustrations for his books and also books by others, creating logos and making caricatures, designing the posters, for his films etc.\nRay the writer: This section exhibits his prowess as a bestselling author of fiction, detective stories, whodunits to sci-fi and fantasy with memorable characters like Feluda and Professor Shanku. It also covers his books on cinema, scripts and nonsense rhymes.\n\n\n[img]http://img26.imageshack.us/img26/7155/92608229.jpg[/img]\n\nRay On Ray\n\nAn exclusive section of comments by the master himself which is bracketed into three parts:  \nWhy I make films?\nMy life, my works \nAn exclusive interview (video)\n\n\n[img]http://img26.imageshack.us/img26/3971/63209059.jpg[/img]\n\nDOSSIER\n\nThe concluding section of the CD-ROM which includes detailed information and appendices \nof works by him and on him. \nReviews : Reviews on Ray's films from reputed film journals, newspaper and books.\nAwards : Complete list of awards and recognitions received by Ray.\nFilmography : Complete film list.\nBibliography : Bibliography of Ray\nDiscography : Complete list of Discs, CDs and Cassettes on Ray's films or music composed\nRay's Contributions in Others' Films : List of films for which Ray has written the script or composed music\nQuote Unquote : Comments on Ray from celebrities.\n\n\n[img]http://img181.imageshack.us/img181/7663/66285356.jpg[/img]\nIMAGE GALLERY\nA portal into a huge gallery of images and photographs of Ray which is divided into four main sections: \n*Different Moods\n*At Shooting \n*At Work\n*Special Moments\n\nThere is also a self running option, where you can start viewing the gallery from the very first image and finish with the last one.\n\nSome Reviews    \nExcellent production quality. Comprehensive research and authoritative information. Very obviously put together with deep understand ingand even love, the title is one for the collector's shelf.   \n\n- Computers@Home\n\nIt sets out to be a ready audio-visual reference, and should inevitably become a collector's item.  \n- The Statesman\n\nFilm aficionados can have a look at 40 sketches of different poses of the legendary sitarist (Ravi Shankar) drawn by Ray giving some idea as to how the film could have materialized.  A virtual treat for the die-hard Satyajit Ray fanatic.\n- The Economic Times\n\nTechnically, the CD is quite ambitious. I certainly enjoyed browsing it.  \nAndrew Robinson (Film Critic &amp; writer - London)\n\nIt is eloquent, moving and most impressive.  \nProf. Dilip Basu (Ray film &amp; Study Collection. Univ. of California)\n\nSYSTEM REQUIREMENTS   \n\nFor Windows \n===========\nMultimedia PC with a Pentium processor, 800X600 True/High-color display, 32 MB or higher RAM, CD-ROM drive, 16 bit audio board, speakers \n\nRecommended: Anything higher than the above mentioned configuration except the resolution. \n\nMicrosoft Windows 95 or higher \nQuick Time \n\nFor Macintosh \n=============\n\nApple Macintosh with PowerPC or G3 Processor, 800X600 True/High-color display, 32 MB or higher RAM  \nCD ROM Drive, 16 bit audio board, speakers \n\nRecommended: Anything higher than the above mentioned configuration except the resolution. \n\nApple System 7.1 or higher \nQuick Time\n\nRead before you download (Or Uploader's Note): This torrent contains an .ISO image of the CD 'World of Ray' and a read me file from which you can find all the technical information about installation, sys req and troubleshooting. To mount the .ISO image use either Nero or virtually mount the image using daemon tool lite (free ware).Also needs quicktime player installed to watch the interviews of Ray. So there is a folder contains quicktime installer in the CD. \n\nThank You.","torrent":{"xt":"urn:btih:a3a94697513f4bd0d40b8205412176d6f1964f8c","amp;dn":"The+World+Of+Ray+%5BBangaliAddarThek%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a3a94697513f4bd0d40b8205412176d6f1964f8c","infoHashBuffer":{"type":"Buffer","data":[163,169,70,151,81,63,75,208,212,11,130,5,65,33,118,214,241,150,79,140]},"announce":[],"urlList":[]}}