{"title":"The Golden Compass Dutch DVDRip - SuperChasin","uid":5453759,"size":6790303744,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:a3b9e2cd315811019e4be0ad6560f404f279ac49&amp;dn=The+Golden+Compass+Dutch+DVDRip+-+SuperChasin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"SuperChasin","files":-1,"time":1269265719,"description":"New Line Cinema's\nThe Golden Compass (c) 2007\n\nAudio: English/Nederlands/Vlaams Dolby Digital 5.1\nSubtitles: Nederlands optioneel aan/uit\nGenre: Avontuur\nSpeelduur: ca. 109 minuten\nFormaat: DVDR \n\nHierbij de volledige video The Golden Compass een DVDRip!\n\nBeschrijving:\n\n'The Golden Compass', een van de grootste en duurste films aller tijden, is gebaseerd op de bekroonde Britse trilogie His Dark Materials van Philip Pullman. In het eerste deel ontdekken we een wereld die veel op de onze lijkt, maar toch bijzondere verschillen kent. Zo kun je het innerlijk van mensen zien in de vorm van een 'daemon', een dier dat altijd bij je is. De 12-jarige Lyra (Dakota Blue Richards) is een avontuurlijk weesmeisje dat op de beroemde universiteit van Oxford woont. Haar daemon heet Pan en kan verschillende vormen aannemen. Op een dag krijgt Lyra van een oude leraar een 'Alethiometer'. Dit gouden kompas geeft antwoord op al je vragen - als je tenminste weet hoe je het af moet lezen. Lyra ontdekt dat ze een van de weinigen is die dat kan. Ze mag alleen aan niemand vertellen dat ze het instrument bezit - zelfs niet aan haar stoere beschermer, de wetenschapper Lord Asriel (Daniel Craig). Geen probleem, want Asriel heeft toch meer interesse in zijn onderzoek naar.. stof. Lyra wordt wel op de huid gezeten door Marisa Coulter (Nicole Kidman), die zowel voor de universiteit als voor de Kerk werkt en duistere plannen met Lyra heeft. Als Lyra's goede vriend Roger verdwijnt, komt het instrument haar erg goed van pas. Het geeft aan dat ze Lord Asriel achterna moet, die voor zijn onderzoek naar het koude Noorden is afgereisd. Tijdens haar zoektocht sluit Lyra vriendschap met een bijzondere bondgenoot, de gepantserde ijsbeer Iorek. Het woeste dier laat haar kennismaken met de bizarre wereld van het Noorden, waar ze ook de vliegende ijskoningin Serafina (Eva Green) ontmoet, net voordat een ongekende strijd tussen goed en kwaad losbarst. The Golden Compass neemt je mee naar een adembenemende wereld waar de meest verbazende creaties een fantastisch verhaal over ultieme moed en menselijkheid vertellen.\n\n-----------------------------------------------------------------------------------\n\nUitleg: \n\nAls je deze download binnen hebt, krijg je een VIDEO_TS map en een AUDIO_TS map. \n\nBrand deze met NERO eXpress, of gebruik PowerISO om de mappen in een .iso te plaatsen en dan te downloaden.\n\nPowerISO: http://thepiratebay.se/torrent/5242747/PowerISO_4.6_and_Serial_key\nNERO eXpress: http://thepiratebay.se/torrent/4890351/Nero_Express_OEM_6.6_Burning-ROM.....[26_language_interface]\n\n-----------------------------------------------------------------------------------\n\nVeel plezier!!\nEn SEED!\n\n","torrent":{"xt":"urn:btih:a3b9e2cd315811019e4be0ad6560f404f279ac49","amp;dn":"The+Golden+Compass+Dutch+DVDRip+-+SuperChasin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a3b9e2cd315811019e4be0ad6560f404f279ac49","infoHashBuffer":{"type":"Buffer","data":[163,185,226,205,49,88,17,1,158,75,224,173,101,96,244,4,242,121,172,73]},"announce":[],"urlList":[]}}