{"title":"J. Geils Band - Come Back   (2nafish)","uid":5258936,"size":128028676,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:a443444ebf3d16f792ede395ac44807c1f1df9ff&amp;dn=J.+Geils+Band+-+Come+Back+++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1262673262,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThe J. Geils Band (pronounced &quot;Guiles&quot;) is an American rock band formed in 1967 in Worcester, Massachusetts best known for their 1981 single, &quot;Centerfold&quot; which charted #1 in the U.S. in early 1982. The band played R&amp;B-influenced blues-rock in the 1970s before moving towards a more pop-influenced sound in the 1980s. Since their initial break-up in 1983, the band has reunited several times.\n\nLove Stinks is the eleventh album by American rock band The J. Geils Band, released in 1980.\n\nThe title song is a rant against unrequited love. It has been covered by industrial metal band Bile, Joan Jett in the movie Mr. Wrong, and Adam Sandler in the movie The Wedding Singer. The song Love Stinks was also featured in the film Opie Gets Laid. As of late July 2009, the title song is heard in a series of Swiffer commercials.\n\nThe band started as an acoustic blues trio in the mid 1960s, with singer and guitarist John Geils, bassist Danny Klein (Dr. Funk) and harmonica player Richard Salwitz (stage name Magic Dick).\n\nThe band formed under the name 'Snoopy and the Sopwith Camels', while Geils was attending Worcester Polytechnic Institute for a couple of semesters. In 1967, the band switched focus, starting to play electric guitar and bass and recruiting drummer Stephen Jo Bladd and fast-talking ex-disc jockey singer Peter Wolf, born Peter Blankenfeld, both from Boston. They became the J. Geils Blues Band, later dropping the word, &quot;Blues&quot; from the band name. The following year, former fan Seth Justman joined as an organist. The group signed to Atlantic Records in 1970.\n\nAlthough living in Boston, the band had always considered Detroit their second home because of their enormous popularity there. Two of their three live albums were recorded in Detroit at various venues. The third live album was recorded in Detroit and Boston.\n\nThe J. Geils Band first received FM radio airplay with the live single &quot;First I Look at the Purse&quot;. They then began to get AM radio airplay as well with a series of several hit singles in the 1970s, the most successful of which were &quot;Looking for a Love&quot; (1971), &quot;Give it to Me&quot; (1973), a cover version of The Showstoppers' &quot;Ain't Nothin' But a Houseparty&quot; (1973) and &quot;Must of Got Lost&quot; (1974). Later in the 1970s, the band signed with EMI America Records.\n\nThe band attracted special attention for its innovative use of the harmonica as a lead instrument. Magic Dick is still regarded by many as one of the best lead harmonica players in rock and roll history.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:a443444ebf3d16f792ede395ac44807c1f1df9ff","amp;dn":"J.+Geils+Band+-+Come+Back+++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a443444ebf3d16f792ede395ac44807c1f1df9ff","infoHashBuffer":{"type":"Buffer","data":[164,67,68,78,191,61,22,247,146,237,227,149,172,68,128,124,31,29,249,255]},"announce":[],"urlList":[]}}