{"title":"Web Dumper 3.1.1 Incl.Keygen","uid":5323475,"size":2620443,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a459f68bf7f9e3377222f1a48556247f65cf74ac&amp;dn=Web+Dumper+3.1.1+Incl.Keygen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"piroman1","files":3,"time":1264946703,"description":"Download entire Web sites off of the Internet, and save them on your hard drive...\n\n If you are viewing a Web site with your browser and you decide that you would like to make a\n copy of it on your hard drive, you have to manually save each page as you view it along with\n embedded pictures, sounds and so on. This can be a very long and tedious process, and in many\n cases it's more trouble than it's worth. It doesn't have to be that way, however, as Web Dumper\n makes this whole process very fast and easy.\n\n With Web Dumper you can download entire Websites off of the Internet, and save them on your hard\n drive for later offline browsing. Downloaded Web sites are saved on your hard drive with their\n directory structure intact. Web Dumper automatically downloads HTML documents along with their\n embedded pictures, sounds, movies and so on while it screens them to look for any enclosed links\n to other documents.\n\n Web Dumper lets you select which kinds of file you want to be dumped between more than 60\n available standard types, the folder depth level, how links must be processed and if it must\n re-link your HTML documents for offline browsing.","torrent":{"xt":"urn:btih:a459f68bf7f9e3377222f1a48556247f65cf74ac","amp;dn":"Web+Dumper+3.1.1+Incl.Keygen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a459f68bf7f9e3377222f1a48556247f65cf74ac","infoHashBuffer":{"type":"Buffer","data":[164,89,246,139,247,249,227,55,114,34,241,164,133,86,36,127,101,207,116,172]},"announce":[],"urlList":[]}}