{"title":"Friday The 13th Part V The Killer Is Jason Fan-Edit","uid":5400669,"size":4413005824,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:a52006ad654f4953b687533b3c18e600120bbdad&amp;dn=Friday+The+13th+Part+V+The+Killer+Is+Jason+Fan-Edit&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"movieking67","files":11,"time":1267407224,"description":"If Jason still haunts you, you're not alone!\n\n\nA New Beginning to the first step in terror\n\n\n\n\nThe mindless, murderous fury that was buried with Jason has been reborn. And suddenly, terror has become child's play!\n\n\n\n\n\n\nThe murderous spirit of Jason Vorhees lives on in this horror sequel, although the plot hinges on the mystery of whether the killer's body actually survives. Opening with a nightmare prologue in which Corey Feldman reprises his role as Tommy Jarvis, the boy who killed Jason in the previous installment, the film jumps forward several years to when a teenaged Tommy (John Shepherd), haunted by visions of Jason returning to life, moves into a group home for mentally disturbed kids. Almost as soon as he arrives, Tommy witnesses the death of Joey (Dominick Brascia), an overweight, annoying boy who is hacked to death by psychopathic patient Vic (Mark Venturini). Although Vic ends up safely behind bars, other bodies begin to turn up -- more than 20 by the end of the film. Tommy's own violent streak, displayed when he lashes out at a fellow resident, makes him a suspect; he even doubts his own sanity. But as the bloodshed continues, Tommy finds himself allied with Reggie (Shavar Ross), the grandson of one of the home's employees, in a desperate bid to survive the carnage and find out who the killer behind the hockey mask really is.\n\n\n\n'Friday the 13th Part V - The Killer Is Jason Edition'\n\n---------------------------------------------------------------\n\naka \n\n'Friday the 13th Part V - A New Beginning \n\n(The Terminally Traumatised Tommy Edition)'\n\n-------------------------------------------------------\n\n \n\n- The theatrical trailers for the first five films play out in quick succession as &quot;coming attractions&quot; before the film proper actually begins. \n\n \n\n- The gravediggers have been cut from the picture.\n\n \n\n- The character of Roy the paramedic has been virtually cut from the picture save a brief appearance as an un-named, unimportant background character.\n\n \n\n- Tommy has more hallucinations and nightmares.\n\n \n\n- Jason himself is the killer.\n\n \n\n-Many deaths and dramatic confrontations have been tightened for greater emotional impact and enhanced for more modern cinematic sensibilities\n\n \n\n- Most of the campy dialogue has been trimmed to better facilitate a more serious tone and overall darker feel to the picture\n\n \n\n- Virtually all camera shots in inwhich the killer's right eye is visible have been deleted, to better maintain continuity with Jason's previously sustained cranial damage as depicted in the fourth film\n\n \n\n- many more twists, turns and surprises lie in store.\n","torrent":{"xt":"urn:btih:a52006ad654f4953b687533b3c18e600120bbdad","amp;dn":"Friday+The+13th+Part+V+The+Killer+Is+Jason+Fan-Edit","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a52006ad654f4953b687533b3c18e600120bbdad","infoHashBuffer":{"type":"Buffer","data":[165,32,6,173,101,79,73,83,182,135,83,59,60,24,230,0,18,11,189,173]},"announce":[],"urlList":[]}}