{"title":"Halestorm - It's Not You  (2nafish)","uid":5271179,"size":106739716,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:a536012970dbb04a158fb5072e912ac26190df78&amp;dn=Halestorm+-+It%5C%27s+Not+You++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1263193158,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nHalestorm is an American hard rock band from York, Pennsylvania. The group is currently signed with Atlantic Records and released their self-titled, major label debut album in April 2009.\n\nHalestorm has been actively writing and performing original music since 1997, when Arejay and Lzzy (who are brother and sister) were 10 and 13 years old, respectively. In its earliest incarnation, Lzzy and Arejay's father played bass with them before Josh Smith joined the group. They have achieved international airplay, having been featured on the Lord Litter show in Germany. Halestorm was the featured artist on the cover of Origivation Magazine in October 2006 and appeared on the cover of Pennsylvania Musician magazine three times (August 1999, March 2000, and February 2003).\n\nThe group signed a recording contract with Atlantic Records on June 28, 2005. They toured across the United States from January to March 2006 on the Winterfresh Sno-Core Tour with Seether, Shinedown, and Flyleaf. After that tour the band returned to the road through mid-July 2006 on the Equinox Tour with Shinedown, Trapt, Evans Blue, and Mercy Fall. Lzzy Hale also lent her vocals to a reworked version of the Shinedown song &quot;Shed Some Light&quot; from the album Us and Them, although this version was never officially released and only saw sparse play on a few radio stations based in the band's home state of Pennsylvania.\n\nOn September 5, 2007, Halestorm appeared on The Tonight Show with Jay Leno as part of the Jaywalking segment.\n\nIn 2009 Halestorm toured with Chevelle, Adelitas Way, and Shinedown.\n\nTheir debut album was released on April 28, 2009. James Michael co-wrote a song on it called &quot;What Were You Expecting.&quot; The song &quot;I Get Off&quot; serves as the album's lead single and has gained heavy radio play. Their newest single is &quot;It's Not You&quot; and the music video for the song was released in late November of 2009.\n\nLzzy also appeared on the cover of Revolver Magazine along with Grace Perry from Landmine Marathon on their December edition of the Hottest Chicks in Metal.\n\nHalestorm is the debut album from the hard rock band Halestorm. Howard Benson, who has also worked with Daughtry, My Chemical Romance, and Flyleaf, produced the album. It peaked at #40 on the Billboard 200. The first single off of the album, &quot;I Get Off&quot; has gotten considerable play time. The song reached #17 on Billboard's Rock list.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:a536012970dbb04a158fb5072e912ac26190df78","amp;dn":"Halestorm+-+It%5C%27s+Not+You++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a536012970dbb04a158fb5072e912ac26190df78","infoHashBuffer":{"type":"Buffer","data":[165,54,1,41,112,219,176,74,21,143,181,7,46,145,42,194,97,144,223,120]},"announce":[],"urlList":[]}}