{"title":"This Is Vol.2 Right Disc(2009)-Sander Kleinenberg","uid":5305713,"size":578148375,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a53c16095db7ed1d714f2bf655988ccf9e7affd5&amp;dn=This+Is+Vol.2+Right+Disc%282009%29-Sander+Kleinenberg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"CTACyan","files":-1,"time":1264377780,"description":"A DJ whose sets range from sparse and dark trance to uplifting and deep house, Sander Kleinenberg keeps busy hopping around the globe to spin at high-profile clubs and producing tracks that end up on numerous compilations. Born and raised in The Hague, Holland, Kleinenberg's early influences were the American beats of Mantronix, remixer Shep Pettibone, and Jellybean Benitez coupled with the pop sounds of Depeche Mode. A humble beginning to his DJ career came at the age of 15 when he spun whatever the crowd wanted to hear at a bar around the corner from his home. It was enough to get him interested in producing his own music. 1996 saw the release of &quot;Y.D.W. (You Do Me Wrong),&quot; one of the few European tunes on the American house label Strictly Rhythm and released under his S'n'S moniker. Junior Vasquez, Deep Dish, and Danny Tenaglia were early supporters, and a relationship with the Combined record label yielded numerous 12&quot;s. A solid fan base was formed with fans seeking out all the editions of his 4 Seasons EP, but it was the success of 2000's My Lexicon 12&quot; that pushed him into the spotlight. His Tranceglobal Airways mix CD was included with the October 2000 issue of Muzik magazine, and his productions turned up a number of compilations in the ultrapopular Global Underground series. 2001 found him successfully remixing RÃƒÂ¶yksopp's &quot;Poor Leno&quot; and winning the Best Radio 1 Essential Mix award from Muzik. 2002 saw his Essential Mix CD released, followed by his turn in the Global Underground: NuBreed series and another mix for Thrive, Renaissance Presents Everybody, a year later.","torrent":{"xt":"urn:btih:a53c16095db7ed1d714f2bf655988ccf9e7affd5","amp;dn":"This+Is+Vol.2+Right+Disc%282009%29-Sander+Kleinenberg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a53c16095db7ed1d714f2bf655988ccf9e7affd5","infoHashBuffer":{"type":"Buffer","data":[165,60,22,9,93,183,237,29,113,79,43,246,85,152,140,207,158,122,255,213]},"announce":[],"urlList":[]}}