{"title":"Un.Uomo.Qualunque.2009.iTALiAN.DVDRip.XviD-Reserved.avi","uid":5232619,"size":733796352,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a55134e697642320899f1e9ed6848da529bd2ac9&amp;dn=Un.Uomo.Qualunque.2009.iTALiAN.DVDRip.XviD-Reserved.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"AvalonMe","files":1,"time":1261354579,"description":"Un film di Frank Cappello. Con Christian Slater, Elisha Cuthbert, William H. Macy, Sascha Knopf, Jamison Jones. \nCristina Lawson\nTitolo originale He Was a Quiet Man. Commedia, durata 95 min. - USA 2007\n\nLa storia dell'impiegato Bob Maconel, ÃƒÂ¨ un cammino nel grigiore totale della mediocritÃƒÂ . L'unica soluzione ÃƒÂ¨ un atto unico, imprescindibile, definitivo. Sia esso compiuto o subito. E quando la situazione varia, Bob non sa come gestirla, ci prova, a volte ci riesce, a volte no, perchÃƒÂ¨ la natura di un uomo ÃƒÂ¨ impossibile da cambiare. \nLa claustrofobia ÃƒÂ¨ palpabile. Il dramma di una vita, percepibile. E poi la solitudine, la routine dannata e amata. I sentimenti nell'esistenza di un uomo piccolo piccolo, compaiono, e sono distruttivi, non lasciano speranza. Cambiano le regole e modificano l'equilibrio giÃƒÂ  precario.\nIl film di Frank Cappello ÃƒÂ¨ un ritratto intimo di un uomo, Bob (Christian Slater), che non ÃƒÂ¨ depresso, ma ÃƒÂ¨ chiuso nella sua dimensione limitata priva di uscite, che fa quello che deve fare, che viene trattato come l'ultimo della scala gerarchica, e che si consola con una bambolina che fa l'Hula Hoop appoggiata sul suo separÃƒÂ¨. Cappello perÃƒÂ² non si limita a descrivere, ma entra nel personaggio, lo riprende da vicino distorcendone le fattezze del volto per esagerarne il modo di essere e di apparire. \nQuando accade il dramma, poi, il percorso di Bob ÃƒÂ¨ quello di un pesce fuor d'acqua (a differenza di quello che ha nell'acquario) che prima sembra uscire dalla propria condizione per poi ricadere nel baratro. Christian Slater non solito a performance impegnate, abbandona i ruoli di 'eterno giovane' e si mette in gioco con una parte difficile, al limite, dando prova delle sue capacitÃƒÂ  attoriali. L'insieme degli elementi che costituiscono Un uomo qualunque si allontanano dalla classica fotografia dell'ufficio e degli impiegati, per concentrarsi su un uomo che ÃƒÂ¨ una bomba a orologeria. Tutto ÃƒÂ¨ piatto, rituale, fino a quando non subentra il sentimento che rompe gli equilibri e accende una miccia. Non ci sono mezzi termini, tutto ÃƒÂ¨ esagerato, e tutto ÃƒÂ¨ estremamente reale per condurre lo spettatore in una vita mediocre che si accende solo quando si contraddice. Senza sorrisi nÃƒÂ¨ pianti.","torrent":{"xt":"urn:btih:a55134e697642320899f1e9ed6848da529bd2ac9","amp;dn":"Un.Uomo.Qualunque.2009.iTALiAN.DVDRip.XviD-Reserved.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a55134e697642320899f1e9ed6848da529bd2ac9","infoHashBuffer":{"type":"Buffer","data":[165,81,52,230,151,100,35,32,137,159,30,158,214,132,141,165,41,189,42,201]},"announce":[],"urlList":[]}}