{"title":"Focus On Indie Film:","uid":5343550,"size":60698767,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:a67f245833b002d15e81abfaaa0191f11bab2194&amp;dn=Focus+On+Indie+Film%3A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"enki09","files":1,"time":1265560493,"description":"This episode takes a look at the film &quot;...Around&quot; by David Spaltro and features both the film trailer and an interview with the filmmaker.\n\nAbout the film: Doyle Simms grows up across the Hudson from NYC and flees his toxic family to attend a film program there. After a bumpy first year he returns more determined than ever to become a storyteller and figure out his place. Financial setbacks force Doyle to find creative &quot;rent-controlled living&quot; and begin a dual life living out of Penn Station while going to school. We follow Doyle over his college years as he begins to build relationships with several colorful characters such as Saul, a homeless book dealer who shows him the ropes and his own brand of street philosophy, and Allyson, a beautiful, struggling actress he carefully begins to pursue and fall for. Doyle begins to find a weird balance and begin to build a home, but the pressure of maintaining his worlds begins to crack the faÃƒÂ§ade and he's forced to confront his past family demons and reconcile the person he wants to be with the person he is.\n\nThe film is available on both Netflix and Amazon Video On Demand.\n\nAmazon link:\n\nFilm website: http://www.aroundthefilm.com/\n\nFocus On Indie Film main site: http://www.theindiemusicshow.blip.tv/","torrent":{"xt":"urn:btih:a67f245833b002d15e81abfaaa0191f11bab2194","amp;dn":"Focus+On+Indie+Film%3A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a67f245833b002d15e81abfaaa0191f11bab2194","infoHashBuffer":{"type":"Buffer","data":[166,127,36,88,51,176,2,209,94,129,171,250,170,1,145,241,27,171,33,148]},"announce":[],"urlList":[]}}