{"title":"Sean Carroll,From Eternity to Here - Quest for the Ultimate Theo","uid":5416529,"size":544125141,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a6872dc3f660c222cfd742d5ce3f42f1a0d68c10&amp;dn=Sean+Carroll%2CFrom+Eternity+to+Here+-+Quest+for+the+Ultimate+Theo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":5,"uploader":"p00p3don","files":-1,"time":1267943406,"description":"From Eternity to Here: The Quest for the Ultimate Theory of Time \nby Sean Carroll\n\nNarrator:\nErik Synnestvedt \nProvider:\nTantor Media \nRunning Time:\n16 h 4 min 41 sec\n \n\nTime moves forward, not backward---everyone knows you can't unscramble an egg. In the hands of one of today's hottest young physicists, that simple fact of breakfast becomes a doorway to understanding the Big Bang, the universe, and other universes, too. \n\nIn From Eternity to Here, Sean Carroll argues that the arrow of time, pointing resolutely from the past to the future, owes its existence to conditions before the Big Bang itself---a period of modern cosmology of which Einstein never dreamed. Increasingly, though, physicists are going out into realms that make the theory of relativity seem like child's play. Carroll's scenario is not only elegant, it's laid out in the same easy-to-understand language that has made his group blog, Cosmic Variance, the most popular physics blog on the Net. \n\nFrom Eternity to Here uses ideas at the cutting edge of theoretical physics to explore how properties of space-time before the Big Bang can explain the flow of time we experience in our everyday lives. Carroll suggests that we live in a baby universe, part of a large family of universes in which many of our siblings experience an arrow of time running in the opposite direction. It's an ambitious, fascinating picture of the universe on an ultra-large scale, one that will captivate fans of popular physics blockbusters like Elegant Universe and A Brief History of Time. \n\n\n\nEditorial Reviews\nFrom Publishers Weekly\nStarred Review. \n\nNo one is better equipped to take readers on a rollercoaster ride through time, space, and the origins of the universe than Caltech theoretical physicist Carroll, cofounder of Cosmic Variance, one of the top science blog sites. We're not thinking small here, Carroll announces with glee before launching into his topic. Time is a medium we move through and a way to sequence events. But the Arrow of Time' is also the only feature of the universe with one irreversible direction: time goes forward. This fact plays an important role in the second law of thermodynamics: the entropy (disorderliness) of an isolated system either remains constant or increases with time. This has implications for our understanding of the Big Bang origins of the universe. We may not be able to travel back in time, but we can find ways to peer back across it and see clues to how the universe evolved, thanks to such discoveries as quantum mechanics and relativity theory. Carroll writes with verve and infectious enthusiasm, reminding readers that science is a journey in which getting there is, without question, much of the fun. \n\n\nReview\n\n&quot;Unifying cosmology, thermodynamics, and information science into a refreshingly accessible whole, From Eternity to Here will make you wish time's arrow could fly in reverse, if only so you could once again read the book for the first time.&quot;\n-Seed Magazine\n\n&quot;Carroll...takes his readers on a fascinating and refreshing trek through every known back alley and cul de sac of quantum mechanics, relativity, cosmology and theoretical physics. The best way to grasp the rich mysteries of our universe is by constantly rereading the best and clearest explanations. Mr. Carroll's From Eternity to Here is certainly one of them.&quot;\n-Wall Street Journal\n\n&quot;For anyone who ever wondered about the nature of time and how it influences our universe, this book is a must read. It is beautifully written, lucid, and deep.&quot;\n-Kip Thorne, Feynman Professor of Theoretical Physics at Caltech, author of Black Holes and Time Warps\n\n\n&quot;Sean Carroll's From Eternity to Here provides a wonderfully accessible account of some of the most profound mysteries of modern physics. While you may not agree with all his conclusions, you will find the discussion fascinating, and taken to much deeper levels than is normal in a work of popular science.&quot;\n-Sir Roger Penrose, University of Oxford, author of The Road to Reality and The Emperor's New Mind","torrent":{"xt":"urn:btih:a6872dc3f660c222cfd742d5ce3f42f1a0d68c10","amp;dn":"Sean+Carroll%2CFrom+Eternity+to+Here+-+Quest+for+the+Ultimate+Theo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6872dc3f660c222cfd742d5ce3f42f1a0d68c10","infoHashBuffer":{"type":"Buffer","data":[166,135,45,195,246,96,194,34,207,215,66,213,206,63,66,241,160,214,140,16]},"announce":[],"urlList":[]}}