{"title":"Coollector Movie Database 2.66","uid":5339520,"size":28934141,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a7703f55cfd87e95f070d3402dd9902ad4a42599&amp;dn=Coollector+Movie+Database+2.66&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"macieldo","files":1,"time":1265421862,"description":"Browse our huge database of movies (and series) with advanced filters and search options. Personalize it, with your possessions and taste. Movies that you own have their title underlined. Colored icons show if you liked or disliked a movie. A quick glance at the actors or directors filmographies can help you decide what to watch on TV or in theaters, or can make you discover movies that you'd like to see and that you'll add to your wishlist with a single click.\n\nManage your collection of DVD, BLU-RAY, VHS, anything... Remember what you loaned, to whom, and when. Use the price information to not miss a good bargain. Print a list of all the movies you own. NEW! Manage the movies stored on your computer's disk. Associate video files with their corresponding movies, and launch them by clicking the &quot;play&quot; icon. The program can even scan a folder on your computer and make the associations automatically for you. Even if you don't have a large collection of videos there are still many useful things that you can do. It's completely fun because you don't start with some dull empty database. On the contrary, the setup file includes our huge encyclopedia of movies &amp; series, combined with a database of existing videos. You download... you get all that. Another benefit is that you can use the program even when you're offline.","torrent":{"xt":"urn:btih:a7703f55cfd87e95f070d3402dd9902ad4a42599","amp;dn":"Coollector+Movie+Database+2.66","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7703f55cfd87e95f070d3402dd9902ad4a42599","infoHashBuffer":{"type":"Buffer","data":[167,112,63,85,207,216,126,149,240,112,211,64,45,217,144,42,212,164,37,153]},"announce":[],"urlList":[]}}