{"title":"Megadeth - Anarchy In The U.K.  (2nafish)","uid":5273305,"size":111861764,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:a7897673b22cffa4386b8c1fd97b72eb6716ac8c&amp;dn=Megadeth+-+Anarchy+In+The+U.K.++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1263303098,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Anarchy in the U.K.&quot; is a song by the British punk rock band the Sex Pistols, released as the group's debut recording on 26 November 1976.\n\n&quot;Anarchy in the UK&quot; was covered by American thrash metal band Megadeth for their third album So Far, So Good... So What!, released in 1988.\n\nAs the song was written with incorrect lyrics, Dave Mustaine stated that he could not understand Johnny Rotten's singing, so he made up the parts he could not understand (in addition, the titular country is changed to &quot;USA&quot;). The song's music video is a simply-styled cartoon featuring political figures. Steve Jones played second solo of this song.\n\nSo Far, So Good... So What! is the third studio album by American heavy metal band Megadeth. It was released by Capitol Records in 1988. A remixed and remastered version including several bonus tracks was released in 2004. It is the band's only album recorded with Chuck Behler and Jeff Young, who were fired immediately after the subsequent tour.\n\n&quot;In My Darkest Hour&quot; was written by Dave Mustaine shortly after Cliff Burton's death. Burton was the bassist for Metallica, which Mustaine was a part of from 1981 until 1983 just before Metallica recorded its debut album Kill 'Em All.\n\n&quot;Anarchy in the U.K.&quot; is a cover version of a Sex Pistols song. This cover also features Sex Pistols guitarist Steve Jones.\n\nMegadeth is an American heavy metal band from Los Angeles, California, formed in 1983. Founded by Dave Mustaine and Dave Ellefson following Mustaine's departure from Metallica, the band has since released twelve studio albums, six live albums, two EPs, twenty six singles, thirty-two music videos, and three compilations.\n\nAs a pioneer of the American thrash metal movement, Megadeth rose to international fame in the 1980s, but experienced numerous line-up changes, due partly to the band's notorious substance abuse problems. From 1983 to 2002, Mustaine and bassist Dave Ellefson were the only continuous members of the band. After finding sobriety and securing a stable line-up, Megadeth went on to release a string of platinum and gold albums, including the platinum-selling landmark Rust in Peace in 1990 and the Grammy nominated, multi-platinum Countdown to Extinction in 1992. Megadeth disbanded in 2002 after Mustaine suffered a severe nerve injury to his left arm. However, following extensive physical therapy, Mustaine reformed the band in 2004 and released The System Has Failed, followed by United Abominations in 2007; the albums debuted on the Billboard Top 200 chart at #18 and #8, respectively. Megadeth, along with their new lead guitarist Chris Broderick, released their twelfth studio album, titled Endgame, on September 15, 2009, which debuted at number 9 on the Billboard 200.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:a7897673b22cffa4386b8c1fd97b72eb6716ac8c","amp;dn":"Megadeth+-+Anarchy+In+The+U.K.++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7897673b22cffa4386b8c1fd97b72eb6716ac8c","infoHashBuffer":{"type":"Buffer","data":[167,137,118,115,178,44,255,164,56,107,140,31,217,123,114,235,103,22,172,140]},"announce":[],"urlList":[]}}