{"title":"Linha de Passe (brazilian film)","uid":5352268,"size":1495633920,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a7c251ba034c930a560becc06ace13d10e0de1a6&amp;dn=Linha+de+Passe+%28brazilian+film%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"velani","files":1,"time":1265822243,"description":"MOVIE REVIEW\n\n\nFrom The Telegraph\n\n\nBrazilian director Walter Salles's follow up to Foreign Land impresses Tim Robey\n\nAmid the ensemble cast of Walter Salles's sensationally shot, tough-knocks urban drama Linha de Passe, one face stands out, the kind of face that owns a film and haunts you long after you've seen it.\n\nIt's the face of Dario, who dreams of being a professional footballer. The actor playing him has a ravaged magnetism, just about the worst skin you've ever seen, and holds the screen with his hopes and surliness, like Jean-Pierre LÃƒÂ©aud in Truffaut's The 400 Blows.\n\nThen the penny drops. Amazingly, this is VinÃƒÂ­cius de Oliveira, whom Salles cast as the orphaned urchin JosuÃƒÂ© in his breakthrough film Central Station (1998).\n\nHe's scarcely recognisable, and the realisation unleashes a shockwave of empathy, making you wonder what he's been up to for the past decade, how things are working out. Salles and his co-director Daniela Thomas, who worked together on the 1996 movie Foreign Land, made this follow-up to chart the changes in Brazilian society over the past 10 years. But they hold up no better mirror to these than the pitted and pleading face of this no-longer-boy.\n\nDe Oliveira grew up as a wannabe soccer star, too, fatherless, with two brothers. Dario has three, from different fathers, and a mother trying her best, played in the film's most tender and accomplished performance by Cannes Best Actress-winner Sandra Corveloni.\n\n\nThe template for this oddly lyrical inner-city dirge, with each of the four boys struggling to improve his lot, is Italian neorealism - Visconti's Rocco and His Brothers, especially - but it is not a nostalgic piece, and, for me, it's the better film.\n\nThe gifted cinematographer Mauro Pinheiro Jr and that master of darkly keening sound-worlds Gustavo Santaolalla play up poverty and loneliness, the yawning despair of SÃƒÂ£o Paulo's empty highways at night.\n\nThe shame and terror of criminal enterprise hits with more force here than the high-octane machismo of other Brazilian hits.\n\nIt's perhaps a pity that Salles and Thomas resort to a Babel-ish pile-up of over-determined crises towards the end, but it's the best way to isolate these lost souls in their intensely personal moments of escape or epiphany.\n\nWhere most pictures about families end with huggy closure, this one ends in splinters, in pain, and with five different kinds of sudden, desperate hope.","torrent":{"xt":"urn:btih:a7c251ba034c930a560becc06ace13d10e0de1a6","amp;dn":"Linha+de+Passe+%28brazilian+film%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7c251ba034c930a560becc06ace13d10e0de1a6","infoHashBuffer":{"type":"Buffer","data":[167,194,81,186,3,76,147,10,86,11,236,192,106,206,19,209,14,13,225,166]},"announce":[],"urlList":[]}}