{"title":"Band Hero (PS2.NTSC/USA.DVD9.ESR+Ripkit Included)","uid":5210578,"size":8199257339,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:a7e35e4d76eac356b3c1f7bea6c48a6769ca9fef&amp;dn=Band+Hero+%28PS2.NTSC%2FUSA.DVD9.ESR%2BRipkit+Included%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"CivicScootin","files":-1,"time":1260573726,"description":"Another great release by none other then Civic/Scootin\n\n............................................\n\nWhat is included with in this torrent:\n\nBand Hero (NTSC) for the PS2\nESR Patcher (after using the ripkit to make this ISO into a DVD-5)\nBand Hero Box Cover Pix\nDrakia's Ripkit to convert this ISO into a DVD-5\nREADME.TXT (includes directions on how to use the ripkit)\n\n/////////\n\nHow do I use the Ripkit made by Drakia:\n\nRead the README.TXT within this torrent as the directions are included there\n\n/////////\n\nHow do I use the ESR Patcher:\n\nThe ESR Patcher is just as easy as clicking on the .exe file and Click on the &quot;Patch&quot; tab.. \nOnce you click on the tab you can then browse for your ISO that you would like to patch..\nAnother way is to just drag and drop the ISO into the app as this is reported to work as well.. \n\nNOTE: Do not use ESR Patcher if you are ever thinking of using the ripkit to convert the DVD-9 to a DVD-5~as there may be data and hash check issues with in the kit as well as in the ISO\n\nOnce converted to DVD-5 you can then use ESR Patcher and patch your ISO\n\n/////////\n\nDid you make the ESR Patcher or the ripkit for this:\n\nNo I did not..\nHowever all credit goes to the makers/authers of the programs givin..\n\n/////////\n\nCan the ESR Patcher be used on any PS2 game:\nYes\n\n/////////\n\nHow do I load a game once patched with ESR:\n\nAfter you had burned the ISO to a DVD you will then need a program to run such a patch..\nThe easy way would be to do a Google search for &quot;FMCB&quot; and &quot;ESR.elf&quot;\nBoth programs hold home to PSX-Scene.com\n\n/////////\n\nWhy wont ESR Patch a CD PS2 game:\n\nI will not brake this down into detail. However it just will not work unless you where to convert the CD game to a DVD (this is rather simple to do just do a google search)\n\n/////////\n\nHow do you install games using HDL (Hard Drive Loader):\n\nThere are a few ways to do this..\nThe easyest would be to use WinHIIP 1.7.6 while the other is to use a great program called HDL DUMP HELPER GUI (finding both are as easy as copy and pasting with in Google.com)\n\n............................................\n\nGame: Band Hero\n\nESRB Rating: Everyone 10 and Older\n\nLyrics: Mild Suggestive Themes\n\nDeveloper: Neversoft Entertainment\n\nPublisher: Activision\n\nRelease Date:  November 3, 2009\n\nSystem: PS2\n\nRegion-Country: NTSC-USA\n\nESR Pre-Patched: NO, However the Patcher is included with the torrent\n\nWorks on HDL: Yes, No modes needed (includes both DVD9+DVD5)\n\nDVD-5: No, Files for the DVD-5 are included however (thanx to Drakia)\n\nDVD-9: Yes, As posted above if you want to use this with a 4.7Gb DVD disk then your going to need to use the rip kit first..\nOther wise your going to need a DVD-DL (Dual Layer)DVD in order to burn the DVD9 version\n\n............................................\n\nDescription:\nAlthough guitar heroics often take the lead in modern popular music, rock &amp; roll has always been a group activity, and Activision's Band Hero aims to gets the whole crew into the act. As its title proclaims, the continuation of the genre-founding Guitar Hero series sets center stage for the whole band -- drummers and vocalists as well as lead and bass guitarists -- and is designed to let gamers play along with a diverse selection of contemporary and classic rock and pop songs, using their favorite instruments in their own style. To keep the focus on fun, Band Hero offers &quot;No Fail&quot; gameplay modes for instrumentalists, and a &quot;Sing-Along&quot; mode for karaoke-style parties, allowing players to open up and express themselves, without worrying about keeping up with progressions or scoring points. The game's &quot;Party Play&quot; mode allows players to drop in and out of a song at will, as the music keeps playing.\n \nThe console disc edition of Band Hero offers more than 65 popular songs. Top selling country crossover star Taylor Swift is prominently featured in the game, with the inclusion of three songs from her first two original albums, and the artist's performances were motion-captured to bring her in-game persona realistically to life. Guitarist and singer Adam Levine of Maroon 5 was motion-captured, as well, for his appearance in the game as a playable character. Band Hero's play-along soundtrack also includes timeless tracks such as David Bowie's &quot;Let's Dance,&quot; Devo's &quot;Whip It,&quot; the Jackson 5's &quot;ABC,&quot; &quot;Mr. Roboto&quot; from Styx, and original hit singles from a diverse selection of artists, including Aly and AJ, Cheap Trick, Fall Out Boy, the Go-Gos, the Mighty Mighty Bosstones, Roy Orbison, Tonic, the Village People, and many others\n\n............................................\n\n\nEnjoy,\nCivic/Scootin\n\nPLEASE HELP SEED AS IM LIMITED ON MY BANDWIDTH","torrent":{"xt":"urn:btih:a7e35e4d76eac356b3c1f7bea6c48a6769ca9fef","amp;dn":"Band+Hero+%28PS2.NTSC%2FUSA.DVD9.ESR%2BRipkit+Included%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7e35e4d76eac356b3c1f7bea6c48a6769ca9fef","infoHashBuffer":{"type":"Buffer","data":[167,227,94,77,118,234,195,86,179,193,247,190,166,196,138,103,105,202,159,239]},"announce":[],"urlList":[]}}