{"title":"Shontelle - Licky (Under The Covers)  (2nafish)","uid":5365138,"size":137123844,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:a7f33bad65d5f97e3f853c3c31c891462633493d&amp;dn=Shontelle+-+Licky+%28Under+The+Covers%29++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1266193141,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\nNo Gravity is the second studio album by Barbadian pop/R&amp;B singer, Shontelle. It is due for a release on April 6, 2010. The song &quot;Licky (Under the Covers)&quot; will be released as the lead worldwide single on January 26, 2010, while &quot;Impossible&quot; will be released as the lead US single on February 2, 2010. The second US single, &quot;Impossible&quot;, was released February 9 2010.\n\nShontelle stated in July 2009 that her second record would be much &quot;edgier&quot; and that there was a &quot;rock chick&quot; waiting to come out of her. She also stated that she wants her fans to hear a new sound from her on this album. Later that month, Shontelle described it as a dance/rock sound. Shontelle's new album is speculated[who?] to be similar to work of the likes of BeyoncÃƒÂ© and Katy Perry. Shontelle stated that most of the details of the album will remain a secret for a while, but it has been confirmed that she is working with Akon and Sean Garrett. Shontelle began recording in August 2009, and stated in January of 2010, that recording had been completed.\n\nOn January 6, 2010, the songs &quot;DJ Made Me Do It&quot; and &quot;Say Hello to Goodbye&quot; were posted on her official myspace. Shontelle has stated that the songs might appear on the album. Although Shontelle originally stated that the album would be an electropop album, she has now stated that it will mainly be an R&amp;B/disco record with a few pop rock and electro-influenced songs.\n\nShontelle Layne (born October 4, 1985), better known by her first name Shontelle, is a singer-songwriter from Barbados. Her first music venture is when she appeared in the music video for the re-worked &quot;Roll It&quot; performed by J-Status featuring her and Rihanna, from 2006. Shontelle is signed to Street Records Corporation/Universal Motown Records, Where she released her debut album &quot;Shontelleigence&quot;. The album spawned the singles T-Shirt, Stuck With Each Other featuring Akon and Battle Cry. She also won the Barbados Music Award (BMA) for &quot;Song of the Year&quot; (2009) for &quot;T-Shirt&quot;. Her sophomore album, &quot;No Gravity&quot; is set to be released during Spring 2010. Singles from the album include the lead US single, Impossible and Licky (Under the Covers) in the UK. Both singles are yet to be released.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:a7f33bad65d5f97e3f853c3c31c891462633493d","amp;dn":"Shontelle+-+Licky+%28Under+The+Covers%29++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7f33bad65d5f97e3f853c3c31c891462633493d","infoHashBuffer":{"type":"Buffer","data":[167,243,59,173,101,213,249,126,63,133,60,60,49,200,145,70,38,51,73,61]},"announce":[],"urlList":[]}}