{"title":"Christina Aguilera featuring Missy Elliot - Car Wash (2nafish)","uid":5429748,"size":145862660,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:a8283da5b1fa7ace46f22adcfe5bac8bb3d78d2d&amp;dn=Christina+Aguilera+featuring+Missy+Elliot+-+Car+Wash+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1268370584,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nChristina Aguilera featuring Missy Elliot - Car Wash (Soundtrack: Shark Tale) (2nafish)\n\n\nNote: This video is a &quot;Movies &amp; Music&quot; video so it has 2 logos.\n\n\n\n&quot;Car Wash&quot; is a 1976 number-one popular and soul music single album by Rose Royce for MCA Records, the group's debut single album and one of the most notable successes of the disco era. Written and produced by the band's main producer Norman Whitfield, &quot;Car Wash&quot;, the theme of the 1976 film Car Wash, was Rose Royce's most successful hit single. &quot;Car Wash&quot; also peaked at number three on the disco charts. The song was later covered in 2004 by Christina Aguilera and Missy Elliott, who released their version as the single for the Shark Tale soundtrack.\n\nNorman Whitfield, a former producer for Motown Records, had been commissioned to record the soundtrack album for Car Wash by director Michael Schultz. Although Whitfield did not want to assume the project, he did so because of both the money and the chance to give Rose Royce, a disco/funk band who left Motown with Whitfield in 1975, the exposure they needed to become mainstream. Unable to develop a theme song for the film, inspiration finally struck Whitfield while playing a game of basketball, and he allegedly wrote his first draft of &quot;Car Wash&quot; on a bag of fried chicken he'd bought.\n\nIn 2004, pop singer Christina Aguilera and rapper/singer Missy Elliott recorded a cover version of &quot;Car Wash&quot;, giving the disco song a more modern pop feel and adding rapped verses from Elliott. In an interview Aguilera said, &quot;...we had to change the key to be a little bit higher for my range. So we couldn't take the exact samples, but we brought in all these live instruments to recreate kind of this old, old classic, soulful feel and sound....&quot;\n\n&quot;Car Wash&quot; was the only single from the soundtrack to DreamWorks' computer animated film Shark Tale. Their version was supported with a music video, featuring Aguilera and Elliott as animated fish similar to those in the film. Aguilera and Elliott's cover of &quot;Car Wash&quot; missed the U.S. Billboard Top 40, peaking at number sixty-three, while becoming a top five hit in the United Kingdom and became the 48th best selling single in the United Kingdom of 2004 with sales of over 100,000 copies, despite only being released in late November.\n\nIn this context, the &quot;car wash&quot; the song refers to would be the place where Oscar (the main protagonist, voiced by Will Smith) works, where large sea animals who behave like cars are washed in the same manner.\n\nThe music video to Christina's version was directed by Rich Newey.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:a8283da5b1fa7ace46f22adcfe5bac8bb3d78d2d","amp;dn":"Christina+Aguilera+featuring+Missy+Elliot+-+Car+Wash+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8283da5b1fa7ace46f22adcfe5bac8bb3d78d2d","infoHashBuffer":{"type":"Buffer","data":[168,40,61,165,177,250,122,206,70,242,42,220,254,91,172,139,179,215,141,45]},"announce":[],"urlList":[]}}