{"title":"Drowned God","uid":5431239,"size":1907509026,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a9ecb6c708d17f3a2b915f2bb1e77e93a26211b4&amp;dn=Drowned+God&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Psychodad149","files":38,"time":1268420489,"description":"DROWNED GOD\nConspiracy of the Ages\n\n&quot;Unlock 40,000 years of lies.&quot;\n\nBy Jeff Sengstack, GameSpot\n\n\n\n\nThe Bible and Darwin were both wrong.\n\nThat is the premise of Drowned God, a point-and-click, hi-res graphic adventure that will rattle a few cages and get plenty of ink. &quot;It's obviously a contentious subject,&quot; says the game's producer, Algy Williams. &quot;If we piss off a few zealots, so much the better.&quot;\n\nThe game purports that many thousands of years ago an alien race from Orion not only genetically engineered humans but also guided their social and scientific development. Then along came the great flood, erasing much of that work and concealing the world's greatest artifacts: the Rod of Osiris (the Egyptian god of the dead), the Holy Grail, the Philosopher's Stone, and the Ark of the Covenant.\n\nYour challenge is to visit the four earthly and spiritual realms in which these items can be found, unlock a labyrinth of puzzles, and complete several tasks to gather them one by one. Sound like your basic treasure hunt? It's not - far from it.\n\n......\n\n+++++++++++++++++++++++++\nThis was one of my favorite games of all time, despite reviews and ratings that were ultimately less enthusiastic than the  one above,  In fact, Gamespot later ended up rating this game only 6.2, with the following comments:\n\n&quot;Drowned God is loaded with freaky animations and unexpected visual twists - the inner workings of a time travel machine, the twisted visage of Morgan Le Fay, the murky ruins of Atlantis - all imaginary things made disturbingly real. The soundtrack is less impressive, primarily because of overuse: The background effects drone on mercilessly, and many of the game's narratives (which are universally well-written and finely acted) must be listened to over and over again.\n...\n\nDrowned God does have a few very original puzzles - the Newton/Einstein dialogue puzzle in particular is a brilliant idea - but many more are straight out Adventure Design 101. Mazes? Connect the dots? Concentration? Ideas as original as Horse's call for puzzles to match, not rehashes of things we've seen far too many times already.\n...\n\nThe net effect is that the story - which made this game so intriguing in the first place - is almost totally lost, and that is a shame. One can only wonder what might have been if . . . .&quot;\n\nDon't let that deter you!  This is an intense and immersive game, despite any flaws. With some of the puzzles it is not at all clear what the objective is; the Knight Templar Puzzle is so difficult that it was hard to solve even following the solution in the original game manual!  See the info sheet first, there is also a walkthru included.\n\nAs President Kennedy said though, &quot;We do not choose to do these things because they are easy, but because they are hard.&quot;  Good luck, and enjoy! ","torrent":{"xt":"urn:btih:a9ecb6c708d17f3a2b915f2bb1e77e93a26211b4","amp;dn":"Drowned+God","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9ecb6c708d17f3a2b915f2bb1e77e93a26211b4","infoHashBuffer":{"type":"Buffer","data":[169,236,182,199,8,209,127,58,43,145,95,43,177,231,126,147,162,98,17,180]},"announce":[],"urlList":[]}}