{"title":"Born To Be King, Prince Charles At 60","uid":5264289,"size":685590094,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:ab422edc24f6ce341bd937195260a04e68ed3e8a&amp;dn=Born+To+Be+King%2C+Prince+Charles+At+60&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1262839072,"description":"When Prince Charles turned 60 in November 2008, he became the oldest heir to the British throne in history. Ever since his mother became Queen in 1952 he has been a king-in-waiting, constantly searching for a role that is both public and royal. It has been a long, sometimes painful journey for this dedicated prince and complex man who - rare among royals - has become wiser and happier with age.\n\nThis is the story of a man trained to look backwards at a not always glorious royal tradition, who was blown off course by tempestuous events (an ill-fated marriage, an ugly divorce and a tragic death), who somehow survived public humiliation, found true love the second time around, triumphed over media scorn (his passion for organic food transformed him from 'loony eccentric' into 'great visionary') and, without throwing tradition away, became a thoroughly modern prince and loving father.\n\nThrough extensive archival footage, this biography follows Prince Charles's life in scrupulous and occasionally shocking detail. The powerful narrative is divided into four chapters: 1. CHILDHOOD MEMORIES (miserable schooldays, moments of wonder), 2. COMING OF AGE (becoming a soldier and an international playboy), 3. LOVE AND MARRIAGE (the wooings and weddings of Charles and his brothers) and 4. AFTER DIANA (from her tragic death - and her ghostly influence - to a second, happy marriage and the flowering of his heroic sons).\n\nThis is a prince whose life is not ending, but beginning again. Yet one important question still hangs in the air: will his new wife, Camilla, become his consort...or his queen?\n\n\n  ____                      _                      _   _       _\n / ___|___  _ __  ___ _ __ (_)_ __ __ _  ___ _   _| | | |_   _| |__\n| |   / _ \\| '_ \\/ __| '_ \\| | '__/ _` |/ __| | | | |_| | | | | '_ \\\n| |__| (_) | | | \\__ \\ |_) | | | | (_| | (__| |_| |  _  | |_| | |_) |\n \\____\\___/|_| |_|___/ .__/|_|_|  \\__,_|\\___|\\__, |_| |_|\\__,_|_.__/\n                     |_|                     |___/\n   ____\n  / ___|___  _ __ ___\n | |   / _ \\| '_ ` _ \\\n | |__| (_) | | | | | |\n(_)____\\___/|_| |_| |_|\n\n\nPLEASE KEEP SEEDED TO PASS ON THE MESSAGE.  PLEASE VISIT OUR SITE AND SHARE THE WORD!\nDOWNLOAD MAYBE SLOW BUT SURE! PLEASE ASSIST IN BANDWIDTH!\n\n* Don't Be Fooled Any Longer on Darwinism, Evolution, Global Warming Lies, Internationalism, etc.\n* Get The Message Out, Openly!\n","torrent":{"xt":"urn:btih:ab422edc24f6ce341bd937195260a04e68ed3e8a","amp;dn":"Born+To+Be+King%2C+Prince+Charles+At+60","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab422edc24f6ce341bd937195260a04e68ed3e8a","infoHashBuffer":{"type":"Buffer","data":[171,66,46,220,36,246,206,52,27,217,55,25,82,96,160,78,104,237,62,138]},"announce":[],"urlList":[]}}