{"title":"Zeitgeist The Movie (Final Edition) DvdRip - TokeUp","uid":5376734,"size":548031236,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:abdae76513874b31a678bd94f4033bd2890280b1&amp;dn=Zeitgeist+The+Movie+%28Final+Edition%29+DvdRip+-+TokeUp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TokeUp","files":2,"time":1266595516,"description":"Zeitgeist (2007)\n\n\n\nExtremely controversial documentary split into three parts, first producing information discrediting religion, particularly Christainity through showing the simmilarities of major religious figures. Part 2 describes the problems with what was told to us about the events surrounding Sept. 11 and and provides evidence to show who the writers believe really was responsible for the attacks. The third part deals with banks and resulting theories of World leaders plans to create one world bank. Also touches on the people responsible for the Great Depression.\n\nThis film gathers information from many sources and puts it together in a way that shows it is possible for people to be manipulated by large institutions, governments and economic powers. It is divided into 3 parts. 1. Religion: Pagan astrological beliefs compared to modern and ancient religions. (9:35-35:53) 2. 9/11: An overview of the numerous questionable aspects of this immensely important event. (35:54-1:09:16) 3. The Federal Reserve Bank: A history of its formation and ability to control the economy. (1:09:17-1:56:23) With many news clips from tragic events in history, audio excerpts from those who believe people are being misled about the level of freedom they have, this riveting documentary will anger those who agree with it as well as those who do not. A very timely and important piece of work that all free thinking people should see. Viewer Content Warning: This film contains stock photos and film of war and September 11th scenes that may not be suitable for all viewers. (18 or older) \n\nThis documentary is not for the faint-hearted. it dissects the origins of the christian religion and gives an interesting view on how a few american banks (and thus a few very powerful people) have seized worldpower at the beginning of the 20th century. it also related these topics to the big wars that have been fought in the 20th century and are still being fought today!\n\n\nThis is not just a movie.... The Zeitgeist is now one of the most rapidly spreading activist movements in the World!\n\n\nCheck These links for more details on the Zeitgeist Movement:\n\n &lt;a href=&quot;\thttp://www.thezeitgeistmovement.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\thttp://www.thezeitgeistmovement.com/&lt;/a&gt;\n &lt;a href=&quot;\thttp://en.wikipedia.org/wiki/The_Zeitgeist_Movement&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\thttp://en.wikipedia.org/wiki/The_Zeitgeist_Movement&lt;/a&gt;\n\n\nWe can all participate for the cause and make a better tomorrow!\n\n\n\nBoth 'Zeitgeist, The Movie' and 'Zeitgeist: Addendum' were created as Not-for-Profit expressions\nto communicate what the author felt were highly important social understandings which\nmost humans are generally not aware of. The first film focuses on suppressed\nhistorical &amp; modern information about currently dominant social institutions, while\nalso exploring what could be in store for humanity if the power structures at large continue\ntheir patterns of self-interest, corruption, and consolidation.\n\nThe second film, Zeitgeist: Addendum, attempts to locate the root causes\nof this pervasive social corruption, while offering a solution. This solution is not\nbased on politics, morality, laws, or any other &quot;establishment&quot; notions of human affairs,\nbut rather on a modern, non-superstitious based understanding of what we are\nand how we align with nature, to which we are a part. The work advocates\na new social system which is updated to present day knowledge, highly influenced\nby the life long work of Jacque Fresco and The Venus Project. \n\n\n\nSo feel free to distribute this movie as much as you like! There Ain't no Unkle Sam gonna stop you for it!...\n\n\nEnjoy n Please keep Seeding.... :)","torrent":{"xt":"urn:btih:abdae76513874b31a678bd94f4033bd2890280b1","amp;dn":"Zeitgeist+The+Movie+%28Final+Edition%29+DvdRip+-+TokeUp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"abdae76513874b31a678bd94f4033bd2890280b1","infoHashBuffer":{"type":"Buffer","data":[171,218,231,101,19,135,75,49,166,120,189,148,244,3,59,210,137,2,128,177]},"announce":[],"urlList":[]}}