{"title":"Dan And Nick Forty Nights In The Wildebeest &amp; The Wildebeest Yea","uid":5340466,"size":345574687,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ac710b83ad725a80d86b715a81725595fd6460fb&amp;dn=Dan+And+Nick+Forty+Nights+In+The+Wildebeest+%26+The+Wildebeest+Yea&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"_Slimoo_","files":13,"time":1265416942,"description":"Dan And Nick The Wildebeest Years &amp; Forty Years In The Wildebeest - Series 01 - Audio Comedy - BBC7 via DVB-T\n13 x 30 minute episodes - 128Kbps - Mp3 - Slimoo\n\n\nDan and Nick: The Wildebeest Years was a BBC Radio 4 comedy series originally broadcast in seven episodes in 1998. \nThe Dan and Nick of the title are Dan Freedman and Nick Romero.\n\nA follow-up series of a further six episodes was made, this time called Forty Nights in the Wildebeest\n\nThe characteristic feature of Dan and Nick's style is the heavy use of puns. Indeed, the frequency of puns incorporated into these programmes has rarely been matched since I'm Sorry I'll Read That Again.\n\nThe shows premise centered around short sketches and songs performed in a cabaret style. Dan and Nick had a supporting band, 'The Gents'. \n\n\nTypical sketches included lampooning films, music, and other popular culture. \n \nSome recurring jokes were:\nIncy Wincy Quincy, a spider pathologist, obviously lifted from TV-show Quincy, M.E.,\nTossed in Space, a satire of Lost in Space about trapped salad items in space,\nCensorship gags, for example, reading football scores while bleeping out any innocuous sounding words, including from the middle of words, and\nThe Annals of History and The Century's Passage, a humorous and satirical look back through historic events.\nRobin Would, a gay and camp version of Robin Hood with guest Richard Coles playing the lead, whose catchphrase was &quot;what would you have me do, live a lie&quot;.\nBig Fact Hunting, (needs to be spoken very precisely to get past the censors), another excuse to introduce as many one liners as possible on a particular theme\n\n\n\nBasically this series is a joke every few seconds\n\nCast:\nDan Freedman \nNick Romero\n\nDan And Nick The Wildebeest Years - S01 - E01\nDan And Nick The Wildebeest Years - S01 - E02\nDan And Nick The Wildebeest Years - S01 - E03\nDan And Nick The Wildebeest Years - S01 - E04\nDan And Nick The Wildebeest Years - S01 - E05\nDan And Nick The Wildebeest Years - S01 - E06\nDan And Nick The Wildebeest Years - S01 - E07\n\nDan And Nick Forty Nights In The Wildebeest - S01 - E01\nDan And Nick Forty Nights In The Wildebeest - S01 - E02\nDan And Nick Forty Nights In The Wildebeest - S01 - E03\nDan And Nick Forty Nights In The Wildebeest - S01 - E04\nDan And Nick Forty Nights In The Wildebeest - S01 - E05\nDan And Nick Forty Nights In The Wildebeest - S02 - E06\n\n\nAudio Format    : MP3\nDuration        : 28mn 1s\nBit rate mode   : Constant\nBit rate        : 128 Kbps\nChannel(s)      : 2 channels\nSampling rate   : 44.1 KHz\nResolution      : 16 bits\n\n\n[","torrent":{"xt":"urn:btih:ac710b83ad725a80d86b715a81725595fd6460fb","amp;dn":"Dan+And+Nick+Forty+Nights+In+The+Wildebeest+%26+The+Wildebeest+Yea","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac710b83ad725a80d86b715a81725595fd6460fb","infoHashBuffer":{"type":"Buffer","data":[172,113,11,131,173,114,90,128,216,107,113,90,129,114,85,149,253,100,96,251]},"announce":[],"urlList":[]}}