{"title":"Corbin Fisher - - - Blowing Gage ((MictrmbL))","uid":5363682,"size":172704465,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:acc433a70585ce84a7e24b2d5d98e08ebdfe63c4&amp;dn=Corbin+Fisher+-+-+-+Blowing+Gage+%28%28MictrmbL%29%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mictrmbl","files":2,"time":1266191767,"description":"From the vaults of Corbin Fisher:\n\n\nSeeing Derek smile makes me melt. Seeing Derek work a hard cock between those hot lips of his makes me explode! Few guys can match Derek's enthusiasm and energy, so when it came time for Gage to make his first step in some guy on guy action here at CF, Derek was the ideal candidate to be his partner! It's most definitely clear in this video, from Gage's response to Derek's expert BJ, that this was indeed the case!\n\nWatching this vid from start to finish is a must, as you see Derek go to work on Gage's tight bod - licking his muscles and upper body all over, as well as both studs engaging in some hot making out - before swallowing Gage's cock and giving it the royal treatment. It takes a little while for Gage's hot cock to respond to Derek's treatment, but that's one of the things that makes this video so hot to watch! You see Gage's dick gradually grow from soft to fully rockhard, all thanks to Derek's wet mouth and firm hands!\n\nGage's cumshot at the end of this vid totally drenches Derek's ripped chest in a hot load, even though Gage's first huge spurt flew right over and past Derek! That's one heckuva load, and it looks totally perfect all over Derek.\n\nNo doubt, if your first time in a male/male action scene on CF is with Derek, you're one lucky stud! Gage learned that fact, no doubt, and had himself quite the blast (in more ways than one!). I suspect this vid was all the more fun for Gage as he's an extremely open-minded, laid-back guy who has no problem having fun and experiencing pleasure however it's available, whether with a girl or a guy. Ya gotta love open-minded college studs!","torrent":{"xt":"urn:btih:acc433a70585ce84a7e24b2d5d98e08ebdfe63c4","amp;dn":"Corbin+Fisher+-+-+-+Blowing+Gage+%28%28MictrmbL%29%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"acc433a70585ce84a7e24b2d5d98e08ebdfe63c4","infoHashBuffer":{"type":"Buffer","data":[172,196,51,167,5,133,206,132,167,226,75,45,93,152,224,142,189,254,99,196]},"announce":[],"urlList":[]}}