{"title":"RONDO' VENEZIANO - PAPAGENA[TNTVILLAGE]","uid":5251163,"size":262982352,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ad2774e12530bc768406cd4afada4bbf74ee28b3&amp;dn=RONDO%5C%27+VENEZIANO+-+PAPAGENA%5BTNTVILLAGE%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":22,"time":1262362105,"description":"[b][color=blue][u] RONDO' VENEZIANO[/u][/color][color=red]\n\nPAPAGENA[/color][/b]\n\n[b][color=green]::-&gt;COVER&lt;-::[/b][/color]\n\n[IMG]http://img37.imageshack.us/img37/773/1196796236rvpapagena.jpg[/IMG]\n\n[b][color=green]::-&gt;TRACKLIST&lt;-::[/color][/b]\n\n   1. Papagena (Gian Piero Reverberi e Ivano Pavesi) - 3:04\n   2. DÃƒÂ©sirÃƒÂ©e (Gian Piero Reverberi e Ivano Pavesi) - 3:22\n   3. Il balcone di Giulietta (Gian Piero Reverberi e Ivano Pavesi) - 3:47\n   4. Puerta del Sol (Gian Piero Reverberi e Ivano Pavesi) - 3:44\n   5. La grotta azzurra (Gian Piero Reverberi e Ivano Pavesi) - 3:35\n   6. Dopo il concerto (Gian Piero Reverberi e Ivano Pavesi) - 2:53\n   7. Il battistero (Gian Piero Reverberi e Ivano Pavesi) - 4:00\n   8. Rifugio alpino (Gian Piero Reverberi e Ivano Pavesi) - 4:16\n   9. DÃƒÂ©sir d'amour (Gian Piero Reverberi e Ivano Pavesi) - 2:37\n  10. Viale Rossini (Gian Piero Reverberi e Ivano Pavesi) - 2:59\n  11. Alba sul mare (Gian Piero Reverberi e Ivano Pavesi) - 3:31\n  12. Siciliana (Suite per Armonica e Archi) (Gian Piero Reverberi) - 3:00\n\n\nTitolo    Papagena\nArtista \tRondÃƒÂ² Veneziano\nTipo album \tStudio\nPubblicazione \t 2001\nDurata \t38 min : 48 s\nDischi \t1\nTracce \t12\nGenere \tPop-classica\nGian Piero Reverberi (Conductor), Dino Baranzelli (Photography), Klaus Strazicky (Engineer), Flora Sala (Artwork), Ozzy Schaller (Guitar (Electric)), Eckhard \n\nGmeiner (Photography), Gian Piero Reverberi (Producer), Alberto Rossi (Illustrations), Gian Piero Reverberi (Arranger), Flora Sala Anastasia (Cover Art)\n\n[b][color=green]::-&gt;RONDO' VENEZIANO&lt;-::[/color][/b]\n\n[IMG]http://img46.imageshack.us/img46/4842/rondvenezianorvreverber.jpg[/IMG]\n\nIl RondÃƒÂ² Veneziano (RondÃƒÂ² Veneziano Chamber Orchestra) ÃƒÂ¨ un ensemble musicale italiano che compendia la musica barocca prodotta da una tipica orchestra da \n\ncamera e le sonoritÃƒÂ  della musica pop e rock. ÃƒË† stato ideato e creato nel 1979 dal compositore e direttore d'orchestra genovese Gian Piero Reverberi (con \n\nLaura Giordano) ed ha inciso ventotto album discografici. Il tipo di musica, classico ma allo stesso tempo contemporaneo, ed il modo in cui si presenta \n\nl'orchestra, che suona in abiti settecenteschi, ha destato subito l'interesse e la curiositÃƒÂ  del pubblico: l'ensemble raggiunse immediatamente il successo \n\nagli inizi degli anni '80 rimanendo per anni ed ancora oggi uno dei simboli della creativitÃƒÂ  musicale italiana del decennio.\n\nL'organico del RondÃƒÂ² Veneziano ÃƒÂ¨ tuttora formato da tre violini, una viola, un violoncello, un oboe e un flauto traverso con l'aggiunta di strumenti moderni \n\ncome il basso elettrico e la batteria. ÃƒË† in questa formazione che il gruppo si esibisce come ospite nelle trasmissioni TV. Nelle performance dal vivo il \n\ngruppo ÃƒÂ¨ accompagnato da ventidue orchestrali creando, in questo modo, una sonoritÃƒÂ  sinfonica adatta per i teatri e gli auditorium.\n\nDurante le sessioni di studio di registrazione l'ensemble ÃƒÂ¨ composto da otto violini primi, otto violini secondi, sei viole, sei violoncelli e due \n\ncontrabbassi: a questi strumenti si aggiungono la chitarra classica o elettrica, la tromba, il corno francese e ultimamente il pianoforte per le composizioni \n\ncon solista.\n\nIl vasto repertorio, composizioni ispirate ai modelli stilistici di Vivaldi, Albinoni, Galuppi e del tardobarocco europeo, porta la firma dello stesso \n\nReverberi, giÃƒÂ  noto come prestigioso arrangiatore di Lucio Battisti, Fabrizio De AndrÃƒÂ©, Gino Paoli, Luigi Tenco, Mina Mazzini e Eros Ramazzotti. In realtÃƒÂ , \n\nnon tutti i brani del RondÃƒÂ² Veneziano sono riconducibili a dei modelli settecenteschi. Vi sono composizioni che si orientano verso esempi di altre epoche \n\ndella storia della musica; altre composizioni riproducono invece strutture proprie della musica leggera, limitando il collegamento con il passato alla sola \n\nsonoritÃƒÂ  orchestrale.\nI RondÃƒÂ² Veneziano in una trasmissione televisiva\n\nScomparso dai palcoscenici italiani ad esclusione di Venezia, dal 1993 il gruppo continua la propria attivitÃƒÂ  con tournÃƒÂ©e nei diversi paesi europei (in \n\nparticolare in Svizzera, Lussemburgo, Austria, Germania) e a Las Vegas. Il 10 e l'11 gennaio 2009 il gruppo si ÃƒÂ¨ esibito nuovamente in Italia presso il \n\nPoliteama Rossetti di Trieste\n\n[b][color=green]::-&gt;DATI TECNICI&lt;-::[/color][/b]\n[color=red][b]\nFLAC + CUE \nBABY RECORDS\nCOVER E BOOKLET[/color][/b]\n\n\nTNTVILLAGE.SCAMBIOETICO.ORG","torrent":{"xt":"urn:btih:ad2774e12530bc768406cd4afada4bbf74ee28b3","amp;dn":"RONDO%5C%27+VENEZIANO+-+PAPAGENA%5BTNTVILLAGE%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad2774e12530bc768406cd4afada4bbf74ee28b3","infoHashBuffer":{"type":"Buffer","data":[173,39,116,225,37,48,188,118,132,6,205,74,250,218,75,191,116,238,40,179]},"announce":[],"urlList":[]}}