{"title":"Audigy Support Pack 3.6 by daniel_k","uid":5382071,"size":63122161,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ad6cf4735d87d864f8fa03eb51e420799da1324f&amp;dn=Audigy+Support+Pack+3.6+by+daniel_k&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"0b1100101","files":2,"time":1266775089,"description":"Audigy Driver for Windows Vista / 7 / etc. by daniel_k\n\nNote from http://forums.creative.com/t5/Sound-Blaster/SB-Audigy-Series-Support-Pack-3-6-11-09-2009/m-p/540934:\n\nIMPORTANT: Before installing this version, start Windows in Safe Mode and delete the following files:\n\n- 32-bit: C:WindowsSystem32UDAAPO32.DLL\n- 64-bit: C:WindowsSystem32UDAAPO64.DLL and C:WindowsSysWOW64UDAAPO32.DLL \n\n\n\nSupports any model of the following Sound Blaster cards (based on Emu10kx DSP):\n\n- Audigy\n- Audigy 2\n- Audigy 2 ZS\n- Audigy 4\n \nFor Audigy SE/LS/Value and Live! 24-bit cards, click here for a compatible version.\n \nOperating systems supported: 32-bit and 64-bit editions of Windows 7 RTM / Vista SP2 / XP SP3\n \nIncluded in the pack: \n \n- Audigy series driver 2.18.0011.10 (latest beta)\n- ALchemy 1.26.04\n\n- Audio Console 1.32.02\n- DDL and DTS Connect License Activation 2.00.03 (*)\n- Dolby Digital Live Pack 3.00.03 (*)\n\n- DTS Connect Pack 1.68.75 [modified 1.03.04] (*)\n- EAX Console 3.00.56 (Windows XP only)\n- Graphic Equalizer 2.00.65\n- MediaSource DVD-Audio Player 2.00.78\n- SoundFont Bank Manager 3.21.00\n- Speaker Settings 2.00.60\n\n- THX Setup Console 2.10.43 (Windows XP only)\n \n\n(*) Purchase and activation required, more info at http://buy.soundblaster.com/.\n\n \nDoes this driver improve sound quality or performance? Are there any tweaks?\n\n\nNo, this driver does not improve sound quality nor increase performance.\n\nNo, there are no tweaks.\n\nIf someone states that its driver improves sound quality and performance, you are being fooled, cheated.\n\n \n\nIt is even worse that the so called tweaks come from a person who is not EVEN technically acknowledged, does NOT know anything about Windows internals, software engineering and sound fidelity that all audiophiles always look for.\n\n \n\nIf you &quot;feel&quot; the sound better, that is the infamous placebo effect and there is no real proof that any tweaks work.\n\n \n\nIn fact, I have yet to see a driver that states in its release notes that it improves sound quality.\n\n \n\nI've disassembled about every single .SYS driver, .DLL libraries and .EXE executables and found nothing.\n\n \n\nThere are some undocumented registry values, but nothing related to sound quality or performance.\n\n \n\nWould the so called tweaks even exist, they would be in my Support Packs, you can bet that.\n\n \n\n \n\n\n\n \n\n \n\nFixes and improvements:\n\n \n\n- Fixes the static issue when playing audio using DirectSound, WaveOut or WASAPI interfaces.\n\n- DTS Interactive encoder now works on Windows XP without any tricks.\n\n- Fixes a cosmetic issue on Audio Console, encoder status now says DTS Interactive.\n\n- Readds support for 64-bit OpenAL and 64-bit ASIO.\n\n- Fixes Microphone not available on Audigy1 cards on Windows 7 / Vista.\n\n- Enables support for WASAPI exclusive-mode event-driven playback, seems to be working just fine.\n\n- Fixes the enhancements errors in Windows mixer and Windows Media Player.\n\n- Adds Microsoft Audio Home Theather Effects for both Speakers and S/PDIF Out endpoints.\n\n- Includes Encoder Switcher to enable DTS Interactive on Audigy cards.\n\n- Fixes the Audio Console &quot;Internal application error&quot; when enabling the DDL Encoder on localized installs.\n\n- Updates Audio Console to display DTS Interactive in the Encoder tab when Encoder switcher is used.\n\n- Workarounds a bug that unexpectedly resets the speaker configuration.\n\n- Prevents an issue during installation on Windows 7/Vista that may result in low volume when certain enhancements are enabled.\n\n- Implements Hardware CMSS Headphone by using a workaround.\n\n- Updates all InstallShield setup scripts to support Windows 7.\n- Fixes installation INI to properly install applications depending on the detected OS.\n- Removes COM workaround for Equalizer, fixed by Creative.\n- Adds workaround to a memory corruption issue preventing Equalizer from starting on Windows 7/Vista.\n- Updates shared modules, responsiveness on certain applications is improved.\n- Enables CMSS2 and Stereo Surround.\n- Fixes 32-bit ASIO not working on Windows 7 x64.\n- Fixes Encoder not available on Windows 7 x64 (related to fix above).\n- Sets default speaker setting to 5.1 to properly reset configs to their defaults during install (fixes Bass and Treble leves not set to 50% on Windows 7 / Vista). \n\n \n\n \n\n \n\nUndocumented fixes by Creative (not listed in the release notes):\n\n \n\n- Fixes the 6.1 speaker configuration is incorrectly available on Windows 7 64-bit (documented).\n\n- Fixes the Enable Dolby Digital Live checkbox not staying checked when Audio Console is closed.\n\n- Fixes Equalizer Out of Memory error.\n- Fixes Equalizer settings being lost on Windows 7 / Vista when speaker configuration is changed.\n- Fixes low volume on Windows 7 / Vista when default format is set to anything higher than 16-bit, 48kHz.\n- Fixes MIDI instruments in Melodic Pool not playing when speaker setting is higher than 2.1 speakers.\n- Restores missing Microphone option in Surround Mixer (documented).\n- Fixes Microphone mute, volume and +20db boost controls.\n\n \n\n \n\n \n\nRelease Notes:\n\n \n\n \n\nWindows Security warning during driver installation\n\n \n\nWhen prompted with: &quot;Windows can't verify the publisher of this driver software&quot;, choose &quot;Install this driver software anyway&quot;.\n\n \n\n \n\nOpenAL 2D benchmark in RightMark 3DSound crashes your system\n\n \n\nDue to a driver bug, your system will crash if you run the OpenAL 2D benchmark using 63 buffers. No problem With 62 or fewer buffers. OpenAL 3D and OpenAL 3D + EAX benchmarks are not affected.\n\n \n\nDetails: DRIVER_IRQL_NOT_LESS_OR_EQUAL (0x000000D1) - ctoss2k.sys\n\n \n\n \n\n \n\nSystem crashes when shutting down or restarting Windows if Encoder is enabled \n\n \n\nDue to a driver bug, your system will crash if you try to shutdown or restart Windows with Encoder enabled.\n\n \n\nDetails: SYSTEM_SERVICE_EXCEPTION (0x0000003B) - ha10kx2k.sys\n\n \n\n \n\nThere is no DirectSound hardware acceleration on Windows XP 64-bit (x64)\n\n \n\nThe Audigy driver does not support 64-bit addressing, disabling the DirectSound hardware acceleration and causing multichannel sound to be played only in the stereo channels (front left/right).\n\n \n\nWorkarounds:\n\n- install the 32-bit (x86) version of Windows XP.\n- limit to less than 4GB the amount of RAM available to Windows.\n- enable the &quot;Memory Hole&quot; setting in the BIOS Setup, if your motherboard supports it.\n\n \n\n \n\nMicrophone issues on Windows 7/Vista 64-bit (x64) with 4GB of RAM or more\n\n \n\nAudigy driver does not support 64-bit addressing, resulting in random issues with the Microphone (static, robotic or distorted voice, white noise).\n\n \n\nWorkarounds:\n\n- install the 32-bit (x86) version of Windows\n\n- limit the RAM available to Windows to less than 4GB\n\n- enable Memore Hole in BIOS Setup, if your motherboard supports the setting\n\n \n\n \n\nMediaSource DVD-Audio Player system requirements\n\n \n\n- 32-bit edition of Windows 7 / Vista / XP\n\n- any Audigy 2, Audigy 2 ZS or Audigy 4 card\n\n \n\n \n\nBuilt-in Decoder on Windows 7 / Vista (requires Service Pack 1)\n\n \n\nTo use the built-in decoder, make sure it is enabled in Audio Console.\n\n \n\nSelect &quot;SPDIF Out (Creative SB Audigy (WDM))&quot; as the output device of your player and then configure the AC3/DTS filter to send the stream through SPDIF.\n\n \n\nWhen you restart your computer, the Tone settings (Bass and Treble) are not applied.\n\n \n\nJust readjust one of the controls one time per boot.\n\n \n\n \n\nAdvanced EQ and Special FX not available on Windows 7 / Vista\n\n \n\nThese presets don't work on Windows 7 / Vista.\n\n \n\n \n\nThere is no sound in games with OpenAL support on Windows XP\n\n \n\nDisable Advanced EQ and Special FX selecting &quot;No effect&quot; before running the game or program.\n\n \n\n \n\nEqualizer settings are lost\n\n \n\nWhen you run a game with OpenAL support or using Creative ALchemy, the Equalizer settings are lost.\n\n \n\nJust run Equalizer and the saved setting is loaded automatically.\n\n \n\n \n\nTone settings are reset when speaker configuration is changed\n\n \n\nBass and treble settings are reset when speaker configuration is changed.\n\n \n\n \n\nDTS Encoder Switcher\n\n \n\nThe Encoder Switcher is now part of Audio Console.\n\n \n\nA shortcut is created in the Programs -&gt; Creative folder in Start Menu.\n\n \n\nFor additional info, read thoroughly the ReadMe.txt file included in the EncSwitcher folder where you extracted the Support Pack.\n\n \n\n \n\nHardware CMSS Headphone\n\n \n\nTo use the hardware CMSS you need to select &quot;Disable all enhancements&quot; in the &quot;Enhancements&quot; tab on:\n\nPlayback Devices -&gt; Speaker Properties\n\n \n\nNow check the Speaker configuration in &quot;Playback devices&quot;.\n\n \n\nIf it is Stereo, run Audio Console and change it to 4.1, 5.1 or 7.1 and only after that change it to Headphones.\n\n \n\nThis procedure ensures that CMSS(1) will work after a Windows restart, otherwise only CMSS2 will work.\n\n \n\n \n\nMicrosoft Audio Home Theater Effects\n\n \n\nThis driver adds the following audio effects, which are available depending on the current speaker configuration:\n\n \n\n- Bass Management\n- Speaker Fill\n- Room Correction\n- Loudness Equalization\n- Bass Boost\n- Virtual Surround\n- Low Frequency Protection\n\n \n\nSome effects are also available for the &quot;SPDIF Out&quot; device.\n\n \n\nSome Microsoft effects have priority over Creative CMSS effects and will disable the later.\n \n\n \n\nMIDI Device Configuration Utility for Windows 7 / Vista\n\n \n\nUse this utility to change the MIDI playback device for 32-bit and 64-bit applications.\n\n \n\n \n\n \n\n \n\nDownload:\n\n \n\nFilename: Audigy_SupportPack_3_6.exe\n\nFile size: 60.1 MB \n\nCRC32 hash: CD6B0A9B\n\nSHA-1 hash: 3DCF4B11A668363F704A805AD3F2F25405C9BF44\n\n \n\nTo verify the file hashes, I recommend HashTab.\n\n \n\nAll files are property of Creative Technology Ltd, unless otherwise noted.\n","torrent":{"xt":"urn:btih:ad6cf4735d87d864f8fa03eb51e420799da1324f","amp;dn":"Audigy+Support+Pack+3.6+by+daniel_k","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad6cf4735d87d864f8fa03eb51e420799da1324f","infoHashBuffer":{"type":"Buffer","data":[173,108,244,115,93,135,216,100,248,250,3,235,81,228,32,121,157,161,50,79]},"announce":[],"urlList":[]}}