{"title":"We Are The World For Hati","uid":5380639,"size":276884756,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:ad8affcbdfaeb3d3958ab9003addedda47f5f1d0&amp;dn=We+Are+The+World+For+Hati&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"2mean2die","files":1,"time":1266724318,"description":"A Re-creation of We Are The World\n\n Recorded on February 1st, 2010, in the same studio as the original 25 years earlier (Henson Recording Studios, formerly A&amp;M Recording Studios) &quot;We Are The World 25 For Haiti&quot;, in which Jones and Richie serve as executive producers and producers, was created in collaboration with executive producers Wyclef Jean, Randy Phillips and Peter Tortorici; producers Humberto Gattica and RedOne; and co-producers Rickey Minor, Mervyn Warren and Patti Austin to benefit the Haitian earthquake relief efforts and the rebuilding of Haiti.\n\nAcademy Award-winning writer-director Paul Haggis (Crash, Million Dollar Baby), whose own personal efforts as well as those of Artists for Peace and Justice have already saved countless lives in Haiti, filmed the private recording session to create the accompanying video and behind-the-scenes production, and serves as Film Director and as an Executive Producer with Jones, Richie, Jean, Phillips and Tortorici.\n\nThe 25th Anniversary recording features over 80 artists and performers. The recording of We Are The World 25 For Haiti embodied the same enthusiasm, sense of purpose and generosity as the original recording 25 years ago. Every one of the artists who participated, regardless of genre or generation, walked into the room with their hearts and souls completely open to coming together to help the people of Haiti.","torrent":{"xt":"urn:btih:ad8affcbdfaeb3d3958ab9003addedda47f5f1d0","amp;dn":"We+Are+The+World+For+Hati","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad8affcbdfaeb3d3958ab9003addedda47f5f1d0","infoHashBuffer":{"type":"Buffer","data":[173,138,255,203,223,174,179,211,149,138,185,0,58,221,237,218,71,245,241,208]},"announce":[],"urlList":[]}}