{"title":"Ewan McGregor &amp; Renee Zellweger - Here's To Love  (2nafish)","uid":5378755,"size":131565572,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:aebc8e5dec83a0d518f1b4ccdd2dc1de4c326461&amp;dn=Ewan+McGregor+%26+Renee+Zellweger+-+Here%5C%27s+To+Love++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1266624263,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nEwan McGregor &amp; Renee Zellweger - Here's To Love (Soundtrack: Down With Love)(2nafish)\n\n\nNote: This video is a &quot;Movies &amp; Music&quot; video so it has 2 logos.\n\n\nDown with Love is a 2003 romantic comedy film directed by Peyton Reed and written by Eve Ahlert and Dennis Drake, and starring RenÃƒÂ©e Zellweger and Ewan McGregor. It is a pastiche of the 'sex comedies' of the early 1960s starring Doris Day and Rock Hudson, such as Pillow Talk and Lover Come Back. The film also featured David Hyde Pierce, Sarah Paulson, Rachel Dratch and Jeri Ryan in supporting roles. Tony Randall, who was frequently featured in Day-Hudson films, appears in a small role as the owner of Novak's publishing house. It went on to be his final performance. The film was released in the United States on 9 May 2003.\n\nTelling the story of a woman who advocates female independence in combat with a lothario, the plot reflects the attitudes and behaviour of the early pre-sexual revolution 1960s but has an anachronistic conclusion driven by more modern, post-feminist ideas and attitudes.\n\nThe film's title comes from the song &quot;Down with Love&quot; as sung by Judy Garland, who is seen singing it on The Ed Sullivan Show in one scene.\n\nThe song &quot;Here's to Love&quot; sung by Zellweger and McGregor during the closing credits (and in its entirety on the DVD release as a special feature) was a last-minute addition to the film. Songwriters Marc Shaiman and Scott Wittman appear in the number as the bartender and the pianist. According to the DVD commentary, it was added at the suggestion of Ewan McGregor, who pointed out the opportunity the filmmakers had to unite the stars of two recently popular musical films (his Moulin Rouge! and Zellweger's Chicago).\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:aebc8e5dec83a0d518f1b4ccdd2dc1de4c326461","amp;dn":"Ewan+McGregor+%26+Renee+Zellweger+-+Here%5C%27s+To+Love++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aebc8e5dec83a0d518f1b4ccdd2dc1de4c326461","infoHashBuffer":{"type":"Buffer","data":[174,188,142,93,236,131,160,213,24,241,180,204,221,45,193,222,76,50,100,97]},"announce":[],"urlList":[]}}