{"title":"Life Episodes 1&amp;2: The Challenges of Life and Reptiles and Amphi","uid":5452638,"size":920125917,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:afbba18e1a3efcfc3b887f6d25714d5a5a75f97f&amp;dn=Life+Episodes+1%262%3A+The+Challenges+of+Life+and+Reptiles+and+Amphi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"zoundieP","files":2,"time":1269236374,"description":"David Attenborough's legendary BBC crew explains and shows wildlife all over planet earth in 10 episodes. The first is an overview the challenges facing life, the others are dedicated to hunting, the deep sea and various major evolutionary groups of creatures: plants, primates and other large sections of other vertebrates and invertebrates.\n\nEpisode 1:David Attenborough shows us how some animals have evolved new hunting, mating and parental techniques to help them survive the challenges of life.\nEpisode 2:Reptilians survive from the age of the Saurians, but if many look Ancient that's because their early and sometimes relatively recent adaptations to widely varied conditions worldwide still work admirably. Examples include lizards like the giant Komodo dragon, still top-dog on his Indonesian island, the feared crocodilian hunters, color-changing chameleons and snake species fitted for most (warm) ecosystems. The same goes for amphibians, including numerous specialized (tree) frogs and toads. Both groups are cold-blooded, hence vulnerable while warming up.","torrent":{"xt":"urn:btih:afbba18e1a3efcfc3b887f6d25714d5a5a75f97f","amp;dn":"Life+Episodes+1%262%3A+The+Challenges+of+Life+and+Reptiles+and+Amphi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"afbba18e1a3efcfc3b887f6d25714d5a5a75f97f","infoHashBuffer":{"type":"Buffer","data":[175,187,161,142,26,62,252,252,59,136,127,109,37,113,77,90,90,117,249,127]},"announce":[],"urlList":[]}}