{"title":"SnapFlow 1.0.1","uid":5262619,"size":10513849,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:b0c2d1431b13f1eb9fcf114271405a7182fe61d8&amp;dn=SnapFlow+1.0.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kodenho","files":-1,"time":1262787409,"description":"SnapFlow is an innovative Mac OS X Leopard application to select great shots from any video files (HD, SD, Quicktime, MPEG, AVCHD), compare similar shots, enhance images, and deinterlace in super high quality.\n\nSnapFlow lets you use your videos as a source of high quality images. With the rise of HD camcorders, you might find yourself using an HD camcorder more often than you use your digital camera. Nevertheless, they are countless situations where a still image is more appropriate than a video. Extracting great shots from this footage is therefore a great way to share these moments you recorded.\n\nWith its easy-to-use interface, the user of SnapFlow can:\n\n    * select the best shots and collect them in albums including smart albums,\n    * apply pre-defined image enhancing workflows (image filters),\n    * generate documents such as DVD covers, posters\n    * export the best shots in bulk, in any image format, with optional metadata,\n    * keep track of the selected shots and their associated videos using projects.\n\nSnapFlow is the result of a collaboration with photojournalists as well as video professionnals who manipulate digital stills extracted from raw HD footage on a regular basis. SnapFlow both simplifies the selection process and bulk export, while organizing all the media in a very flexible Project.\n\nMore info: http://www.macupdate.com/info.php/id/31211/snapflow","torrent":{"xt":"urn:btih:b0c2d1431b13f1eb9fcf114271405a7182fe61d8","amp;dn":"SnapFlow+1.0.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0c2d1431b13f1eb9fcf114271405a7182fe61d8","infoHashBuffer":{"type":"Buffer","data":[176,194,209,67,27,19,241,235,159,207,17,66,113,64,90,113,130,254,97,216]},"announce":[],"urlList":[]}}