{"title":"Janet Jackson - If  (2nafish)","uid":5406105,"size":191596548,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b156aae44c74c00ed67567bb4041d860061308b5&amp;dn=Janet+Jackson+-+If++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1267600994,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;If&quot; is a song by American singer Janet Jackson from her fifth studio album, janet. (1993). Written and produced by Jackson and Jimmy Jam and Terry Lewis, it was released as the album's second single in July 1993, and became Jackson's second top five hit from the janet. album.\n\nThe song's video, directed by Dominic Sena in June 1993, challenged notions of culture and sexuality in a highly stylised and imaginative presentation with a theme of voyeurism. The video is set in an exclusive club in Asia, where entrance can only be gained via the password &quot;if.&quot; Inside the club, Jackson performs suggestively with dancers amongst androgynous and polysexual characters.\n\nThe video won the 1994 MTV Video Music Award for Best Female Video. That same year it also won a Billboard Music Award for Dance Clip of the Year. Parts of the video were edited out for general release. The video is featured on Jackson's 2004 video compilation From janet. to Damita Jo: The Videos. A longer alternate version of the video, the &quot;All Dance Version&quot;, which focuses on Jackson's dance performance, was exclusively released on the 1994 VHS janet., but could later be found onand on the re-release of 2001's All for You.\n\n&quot;If&quot; peaked at number four on the Billboard Hot 100 and number one on the Hot Dance Club Play chart. It attained moderate peak positions across Europe.\n\n&quot;If&quot; deals with a female narrator's fantasies of being someone's girlfriend. The track contains a sample from Diana Ross &amp; the Supremes' 1969 song &quot;Someday We'll Be Together&quot;, and is built on a heavy metal guitar riff heard throughout the song. The combination of heavy hip hop/new jack swing beats and electric guitar was a relative departure in sound for Jackson.\n\nJackson performed the song as a medley with &quot;That's the Way Love Goes&quot; at the 1993 MTV Video Music Awards; the audio recording of which appears on the limited edition double disc edition of janet. A remix of &quot;If&quot; entitled Brothers in Rhythm House Mix appears on Jackson's 1995 remix album janet. Remixed.\n\nThe single contains a B-side called &quot;One More Chance&quot;, a cover of a song her brother Randy wrote, produced, and performed for The Jacksons' 1984 Victory album.\n\nJackson has performed the song on all of her tours, including the janet. Tour, The Velvet Rope Tour, All for You Tour, and Rock Witchu Tour.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:b156aae44c74c00ed67567bb4041d860061308b5","amp;dn":"Janet+Jackson+-+If++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b156aae44c74c00ed67567bb4041d860061308b5","infoHashBuffer":{"type":"Buffer","data":[177,86,170,228,76,116,192,14,214,117,103,187,64,65,216,96,6,19,8,181]},"announce":[],"urlList":[]}}