{"title":"Corbin Fisher - - - Fucking Hayden ((MictrmbL))","uid":5254860,"size":311224560,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:b1a8c55225069605cc036fdd90346deacf339442&amp;dn=Corbin+Fisher+-+-+-+Fucking+Hayden+%28%28MictrmbL%29%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mictrmbl","files":47,"time":1262514255,"description":"From the vaults of Corbin Fisher:\n\nWhen Hayden had his first ever experience with a guy, I knew that the chances of seeing him go even further had become pretty good! Although he'd held out from trying anything at all with another guy for quite some time, he finally agreed to give fucking a guy a shot and did precisely that with Lucas. Not only did he clearly enjoy the experience, but it was some really hot sex at that! He had himself a great time, and even Lucas ended up having one of this most intense orgasms as Hayden's dick was deep in his ass!\n\nHayden is not only a good looking, muscular young man but also a confident and mature one. When he realized just how much fun fucking a guy could be, convincing him to try out getting fucked wasn't too hard - all this despite the fact that he'd held out from doing any guy/guy action at all for the longest time! I think that as he saw just how much Lucas enjoyed it when he fucked him and just how powerful Lucas' orgasm was that time, an almost intellectual curiosity about how it must feel popped up. Just as his pairing with Lucas ensured his first topping experience would be a fun one, I paired him up with Dawson for his first ever shot at getting fucked in order to make sure he had a blast here, as well!\n\nAnd boy does he ever have a blast here! Indeed, both he and Dawson have themselves quite a fun time! Dawson gives Hayden the royal treatment to start things off, pausing while he strips him down to give just about every inch of his body some attention with his tongue, including Hayden's feet and cock. It's not long before Hayden is rock hard and clearly turned on by everything Dawson is doing. Seeing Hayden twitch and gasp as Dawson sucks his cock made that pretty obvious!\n\nAfter some hot frottage, you can tell both of these guys are ready for the fucking to start - Dawson because he's always eager to get his dick into a hot hole and Hayden because he's so turned on at this point and likely figuring that now is a better time than any to have a dick in his ass for the very first time!","torrent":{"xt":"urn:btih:b1a8c55225069605cc036fdd90346deacf339442","amp;dn":"Corbin+Fisher+-+-+-+Fucking+Hayden+%28%28MictrmbL%29%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1a8c55225069605cc036fdd90346deacf339442","infoHashBuffer":{"type":"Buffer","data":[177,168,197,82,37,6,150,5,204,3,111,221,144,52,109,234,207,51,148,66]},"announce":[],"urlList":[]}}