{"title":"Pootie Tang DVDRip XviD AC3 [5.1].avi","uid":5456442,"size":921942016,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b292ea39401adbf51a28bd4478c4cf651c7e2aa2&amp;dn=Pootie+Tang+DVDRip+XviD+AC3+%5B5.1%5D.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Pharos2001","files":1,"time":1269341582,"description":"Pootie Tang DVDRip XviD AC3 [5.1]\n\nPootie Tang is an American comedy film written and directed by Louis C.K. and released in 2001. The film was adapted from a comedy sketch which first appeared on The Chris Rock Show. The character Pootie Tang is a satire of the stereotyped characters who appeared in old blaxploitation films. His speech, which vaguely resembles pidgin, is mostly unintelligible to the audience, but the other characters in the film have no problem understanding him.\n\nPootie Tang, born in &quot;a small city outside of Gary, Indiana&quot;, is portrayed as a ladies' man who is &quot;too cool for words&quot; even as a young child. His life is marked by the deaths of his mother Momma Dee and, shortly thereafter, his father Daddy Tang, the latter of whom dies from complications of a freak attack by a gorilla while at work. Just before Daddy Tang's death, Pootie inherits his father's belt and is told that he can &quot;whoop anyone's ass with just that belt.&quot;\n\nAs a young adult, Pootie Tang rises to fame and becomes well-known for a variety of reasons. He sings in night clubs, stars in public service announcements for children, produces top-of-the-charts music hits, and generally defeats wrongdoers with the power of his belt.\n\nDick Lecter, the CEO of multi-industrial conglomerate LecterCorp, learns of Pootie Tang's positive influence on society - and his negative influence on Lecter's bottom line. Lecter encourages his right-hand lady, Ireenie, to seduce Pootie Tang into signing an agreement with LecterCorp that would stop Pootie Tang's influence on America's children.\n\nPootie Tang falls for Ireenie's tricks and subsequently falls apart. His status as pop culture icon is destroyed, and he engages on a quest to &quot;find [him]self, blah, blah, blah.&quot; This journey is encouraged by Biggie Shortie, who promises to wait for Pootie to return to her and to the rest of society. Pootie moves to a farm for a while. After his single corn stalk dies, he has a vision of Daddy Tang and Momma Dee. Daddy Tang reveals that there is nothing special about Pootie's belt; instead, Pootie must fight evil with the goodness that is inside him. Pootie realizes he must move back to the city and fight crime once again.\n\nPootie Tang returns to the city just as Dick Lecter is unveiling the first of his new restaurant chain, &quot;Pootie's Bad Time Burgers.&quot; At a small news conference, Pootie confronts Lecter only to discover that Lecter has amassed dozens of &quot;Pootie-alikes&quot; who will spread the message of LecterCorp around the nation. Pootie Tang, with the help of Biggie Shortie, defeats all of these henchmen and Lecter himself. Good triumphs over evil once again, and Biggie Shortie finally gets her man: she and Pootie Tang plan to get married now that Pootie is back.\n\nACodec:\t\tAC3 5.1 DD\nVCodec:\t\tXviD 2pass mpeg\nSize:\t\t642Mb+237Mb [5.1DD) 642+58Mb [mp3 128] (you will have to recode AC3 5.1 to mp3 128 for exactly 700Mb)\nDuration:\t1:18:02\nAR/(W*H):\t1:1.78 / (720*400) FPS:25\n\n\nHQ encoding! Pls help seed.","torrent":{"xt":"urn:btih:b292ea39401adbf51a28bd4478c4cf651c7e2aa2","amp;dn":"Pootie+Tang+DVDRip+XviD+AC3+%5B5.1%5D.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b292ea39401adbf51a28bd4478c4cf651c7e2aa2","infoHashBuffer":{"type":"Buffer","data":[178,146,234,57,64,26,219,245,26,40,189,68,120,196,207,101,28,126,42,162]},"announce":[],"urlList":[]}}