{"title":"Marine-2.2009.DVDrip[vice]","uid":5232769,"size":462442704,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b3c92c211cf88a003f8ae929b512aa0cc63cff98&amp;dn=Marine-2.2009.DVDrip%5Bvice%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"vicerock","files":6,"time":1261402039,"description":"MARINE 2 2009 DVDrip\n\nVIDEO CODEC Xvid\nformat Avi\nsize/res 480x234[wide screen]\nrun-time 01:35:12\nvideo bitrate 512\nvideo framerate 25\nXvid profile asp5\n\nAUDIO CODEC mp3\naudio bitrate 128\nsample rate 44100\na/v sync basic\n\n&quot;The Marine 2&quot; is a follow up in name only to the 2006, John Cena vehicle, &quot;The Marine.&quot; This time, fellow WWE wrestler Ted DiBiase Jr (the son of legend The Million Dollar Man Ted DiBiase) steps into the shoes of the title role as Joe. DiBiase Jr (credited as and referred to from here on out as simply, DiBiase) is an extremely intriguing casting choice as at the time he was a rookie, mid-card wrestler. It turns out, the role was originally intended for wrestler Randy Orton, who is more on the level of Cena in terms of star power in the WWE. Orton suffered an unfortunate broken collarbone and was replaced at the last minute by DiBiase. In many ways, DiBiase's presence is a welcome change from Orton, as the latter has a tendency to mumble and not clearly enunciate when delivering weekly promos.\n\nWhile DiBiase delivers his lines very clearly, he also delivers them with zero emotion. DiBiase is one of the most wooden action stars I've seen, even by direct to video standards. Having to sit through 90-minutes of DiBiase spewing the most clichÃƒÂ©d dialogue either with a flat affect, while grinning, or occasionally gritting his teeth, the limited range of Steven Segal becomes greatly appreciated. To DiBiase's credit, he does try to act at one point in the film, but resorts to the patented Christian Bale, &quot;gravel voice&quot; for two lines, before returning to a more comfortable balsa like delivery.\n\nHe's done no favors however, by the film's script, which takes 20 minutes to set up. After the standard opening action scene to show our hero's talents, Joe and his girlfriend travel to a lavish, exotic island resort, of unspecified Asian origin. There the two meet Church, played by Michael Rooker chomping a cigar in a fashion that would make George Peppard jealous. Church could have easily been renamed plot device, because that's all he is. The script not so subtlety sends Joe and his gal on a private boat tour of the island, where Church explains his background in the army as well as a hidden passage to the island resort. This couple with his side job of pyrotechnician, screams to the audience that our hero will assuredly find this information helpful later in the film.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1266027/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1266027/&lt;/a&gt;\n\nPLEASE SEED AND ENJOY THANKS\n\nscreen shots\n &lt;a href=&quot;\nhttp://img109.imageshack.us/img109/6492/marine22009dvdripviceav.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img109.imageshack.us/img109/6492/marine22009dvdripviceav.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:b3c92c211cf88a003f8ae929b512aa0cc63cff98","amp;dn":"Marine-2.2009.DVDrip%5Bvice%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3c92c211cf88a003f8ae929b512aa0cc63cff98","infoHashBuffer":{"type":"Buffer","data":[179,201,44,33,28,248,138,0,63,138,233,41,181,18,170,12,198,60,255,152]},"announce":[],"urlList":[]}}