{"title":"The.Best.Of.Lexi.Belle.2.DISC1.XXX.DVDRiP.XviD-DivXfacTory","uid":5451766,"size":732753340,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:b3e03d50b0b0e7c58df8b887b0d9437f9f2a2cb3&amp;dn=The.Best.Of.Lexi.Belle.2.DISC1.XXX.DVDRiP.XviD-DivXfacTory&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TvTeam","files":52,"time":1269207583,"description":" &lt;a href=&quot;http://www.torrentday.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.torrentday.com&lt;/a&gt; - The Hottest Scene xXx on the Web.\n\n &lt;a href=&quot;\nhttp://www.torrentday.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.torrentday.com&lt;/a&gt; :  Your Key To The Scene.\n\n\nEnjoy =)\n\n...................................NFO:....................................\n\n.\n\n\n\n\n\n\n                                      \n                                                     \n                                                      \n                                                        \n                                                      \n  f3!                                               \n  cRO                                         \n                                           \n                                   \n                                   \n                       \n                            \n                           \n                              \n                       \n                            \n                                  \n                            \n                      \n                          \n                   \n                            \n                            \n                             \n                              \n                              \n                          \n                   \n                   \n                    \n                  \n                       \n                   \n               \n                    \n                                                  \n            \n                               \n                                       \n                                        \n                                 \n                                    \n                                      \n                                             \n         \n                  \n                           \n                              \n                                 \n                            \n                               \n                                  \n                       \n                           \n                                      \n                                    \n                                    \n                                  \n                                   \n                                     \n                                   \n                                     \n                               \n                                  \n                                    \n                               \n                                \n                                \n                                     \n                                      \n                               \n                                 \n                                    \n                                    \n                                   \n                                     \n                                           \n                                        \n                                       \n                                    \n                                    \n                                 \n                          \n                   \n                \n                 \n                  \n                \n                     \n                    \n                  \n            \n       \n        \n         \n          \n         \n        \n     \n     \n     \n         \n        \n       \n      \n       \n         \n              \n                        \n                                  \n                                   \n                         \n                                   \n                                       \n                                    \n                                            \n                                        \n                                     \n                                     \n                                      \n                                                \n                                                       \n                                      \n                                         \n                                      \n                                 \n                               \n                               \n                                \n                                     \n                                              \n\n\n        D i v X f a c T o r y      p r o u d l y       P r e s e n t s\n\n\n                                           \n                                         \n                                             \n                                            \n                            \n                                           \n                                        \n                           \n                                \n                         \n                                                               \n                                       \n                                    \n                            \n                                             \n                                                   \n                                                     \n                                                    \n                                                                \n                                                                    \n                                                                    \n                                                                    \n    The.Best.Of.Lexi.Belle.2.DISC1.XXX.DVDRiP.XviD-DivXfacTory      \n                                                                    \n                                                                    \n                                                                  \n     RELEASE.DAtE : 21.03.2009      FORMAt..... : XviD            \n     PROd.StUdiO. : Evil Angel      RESOLUtiON. : 576x320         \n     DVD.RELEASE. : 26.02.2010      AUdiO...... : VBR MP3         \n     SiZE........ : 1CD             SUPPLiER... : DivXfacTory     \n     GENRE....... : All Sex         DiSk AMOUNt : CD1 49x15  MB   \n                                                                    \n                                                                    \n                                                                    \n             \n                                                                  \n                                                                  \n                                                          \n                                              \n                                      \n                            \n                                \n                              \n                              \n                                     \n                            \n                                   \n                                \n                                                  \n                                              \n                          \n                                                                  \n                                                                  \n                                                                    \n      Alexa Jordan, Belladonna, Jenna Haze, Lexi Belle,             \n      Monique Alexander, Roxy Deville                               \n                                                                    \n      &quot;Lexi Belle is one of my favorite sluts, and there            \n      will never be another one like her.&quot; That's director/         \n      porn icon Belladonna commenting on the fair-skinned,          \n      bubble-butted, preternaturally horny blonde cutie             \n      whose girly presence and vivacious lust have adorned          \n      so many Belladonna movies. Now Bella has crafted a            \n      sterling double-disc set collecting the sexiest of            \n      those moments; with the addition of two brand new             \n      scenes, The Best Of... Vol. 2: Lexi Belle encompasses         \n      the title starlet's wide variety of sexual charms.            \n      Pixieish in pigtails and cowboy boots, Lexi squeals           \n      and simpers as Seth Gamble fucks her mouth and pussy.         \n      Upon swallowing his cum she reveals that she cares            \n      only for his dick, but not his romantic interest; she         \n      hurries him out and turns to the reinforcement penises        \n      belonging to Mr. Pete and Mikey Butders. These dudes          \n      are not so romantic; they roughly fuck her, choking and       \n      spanking along the way. After they cum on her little,         \n      natural tits, the hard-boiled slut loses interest in          \n      them too, because all she cares about is cock. Pretty,        \n      blonde waif Monique Alexander joins raven-tressed Lexi        \n      Belle in an arty power-exchange scene with a nostalgic        \n      look and sound evocative of some indefinite era past.         \n      In a dominant role, Lexi releases bound and gagged            \n      Monique from a closet for a session of erotic torment.        \n      Lexi stings Monique with a crop, sits on her face, fucks      \n      her in all three holes with a strap-on and makes her          \n      suck the strap-on clean. In a scene for foot fetish fans,     \n      Lexi Belle wears a bumblebee costume and pours sticky         \n      honey all over her black-and-yellow-painted toenails.         \n      Her honey-dripping peds mash daisies before she offers        \n      them up to Mark Ashley to suck and worship. As she            \n      fellates his cock and he fucks her, the camera focuses        \n      on her pretty feet, and after he cums on her toes she         \n      licks 'em clean. Alexa Jordan has long, black hair, a         \n      dominant air and absolutely no patience for Lexi Belle's      \n      cutesy flirtation. But Alexa knows how to handle an           \n      attention whore: with a rough strap-on plowing. Lexi          \n      gets her panties stuffed into her mouth and Alexa's           \n      dong stuffed into her cunt. Lexi Belle and Roxy DeVille       \n      are rascally rabbits - throughout their girl-girl sex         \n      session, one or both of them wear gigantic, cartoonish        \n      rabbit masks and soft bunny paws. They finger each other,     \n      suck titties and rub out orgasms scissors-style on each       \n      other's thighs. With her toenails painted white, Lexi         \n      Belle teases the camera and foot fetish fans. She sucks       \n      her own toes, then offers them up to James Deen for           \n      sniffing. Their resulting suck-and-screw session is           \n      shot to emphasize her pretty feet and includes lots of        \n      toe sucking, even during the fucking. She gives him a         \n      foot-job and when he cums on her toes, she slurps 'em         \n      clean. When clouds ruin their sun-tanning plans, Lexi         \n      Belle and petite Jenna Haze wind up in a big bathtub to       \n      wash away the suntan lotion. The lost afternoon quickly       \n      evolves into an intimate moment, a very playful, very         \n      girly, very real lady lovemaking session. In the warm         \n      water they kiss, play with each other's hair and              \n      languidly lap pussy. Their pretty toes, butts and clits       \n      get plenty of lusty attention. Belladonna, her short hair     \n      black, joins Lexi Belle in a room full of red and purple      \n      balloons. They share serious lip sucking and full-on          \n      mouth kissing, hugging and breathless talk. Hungrily          \n      they finger and eat pussy - Bella's is hairy, Lexi's          \n      bald. The girls rub balloons sensually on each other's        \n      bodies and burst them with their toes. Mr. Pete, playing      \n      Lexi Belle's boyfriend, catches her sluttily dressed and      \n      ready to go out. She whines that he should trust her, but     \n      she's cheated before, so he takes control of her wayward      \n      holes right there in the kitchen. He forcefully fucks         \n      her mouth and, boning her cunt, chokes her to red-faced       \n      glory. She looks helplessly orgasmic getting nailed           \n      standing, doggie-style, and grinding down on his meat         \n      while perched on the kitchen island. After he jerks off       \n      on her face the incorrigible Lexi announces that she's        \n      still going out.                                              \n                                                                    \n                                                                    \n                                                                \n                                                      \n                                                     \n                                                   \n                                             \n                             \n                             \n                        \n                                       \n                                     \n                                                   \n                                              \n                                               \n                             \n                         \n                              \n                                          \n                                                      \n                                                              \n                                                                \n                Its a DivXfacTory - need we say more ??         \n                                                                \n                                                                \n                                                                \n                                                                \n                                                              \n                                                            \n                                                        \n                                                \n                            \n                                    \n                                        \n                       \n                                   \n                               \n                                                    \n                                        \n                                    \n                            \n                                                \n                                                        \n                                                            \n                                                              \n         if u don't know where to find us, u don't need to      \n         contact us                                             \n                                                                \n                                                                \n                                                                \n                                                                \n                                                              \n                                                            \n                                                        \n                                                \n                            \n                                    \n                                        \n                             \n                                     \n                                  \n                                                    \n                                        \n                                    \n                            \n                                                \n                                                        \n                                                            \n                                                              \n                                                                \n              PEEPSHOW, Fuqj0, HiV, Pr0nStarS, XCiTE, ORC       \n                                                                \n                                                                \n                                                                \n                                                                \n                                                              \n                                                          \n                                                    \n                                            \n                   2  0  0  9                \n                      \n                                                       \n                   ASCII for all of you              \n                         WANKERS.                    \n                 Production by              \n                                \n                    F U M         \n                                          \n                       OF                  \n                                                  \n              :: CHEMICAL  REACTION ::         \n                                      \n                                  \n                                 f3!\n                                            cRO","torrent":{"xt":"urn:btih:b3e03d50b0b0e7c58df8b887b0d9437f9f2a2cb3","amp;dn":"The.Best.Of.Lexi.Belle.2.DISC1.XXX.DVDRiP.XviD-DivXfacTory","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3e03d50b0b0e7c58df8b887b0d9437f9f2a2cb3","infoHashBuffer":{"type":"Buffer","data":[179,224,61,80,176,176,231,197,141,248,184,135,176,217,67,127,159,42,44,179]},"announce":[],"urlList":[]}}