{"title":"Windows XP Media Center [Genuine&amp;Activated]","uid":5382720,"size":727468337,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b416e0ea8845cd7945f197e5ecfc8d6d429c51c1&amp;dn=Windows+XP+Media+Center+%5BGenuine%26Activated%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Torrent_Meister","files":4,"time":1266791238,"description":"Ok, at the request of someone who downloads from me, here is part 1 of my Windows XP collection. This is Windows XP Media Centre 2002, fully activated and fully compliant with WGA checks and also Windows Updates. This file includes the following:\n\nWindows XP ISO Image File\n\nReadMe which contains some useful guidance and info\n\nPowerISO is also included, to allow you to burn the Windows XP image if you have no ISO software installed.\n\nShown below is the content of the ReadMe\n\n===================================================================================\n\nWindows XP Media Centre Edition 2002\n\nFAQ's\n\nIs this version of Windows XP activated?\n\nYES! 100%\n\nDoes this version of Windows XP work with Automatic Updates and Windows Genuine Advantage [WGA]?\n\nYes! 100%\n\nOk, great so what do i do with it now i've downloaded it?\n\nWell, simply use your favourite ISO burner, or install the copy of PowerISO i have provided with\nthe torrent, and slip in a CD-R/RW or a DVD-R/RW and burn the image. This disc will then be bootable.\n\nUmm ok well why won't my computer boot from the CD/DVD?\n\nCheck your BIOS! There should be an option somewhere something like &quot;Choose first boot Device&quot;, make\nsure that this option boots from your CD/ATAPI drive FIRST. Then when it asks you to press any key \nto boot from CD, just press any key to start Windows Setup.\n\nSo, i plan to install this on my computer, what features does this edition come with?\n\nWell, the features it comes with are:\n\n- .NET 1, 1SP1, and 2 are fully integrated and have been slipstreamed.\n\n- Service Pack 3 is also fully slipstreamed.\n\n- Windows Media Player 11 is installed by default\n\n- Internet Explorer 7 is also installed by default\n\n- No need to enter a product key, as that too is slipstreamed\n\n- Also comes with Windows Dancer and all of the extra Media Centre features.\n\n- x86 [32bit], so it is compatible with most software made for Windows\n\n- Includes the Royale theme for Media Centre\n\n\n===================================================================================\n\nAny questions, feel free to ask in the comments. If you like the torrent, feel free to rate or hit me up. Also, why not click my username to check out my other torrents.","torrent":{"xt":"urn:btih:b416e0ea8845cd7945f197e5ecfc8d6d429c51c1","amp;dn":"Windows+XP+Media+Center+%5BGenuine%26Activated%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b416e0ea8845cd7945f197e5ecfc8d6d429c51c1","infoHashBuffer":{"type":"Buffer","data":[180,22,224,234,136,69,205,121,69,241,151,229,236,252,141,109,66,156,81,193]},"announce":[],"urlList":[]}}