{"title":"Enya  Collection (Blueshiff)","uid":5396265,"size":1145463204,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b54268cf2337af3c46f328c25593aafc3d5f0fae&amp;dn=Enya++Collection+%28Blueshiff%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Blueshiff","files":290,"time":1267239852,"description":"Eithne, the fourth youngest of nine children, comes from the small village of Dore (Dobhar in Irish) in the Gweedore (Gaoth Dobhair) region of County Donegal in the northwest of the Republic of Ireland. She now lives in Killiney, a coastal district on the southern outskirts of Dublin The family is very musical and her parents played in a family dance band before settling down. Her father owns a local pub - Leo's tavern in Meenalech (min na Leice) - and her mother Baba taught music in the local school. In 1968, elder brothers Ciaran &amp; Pol, and uncles Padraigh &amp; Noel O Dugain, formed the band &quot;An Clan As Dobhar&quot; to perform traditional Irish music at festivals etc. Changing their name to Clannad, and recruiting sister Maire Brennan in 1973, the band have gone on to international success performing both their own and traditional material. They have recorded a number of albums. Enya joined Clannad in 1980 and, credited under her real name, provided keyboards and (mostly) backing vocals. She appears on their 1982 album &quot;Fuaim&quot;. It is often said that she also appeared on their 1980 album &quot;Crann Ull&quot; although she is not listed in the credits. In 1982, Clannad split with their long time manager and producer Nicky Ryan. Eithne, apparently frustrated with being left in the background, left at the same time and, in Ryan's belief that she had talent in her own right, moved to live with him and his wife Roma Ryan and develop her own musical career. In 1985, film producer David Puttnam commissioned Eithne to write music for his film The Frog Prince (1984/I) which was released in 1985. The Titles on The Frog Prince (1984/I) credit music to Enya Ni Bhraonain and the transition of Eithne to Enya had begun. In 1986, BBC-TV began work on a six part documentary series charting the history and continuing cultural influence of the Celts. Enya was signed to write and perform music for the series. &quot;The Celts&quot; (1987) was first shown in 1987 and a selection of its music released under the title &quot;Enya&quot;, giving the artist her first album, largely unnoticed at the time. Her 'big break' began in 1987 when she was signed by Rob Dickins, head of WEA Music UK, after he had heard and been entranced by the &quot;Enya&quot; album. WEA's backing made the recording of &quot;Watermark&quot; possible and the album was released in 1988. Although no singles were originally planned, it was the release &quot;Orinoco Flow&quot; (Sail Away) that brought Enya to public attention and resulted in an unexpected chart number one in several countries. She continued the success with her next albums &quot;shepherd Moons&quot; and &quot;The Celts&quot;...\n\n\n\nIMDB    &lt;a href=&quot; http://www.imdb.com/name/nm0258216&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/name/nm0258216&lt;/a&gt;\n\n\n\nFile Size..................1,06 GB\n\n\nBlueshiff\n\nEnjoy\n","torrent":{"xt":"urn:btih:b54268cf2337af3c46f328c25593aafc3d5f0fae","amp;dn":"Enya++Collection+%28Blueshiff%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b54268cf2337af3c46f328c25593aafc3d5f0fae","infoHashBuffer":{"type":"Buffer","data":[181,66,104,207,35,55,175,60,70,243,40,194,85,147,170,252,61,95,15,174]},"announce":[],"urlList":[]}}