{"title":"Fight Club(1999)DVDRip.AC3(ENG)-DROCK","uid":6311652,"size":733819608,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b66e3ece6ce159a7b0fc719c8eb29d71036afd31&amp;dn=Fight+Club%281999%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":-1,"time":1302562354,"description":"In this darkly comic drama, Edward Norton stars as a depressed young man (named in the credits only as &quot;Narrator&quot;) who has become a small cog in the world of big business. He doesn't like his work and gets no sense of reward from it, attempting instead to drown his sorrows by putting together the &quot;perfect&quot; apartment. He can't sleep and feels alienated from the world at large; he's become so desperate to relate to others that he's taken to visiting support groups for patients with terminal diseases so that he'll have people to talk to. One day on a business flight, he discovers Tyler Durden (Brad Pitt), a charming iconoclast who sells soap. Tyler doesn't put much stock in the materialistic world, and he believes that one can learn a great deal through pain, misfortune, and chaos. Tyler cheerfully challenges his new friend to a fight. Our Narrator finds that bare-knuckle brawling makes him feel more alive than he has in years, and soon the two become friends and roommates, meeting informally to fight once a week. As more men join in, the &quot;fight club&quot; becomes an underground sensation, even though it's a closely guarded secret among the participants. (First rule: Don't talk about fight club. Second rule: Don't talk about fight club.) But as our Narrator and Tyler bond through violence, a strange situation becomes more complicated when Tyler becomes involved with Marla (Helena Bonham Carter), whom our Narrator became infatuated with when they were both crashing the support-group circuit. Based on the novel by Chuck Palahniuk, Fight Club was directed by David Fincher, who previously directed Pitt in the thriller Seven. \n\nRipped with Handbrake.\n\nLength: 2 Hours 19 Minutes\n\nFile Type: MP4","torrent":{"xt":"urn:btih:b66e3ece6ce159a7b0fc719c8eb29d71036afd31","amp;dn":"Fight+Club%281999%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b66e3ece6ce159a7b0fc719c8eb29d71036afd31","infoHashBuffer":{"type":"Buffer","data":[182,110,62,206,108,225,89,167,176,252,113,156,142,178,157,113,3,106,253,49]},"announce":[],"urlList":[]}}