{"title":"Segundo - Maria Rita [EAC] [FLAC]","uid":5249992,"size":294465922,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b77cce4268117aad61cd4b89946f6af53d92629d&amp;dn=Segundo+-+Maria+Rita+%5BEAC%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Bizinho","files":-1,"time":1262293822,"description":"From All Music:\n\nMaria Rita took the MPB world by storm in 2003 with her debut album, winning all kinds of awards and crossing over abroad in light of her mammoth success. The beautiful and beautiful-sounding young lady is the daughter of one of Brazil's most (if not the most) legendary vocalists, the late Elis Regina, and if that alone weren't enough to make her a star in waiting, her father is CÃƒÂ©sar Camargo Mariano, one of the country's top arrangers, producers, and pianists, and her namesake is Rita Lee, yet another MPB legend. Add to that a close musical partnership with Milton Nascimento, who penned &quot;A Festa,&quot; the opening track of her debut album, and you can see why the MPB world was eagerly awaiting her recording debut.\n\nBorn September 19, 1977, in SÃƒÂ£o Paulo, Rita began singing professionally at age 24. Her debut album, Maria Rita, released domestically in late 2003 and internationally in 2004, spawned two big hits, the aforementioned &quot;A Festa&quot; and &quot;Cara Valente.&quot; On the heels of the album's blockbuster success -- both critical and commercial -- Rita released a similarly self-titled DVD that captures her 2004 live performance at Bourbon Street in SÃƒÂ£o Paulo. Among the awards won by Rita in 2004 were Latin Grammys for Best New Artist and Best MPB Album. Rita's second album, Segundo (2005), was even more popular than her first (selling over 700,000 copies in Brazil alone), if not as critically acclaimed. A live DVD, Segundo ao Vivo, followed in 2006. Rita's third album, Samba Meu (2007), was a change of style: a collection of acoustic sambas.","torrent":{"xt":"urn:btih:b77cce4268117aad61cd4b89946f6af53d92629d","amp;dn":"Segundo+-+Maria+Rita+%5BEAC%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b77cce4268117aad61cd4b89946f6af53d92629d","infoHashBuffer":{"type":"Buffer","data":[183,124,206,66,104,17,122,173,97,205,75,137,148,111,106,245,61,146,98,157]},"announce":[],"urlList":[]}}