{"title":"Mariah Carey - I Want To Know What Love Is  (2nafish)","uid":5230168,"size":154841092,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:ba0b8a18e2e4c3d135aa47d8068cbb3bd8cb42cf&amp;dn=Mariah+Carey+-+I+Want+To+Know+What+Love+Is++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":1,"time":1261301826,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 4000 Kb/s\nAudio: Linear PCM, 48000 Hz, Stereo, 1536 kbps\n\n\nThis video has no logo.\n\n\n&quot;I Want to Know What Love Is&quot; is a 1984 power ballad recorded by the British-American rock band Foreigner. The song hit #1 in both the UK and the U.S. and is the band's most successful single. It remains one of the band's best known songs and most enduring radio hits, charting in the top 25 in 2000, 2001 and 2002 on the Billboard Hot Adult Contemporary Recurrents chart.\n\n&quot;I Want to Know What Love Is&quot; was covered by American singer Mariah Carey and released as the second single from her twelfth studio album, Memoirs of an Imperfect Angel (2009). The single, produced by Carey, C. &quot;Tricky&quot; Stewart and James &quot;Big Jim&quot; Wright, was sent to European radio stations on August 28 and was released in the United States for digital download September 15, 2009. Mick Jones said of her version: &quot;I think she's actually retained the integrity of the song. You know, the arrangement is very similar to the original. They haven't tampered with the song too much. She's captured a certain emotional thing, a feeling.&quot;\n\nCarey filmed a music video for &quot;I Want to Know What Love Is&quot; in September 2009 in New York City. The director for the video is Hype Williams. The video premiered on Mariah's official website on November 13, 2009. The video shows Carey singing in a stadium whilst shots are intercut with people who have had tough times in their past (i.e. terminal illness etc) who get quite emotional watching her perform. A gospel choir appears at the end of the video singing along with Carey at the centre of the stadium. In the video, Mariah adopts her signature curly hairstyle that was present in the initial stages of her career from 1990 - 1994, maintaining the 'Memoirs' theme of the new album.\n\n&quot;I Want to Know What Love Is&quot; debuted on the Hot 100 at #66 for the week ending October 3, 2009, eventually peaking at #60. The song also reached #1 on the Japanese airplay chart as well as #3 on the Japan Hot 100. The song has now reached the Top 10 on the U.S. Billboard Adult Contemporary Tracks chart, bringing Carey's total number of Top 10s on that chart to 20, one less than Celine Dion's record of 21. On the UK Singles Chart, the song debuted at #19 on the week ending November 29, becoming her highest debuting and peaking song since 2008's &quot;Touch My Body&quot;, which peaked at #5. The song has debuted at #6 in France selling 1,910 copies in its first week. It has also become the highest charting position for the song out of all the cover versions in France.\n\nMemoirs of an Imperfect Angel is the twelfth studio album by American R&amp;B recording artist Mariah Carey. Originally scheduled for release on August 25, 2009, the project was released on September 25, 2009, in the Netherlands and Poland through Universal Music, September 29 with Island Records in the US and was released November 23 with Mercury Records in the UK.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:ba0b8a18e2e4c3d135aa47d8068cbb3bd8cb42cf","amp;dn":"Mariah+Carey+-+I+Want+To+Know+What+Love+Is++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba0b8a18e2e4c3d135aa47d8068cbb3bd8cb42cf","infoHashBuffer":{"type":"Buffer","data":[186,11,138,24,226,228,195,209,53,170,71,216,6,140,187,59,216,203,66,207]},"announce":[],"urlList":[]}}