{"title":"Nero v9 Micro Edition","uid":5362242,"size":32747608,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:bb221427791eff43f00dc5343188a5a8d409de09&amp;dn=Nero+v9+Micro+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Erz0r","files":1,"time":1266106363,"description":"Nero 9 delivers a refurbished digital media suite that's still as comprehensive as they come, though now in a more polished wrapper. The installation file is massive and once Nero is on your machine, it consumes a hefty serving of memory. Considering all it can do, though, we can only complain so much.\n\nCD- and DVD-burning are still Nero's core, while shortcuts for burning and ripping CDs and DVDs are now accessible from the new StartSmart GUI, now adorned with an RSS reader. Authoring and burning high-definition CDs and DVDs are added features, and so is the ability to export video files made and edited with Nero toMySpace, and MyNero.\n\nNero 9 introduces RescueAgent, a tool to recover data from damaged disks, and a gaggle of Vista features, including a one-click desktop gadget for copying CDs.\n\nDespite the cosmetic alterations, Vista support, and enhancements, particularly to Nero Vision, the dramatic changes are slim. However, Nero's significantly faster application launch time and improved usability make the audio, video, photo, data, and home entertainment workhorse that lets you edit MP3s, capture and edit video, record and playback TV, create slide shows, back up data, convert audio files, check your hardware specs, and design disc covers with ease well worth a try.","torrent":{"xt":"urn:btih:bb221427791eff43f00dc5343188a5a8d409de09","amp;dn":"Nero+v9+Micro+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb221427791eff43f00dc5343188a5a8d409de09","infoHashBuffer":{"type":"Buffer","data":[187,34,20,39,121,30,255,67,240,13,197,52,49,136,165,168,212,9,222,9]},"announce":[],"urlList":[]}}