{"title":"Destiny's Child - 8 Days Of Christmas  (2nafish)","uid":5201266,"size":127107076,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:bc56dc8a1d5aab1329f794c3fe73f961c2910de7&amp;dn=Destiny%5C%27s+Child+-+8+Days+Of+Christmas++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1260178333,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;8 Days of Christmas&quot; is the first holiday single from Destiny's Child. The single was only a promo release so it was not sold publicly.\n\nA video was filmed for &quot;8 Days of Christmas&quot; and was released in the winter of 2001. It was directed by Sanaa Hamri. All 3 members appear in Santa-like clothing at a toy store on a snowy day. Throughout the video the group shops for various gifts and in between cuts, BeyoncÃƒÂ© rides on a carousel. At the end of the video, many children begin rushing into the toy store where the group gives out gifts.\n\n8 Days of Christmas is a Christmas album by R&amp;B girl group Destiny's Child, released by Columbia Records in October 2001 in the United States. It debuted at number seventy-five on the U.S. Billboard 200 selling over 23,000 copies during its first week of release, and it eventually peaked at number thirty-four a few weeks later. It was certified gold by the RIAA in December 2001 for over 500,000 copies shipped in the United States.\n\nIn 2004, a re-issued version of the album was released, containing previously unreleased records.\n\nDestiny's Child was a Grammy-Award winning American R&amp;B girl group comprising lead singer BeyoncÃƒÂ© Knowles alongside Kelly Rowland and Michelle Williams. Formed in 1997 in Houston, Texas, Destiny's Child members began their musical endeavors in their pre-teens under the name Girls' Tyme, comprising Knowles, Rowland, LaTavia Roberson and LeToya Luckett. After years of performing underground, they signed to Columbia Records and changed their name. Destiny's Child was launched into mainstream recognition following the release of their best-selling second album, The Writing's on the Wall, which contained the number-one singles &quot;Bills, Bills, Bills&quot; and &quot;Say My Name&quot;.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:bc56dc8a1d5aab1329f794c3fe73f961c2910de7","amp;dn":"Destiny%5C%27s+Child+-+8+Days+Of+Christmas++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc56dc8a1d5aab1329f794c3fe73f961c2910de7","infoHashBuffer":{"type":"Buffer","data":[188,86,220,138,29,90,171,19,41,247,148,195,254,115,249,97,194,145,13,231]},"announce":[],"urlList":[]}}