{"title":"Atom Age Vampire","uid":5243578,"size":288348005,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bd3e2a4f4bfd8f53eedf0aa4f596ba05c952b705&amp;dn=Atom+Age+Vampire&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"V-G-O","files":1,"time":1261889966,"description":"When a singer (Susanne Loret) is horribly disfigured in a car accident, a scientist (Alberto Lupo) develops a treatment which can restore her beauty by injecting her with a special serum. While performing the procedure, however, he falls in love with her. As the treatment begins to fail, he determines to save her appearance, regardless of how many women he must kill for her sake.\n\nDespite the implication of its American title, the film does not feature an actual vampire. The titular Seddok is actually the brilliant but deranged scientist Dr. Levin, mutated by a chemical formula created using radiation. Dr. Levin studied the effects of radiation on living tissue in post-Hiroshima Japan, and created an imperfect and teratogenic serum, &quot;Derma 25&quot;, which he later refined into the miraculous healing agent &quot;Derma 28&quot; which he uses to treat the heroine. When his supply of Derma 28 runs out, he realizes he must kill to obtain more, and injects himself with Derma 25 in order to become monstrous and remorseless, so that he may seek these victims without hesitation. Because many of the murders take place near the docks where shiploads of Japanese refugees are arriving, and leave behind the victims' bodies with holes in the neck where Dr. Levin has extracted the glands, the refugees claim that a vampire (whom they call &quot;Seddok&quot;, though this is not a Japanese name) is responsible for the attacks. During a meeting with police, a restored-to-humanity Dr. Levin speculates that the Hiroshima survivors' tales of a mutated killer are due to psychological strain from the radiation damage to their bodies...but also wonders aloud whether the &quot;vampire&quot; these witnesses describe might simply be a disturbed man wishing to be normal again.\n\nThis film is now one of many which are considered to be in public domain and, as such, is freely available to download legally from the Internet.\n\n\nTo be notified of more movies like this, please bookmark and subscribe to... &lt;a href=&quot;\nhttp://www.themeekgeeksclassicweirdmoviesblog.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.themeekgeeksclassicweirdmoviesblog.com/&lt;/a&gt;","torrent":{"xt":"urn:btih:bd3e2a4f4bfd8f53eedf0aa4f596ba05c952b705","amp;dn":"Atom+Age+Vampire","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd3e2a4f4bfd8f53eedf0aa4f596ba05c952b705","infoHashBuffer":{"type":"Buffer","data":[189,62,42,79,75,253,143,83,238,223,10,164,245,150,186,5,201,82,183,5]},"announce":[],"urlList":[]}}