{"title":"Magicbit  DVD Ripper Deluxe 1.3.28 build-316","uid":5348007,"size":6419957,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:bd8b7e06bd5ab61fdfd7b4578cd3967e0da428f7&amp;dn=Magicbit++DVD+Ripper+Deluxe+1.3.28+build-316&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nightissuchproximity","files":2,"time":1265707399,"description":"Magicbit DVD Ripper Deluxe can rip DVD to all video file formats and audio file formats with one step! With high ripping speed, it can copy your favourite DVD movies to almost any popular video: VCD, VOB, SVCD, DivX, MPEG1, MPEG2, MPEG4(mp4), AVI, WMV, MOV, RM, iPod Video, PSP Video and mobile phones 3GP/MP4 Video. It can also convert DVD to audio formats such as MP2, MP3, ra, su, asf, ogg, WMA, WAV and iPod support MP3/PSP support MP3. You can copy an entire movie or just one or several chapters, or copy any segment of the movie.\n\nFeatures include:\n\nOne step to any! Convert DVD to any of popular video format directly. \nIncludes high performance engine: Magic DVD OneStep! to iPod, DVD OneStep! to PSP, DVD OneStep! to 3GP mobile phones, Pocket PC, and almost all video formats. \nExcellent image/sound quality and smaller file size in just a few clicks. \nFitness screen for iPod, PSP, and all portable players. \nUltra-high speed to convert your whole movie. \nSupports all of the popular video formats including AVI, MPEG, WMV, MOV, MP4, RM, RMVB, DivX, ASF, VOB, 3GP, ipod video, PSP video. \nWhen converting to MP3, bitrate, VBR or CBR, stereo or mono are selectable. \nConvert Video file to iPod, PSP support audio files. \n\n\nserial tested and working five minutes ago\n","torrent":{"xt":"urn:btih:bd8b7e06bd5ab61fdfd7b4578cd3967e0da428f7","amp;dn":"Magicbit++DVD+Ripper+Deluxe+1.3.28+build-316","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd8b7e06bd5ab61fdfd7b4578cd3967e0da428f7","infoHashBuffer":{"type":"Buffer","data":[189,139,126,6,189,90,182,31,223,215,180,87,140,211,150,126,13,164,40,247]},"announce":[],"urlList":[]}}