{"title":"Duran Duran - Wild Boys (Live-Beat Club)  (2nafish)","uid":5258794,"size":140060676,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:bfa15722eca9ac904ab400001b856b10e06f5193&amp;dn=Duran+Duran+-+Wild+Boys+%28Live-Beat+Club%29++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1262666745,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;The Wild Boys&quot; is the twelfth single by Duran Duran, released in October 1984.\n\nThe song was the only studio track on the live album Arena, and was produced by Nile Rodgers, who had previously remixed the single &quot;The Reflex&quot;. It was recorded at the end of July 1984 at Maison Rouge studios in London.\n\n&quot;The Wild Boys&quot; became one of the band's biggest hits, reaching #2 on the American Billboard Hot 100 and the UK Singles Chart, and hitting #1 on the German charts and the Canadian CHUM Chart. It became the band's biggest charting single in Australia, reaching #3.\n\nThe idea for the song came from longtime Duran Duran video director Russell Mulcahy, who wanted to make a full-length feature film based on the surreal and sexual 1971 novel The Wild Boys: A Book Of The Dead by William S. Burroughs. He suggested that the band might create a modern soundtrack for the film in the same way that Queen would later provide a rock soundtrack for Mulcahy's 1986 movie Highlander. Singer Simon Le Bon began writing some lyrics based on Mulcahy's quick synopsis of the book, and the band created a harsh-sounding instrumental backdrop for them.\n\nThe single was issued with six separate collectible covers - one featuring each individual band member and one of the band collectively.\n\nArena is a live album by Duran Duran, originally released worldwide in 1984 and reissued with two bonus tracks in 2004.\n\nTo cap off the band's highly successful 1983/1984 &quot;Sing Blue Silver&quot; World Tour, EMI released a live album, which according to the sleeve was &quot;Recorded Around The World 1984&quot;.\n\nThe album featured most of the band's big hits in a live environment, as well as some album tracks from Rio (1982) and Seven and the Ragged Tiger (1983), and a new studio track &quot;The Wild Boys&quot;, which was produced by Nile Rodgers, who had previously remixed the single &quot;The Reflex&quot;, and had been a member of the disco/funk group Chic.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:bfa15722eca9ac904ab400001b856b10e06f5193","amp;dn":"Duran+Duran+-+Wild+Boys+%28Live-Beat+Club%29++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bfa15722eca9ac904ab400001b856b10e06f5193","infoHashBuffer":{"type":"Buffer","data":[191,161,87,34,236,169,172,144,74,180,0,0,27,133,107,16,224,111,81,147]},"announce":[],"urlList":[]}}