{"title":"Texas is the Reason - Do You Know Who You Are (1996) [FLAC]","uid":5376717,"size":276709404,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c047cdacee28e9e81fb5ec635c0ada2e7ecb8f3b&amp;dn=Texas+is+the+Reason+-+Do+You+Know+Who+You+Are+%281996%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"politux","files":-1,"time":1266595117,"description":"Commonly referred to as one of the standards for the emocore movement of the '90s, Texas Is the Reason's Do You Know Who You Are? -- which was the last thing said to John Lennon before he died -- is the bedrock to this New York City four-piece's short-lived career. Produced by the very talented J. Robbins, the vocal style of singer Garrett Klahn sounds something akin to Richard Marx doing indie rock. Whether that view is received with smiling nods or disapproving stares, the fact remains that Klahn's unique angle of nasally sung vocals was warm enough to draw one in, while not being overbearing to the point of annoyance. With a musical background in various hardcore acts, the guitars break between melodic beauty and low-end chugga-chugga while the drums drive along with blasting consistency and precision. Stark phrases about life's loneliness and the dissonance between friends and lovers create a lyrical atmosphere that invites tremendous one-liners and memorable songs. The title track shows Texas Is the Reason in an abyss of harmonic composure, providing a chance for the listener to catch his or her breath before plunging back into the melodic, enthusiastic rush of &quot;Back and to the Left.&quot; While neither as harsh as many of their hardcore predecessors, nor as technical as their counterparts from Washington, D.C., nor as poppy as many of the emo bands to come after them, but instead taking a bit from each, Texas Is the Reason provided the indie rock scene with a combination of all the elements that it took to produce a quality indie rock record. For these reasons, Do You Know Who You Are? stands as one of the necessary albums for fans of emocore. \n\n\nFormat: CD\nRelease: 1996\nLength: 35:02\nQuality: FLAC\nGenre: Indie Rock\nLabel: Revelation Records\nAllmusic Rating: 4 / 5 stars \n\n\nTracks:\n\n   1. &quot;Johnny on the Spot&quot;        4:15\n   2. &quot;The Magic Bullet Theory&quot;   2:48\n   3. &quot;Nickel Wound&quot;              4:36\n   4. &quot;There's No Way I Can Talk Myself Out of this One Tonight&quot; 3:57\n   5. &quot;Something to Forget&quot;       5:50\n   6. &quot;Do You Know Who You Are?&quot;  2:43\n   7. &quot;Back and to the Left&quot;      3:55\n   8. &quot;The Day's Refrain&quot;         4:59\n   9. &quot;A Jack with One Eye&quot;       4:35\n\n","torrent":{"xt":"urn:btih:c047cdacee28e9e81fb5ec635c0ada2e7ecb8f3b","amp;dn":"Texas+is+the+Reason+-+Do+You+Know+Who+You+Are+%281996%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c047cdacee28e9e81fb5ec635c0ada2e7ecb8f3b","infoHashBuffer":{"type":"Buffer","data":[192,71,205,172,238,40,233,232,31,181,236,99,92,10,218,46,126,203,143,59]},"announce":[],"urlList":[]}}