{"title":"POTHS - Conspiracy Theory - Part 12 - Secret Societies","uid":5428187,"size":1669423489,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:c115603987ea0efb84b7d38a790da7fc9faf5b1b&amp;dn=POTHS+-+Conspiracy+Theory+-+Part+12+-+Secret+Societies&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"awaken888","files":10,"time":1268321295,"description":"POTHS - Pointing Out The Hellish Scumbags - POTHS - Pointing Out The Hellish Scumbags - POTHS\n\nThis POTHS - Conspiracy Theory - Secret Societies Collection has 27 parts to date. There will be more as WE are in the Middle of an INFOWAR. The information we receive on TV are all lies, it is a controlled media source that has nothing GOOD for you in it's programming. We have been scientifically &quot;brain washed&quot; Every advertising campaign you see is designed to deceive you.\n\nSeed long and receive Blessings from our Father.\n\n911     If you believe that a bunch of Camel Jockeys Living in Caves in Afghanistan caused the ENTIRE US MILITARY AIR COMMAND TO STAND DOWN WHILE, A bunch of mainly Saudi Arabians who could not even fly a single engine Cessna, let alone do the precision maneuvers that were required to hit the WTC and Pentagon in a modern Boeing 757. 6 of the Aledged Hijackers have been reported to be alive and well in the Mideast. Don't believe me, Google it yourself. If these Hijacker's were Saudi's then why did we invade Afghanistan and Iraq. We are moving right now into Yehman and Pakistan.\n\nHave you ever heard that old saying you can't retire from the CIA? Osama Bin Laden was the CIA's Go between between for supply the Afghan Rebels with stinger missiles to shoot down the Russian Helicopters that were battling the Afghanies. Once a CIA AGENT always a CIA agent.  Al Qaeda you mean El CIA DUH!!\n\nIF El CIA Duh did not fly those jets into the trade center then who did? Watch the enclosed video Lone Gunmen. This aired on TV 6 months before 911. Do you remember when Condolesa Rice said how could we have ever imagined that some one would fly planes into the WTC. Like this Ms Rice!! How about ______ _______?\n\nSo again, why did we invade Afghanistan? Why did just send 30,000 more troops there for what 60 Minutes reported were only 100 Taliban or Al Quaeda in the Whole county. Afghanistan for the Opium and Iraq for the Oil. Wake up time is short.\n\t","torrent":{"xt":"urn:btih:c115603987ea0efb84b7d38a790da7fc9faf5b1b","amp;dn":"POTHS+-+Conspiracy+Theory+-+Part+12+-+Secret+Societies","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c115603987ea0efb84b7d38a790da7fc9faf5b1b","infoHashBuffer":{"type":"Buffer","data":[193,21,96,57,135,234,14,251,132,183,211,138,121,13,167,252,159,175,91,27]},"announce":[],"urlList":[]}}