{"title":"Any DVD Cloner Platinum 1.0.3.1+KeyMaker","uid":5251486,"size":10558340,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c2077380897405729a5b0b0bbdae981c9b7fd861&amp;dn=Any+DVD+Cloner+Platinum+1.0.3.1%2BKeyMaker&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"marcco","files":-1,"time":1262374875,"description":"Any DVD Cloner Platinum is an ultimate DVD solution for copying DVD and ripping DVD Platinum can copy DVD movie to DVD and copy DVD to hard drive with 1:1 ratio in a super high DVD copy speed, shrink DVD9 to DVD5 with best quality, copy DVD to hard drive as DVD folder or ISO image file. As a DVD ripper, Any DVD Cloner Plat. can rip DVD to M4V, MP4, AVI, OGM and MKV. Any DVD Cloner Platinum also rips DVD to video formats playable on iPod, iPhone, PS3, PSP and Xbox360 so that you can watch your favorite DVD movie on the go! With this perfect DVD copying and DVD ripping combination, there won't be scratched or damaged DVD any more and you can enjoy any DVD movie anywhere\nat any time.\n\nAny DVD Cloner Platinum supports newly released DVD movies including Wall-E, Sleeping Beauty, Iron Man, Disaster Movie, Bangkok Dangerous, etc, 1:1 ratio DVD copy can make a perfect clone just as your original DVD.\n\nAny DVD Cloner Platinum can shrink DVD with minimum video quality loss so that you can save a DVD9 movie on a DVD5 disc or hard drive for further usage.\n\nAny DVD Cloner Platinum supports DVD-R / DVD-RW / DVD R / DVD RW burners, NTSC and PAL DVD mvoies.\n\nWith this perfect DVD copying and DVD ripping combination, there won't be scratched or damaged DVD any more and you can enjoy any DVD movie anywhere at any time.","torrent":{"xt":"urn:btih:c2077380897405729a5b0b0bbdae981c9b7fd861","amp;dn":"Any+DVD+Cloner+Platinum+1.0.3.1%2BKeyMaker","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2077380897405729a5b0b0bbdae981c9b7fd861","infoHashBuffer":{"type":"Buffer","data":[194,7,115,128,137,116,5,114,154,91,11,11,189,174,152,28,155,127,216,97]},"announce":[],"urlList":[]}}