{"title":"ProShow Gold Final","uid":5219520,"size":20189658,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:c33a665e2cee7e6439851f9e8e279098d4705add&amp;dn=ProShow+Gold+Final&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"nocents","files":6,"time":1260837197,"description":"ProShow Gold makes it easy to create a slide show with your photos, videos and music in a few simple steps. Just drag and drop your content into a show, edit photos, add effects, set the timing and youre done! You can easily create a unique and personalized photo slide show for any occasion whether its a birthday, anniversary, graduation, holiday, wedding or just showing-off vacation photos. Drag and drop your photos, videos and music into ProShow Golds easy-to-use interface. There you can add borders to photos, crop and edit video and audio clips, use built-in editing tools like red-eye removal and more.\n\nCreate spectacular effects by adding a pan, zoom or rotate to any photo in your show. Choose from over 280 transition styles including dissolves, fades, wipes, and shapes. Add custom captions and backgrounds to any photo. ProShow Gold will output your slide show to over 40 formats including DVD, Blu-ray, CD, the Web and dozens of devices like the iPod, iPhone and Blackberry. You can even upload your slide shows directly to\n\nFeatures:\n Add an unlimited number of layers to any slide\n Drag and drop to easily add content to a show\n Supports 100+ file types\n Transparency support for PSD, PNG, TIFF and GIF files\n Turn any layer into a fully-customized mask to conceal or reveal aspects of underlying layers\n Add a gradient or solid color as a slide layer to a layer to get incredible results\n Spice up a presentation using interactive slide actions to launch PDFs, spreadsheets, webpages and more\n Set transition effects for individual layers\n Optimize your workflow using built-in image correction tools like sharpen, colorize, saturate and more\n Create enhanced borders for your photos and videos with ProShow Producer's all-new vignette effect\n Create Hollywood-style greenscreen effects with the all-new Chroma Key Transparency tool\n Specify opacity for any layer on a slide\n Add depth to your composition by adjusting the color and opacity of a shadow on any layer in a slide\n Crop and rotate your photos and videos with precision\n Use the red-eye removal tool to correct any photo in your show in seconds\n Use adjustment effects to produce spectacular effects. Make a video move through color shifts or create a sequence of photo fades\n Add multiple keyframes to each adjustment effect\n Add motion like pan, zoom and rotate to any layer on a slide for a cinematic effect\n Zoom X and Y coordinates for a layer individually and zoom out further than ever before\n Create complex motion paths by setting multiple keyframe points on the keyframe timeline\n The fully-customizable slide preview grid allows you to accurately position your photos and videos on a slide\n Control the font, size and color of captions in your slides\n Use caption keyframing to create multiple caption motion effects on a single slide\n Animate your captions with more amazing effects to choose from than ever before\n Add interactive captions to launch actions like Pause, Resume, Next Slide, Previous Slide, Write Email and many more\n Gain greater design control over captions with ProShow Producer's new caption styles, caption line spacing and caption character features\n Enhance slide shows by dropping in any MP3 or WAV audio file\n Save an audio track directly from a CD and drop it right into your slide show\n Crop your audio and set fades using the built-in Audio Trimmer\n Built-in soundtrack waveform in slide list\n Add interest to your slide shows with solid colors, gradients, or videos as backgrounds\n Use the new, built-in backgrounds to spruce-up your slide shows\n Control the adjustment levels of your background content\n And many many more...","torrent":{"xt":"urn:btih:c33a665e2cee7e6439851f9e8e279098d4705add","amp;dn":"ProShow+Gold+Final","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c33a665e2cee7e6439851f9e8e279098d4705add","infoHashBuffer":{"type":"Buffer","data":[195,58,102,94,44,238,126,100,57,133,31,158,142,39,144,152,212,112,90,221]},"announce":[],"urlList":[]}}