{"title":"Keyshia Cole - (I Just Want It) To Be Over  (2nafish)","uid":5359164,"size":182536196,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c3af0fe1ebccf89a892a2640346bce276f678c41&amp;dn=Keyshia+Cole+-+%28I+Just+Want+It%29+To+Be+Over++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1266048044,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;(I Just Want It) To Be Over&quot; was the second single off Keyshia Cole's The Way It Is. It had moderate success on the R&amp;B/Hip-Hop charts, peaking at #30. It was produced by Kerry &quot;Krucial&quot; Brothers of KrucialKeys, a duo consisting of R&amp;B superstar Alicia Keys and Kerry Brothers. It was co-written by Cole, Kerry Brothers Jr. and Lady L.\n\nThe Way It Is is the debut album by American R&amp;B singer Keyshia Cole, released on June 21, 2005. It peaked at #6 on the U.S. Billboard 200 and features five singles: &quot;Never&quot;, &quot;I Changed My Mind&quot;, &quot;(I Just Want It) To Be Over&quot;, &quot;I Should Have Cheated&quot;, and &quot;Love&quot;. The album debuted at number six on the U.S. charts with first week sales of 89,000. It was finally certified gold within 17 weeks, and then platinum just eight weeks later. The album stayed on the charts for over a year, eventually selling over 1.4 million copies. This is her only album so far that had a parental advisory label on it.\n\nKeyshia Miesha Cole (born October 15, 1981) is an American recording artist. She released her platinum selling debut album The Way It Is in June 2005, and her sophomore platinum album Just Like You in September 2007. Cole's third studio album, A Different Me was released on December 16, 2008. Singles included &quot;Playa Cardz Right&quot; which features rapper 2Pac, &quot;You Complete Me&quot; and &quot;Trust&quot;. Keyshia cites Mary J. Blige and Brandy as her biggest influences and is highly compared to the vocal sensations as a combination of the two.\n\nThree seasons of her reality show Keyshia Cole: The Way It Is aired on BET from 2006 to 2008. Season Three premiered on Tuesday, November 12, 2008. The season concluded on December 30, 2008. This season showed her in the stage of making A Different Me. She has disclosed that there will not be a fourth season.\n\nIn August 2009, Keyshia Cole announced that she was beginning work on her self-titled fourth studio album which was due for release by Valentine's Day of 2010, but is now delayed and in post production. The new album is said to contain production from KrucialKeyz, The Runners, Kanye West, and Missy Elliott.\n\nCole was featured on the ReMix of R. Kelly's single &quot;Number One&quot; along with T-Pain. She is also currently listed as one of the inspirations for Pepsi: We Inspire.\n\nCole also appeared on Chelsea Lately in 2009, and she stated that she would love to tour and record collaborations with her musical idols Brandy and Mary J. Blige. According to Cole, she and pro-basketball player Daniel Gibson of the Cleveland Cavaliers are engaged as of January 1, 2010. Cole will make her acting debut in Tyler Perry's new film, Why Did I Get Married Too?, the sequel to Why Did I Get Married, as Jada. The film is due for an April 2, 2010 release.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:c3af0fe1ebccf89a892a2640346bce276f678c41","amp;dn":"Keyshia+Cole+-+%28I+Just+Want+It%29+To+Be+Over++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3af0fe1ebccf89a892a2640346bce276f678c41","infoHashBuffer":{"type":"Buffer","data":[195,175,15,225,235,204,248,154,137,42,38,64,52,107,206,39,111,103,140,65]},"announce":[],"urlList":[]}}