{"title":"Kui Lee - The Extraordinary - Hawaiian","uid":5357807,"size":53396702,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c3fa3daf69a243328e80888de961cd8e08231a90&amp;dn=Kui+Lee+-+The+Extraordinary+-+Hawaiian&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"k7sparky","files":12,"time":1265999654,"description":"Remastered 320 VBR\n\nI thought this was his only album, but I see one more listed on allmusic.com\n\nBio from allmusic:\n\nThe Lenny Bruce of Hawaii -- if more benign and loved -- Kui Lee died young of cancer, leaving behind a legacy of poetry and song that ushered in a hip, new Hawaii. Don Ho popularized and made hits out of many of his songs. Jack de Mello created a delightful, very strange 3-LP box tribute including narrative script by Robert Maxwell, then-editor of the Honolulu Beacon. Kuiokalani Lee was born July 31, 1932 in Shanghai, China to parents Billy and Ethel Lee, both entertainers themselves; he was brought to Hawaii at age five. First entering show business as a knife dancer and choreographer, he moved to New York, where in seven years he met and married Nani Naone and had four children. Returning to Hawaii in the early 1960s, Lee learned to sing and compose and soon formed his own group. Opening at Kanaka Pete's in Maui, he went on the Kalia Gardens, Queen's Surf, and ultimately the Waikiki Shell in 1966. The highlight of his final appearance, on October 18 of Aloha Week, was his wife's performance of his last composition, &quot;The Intangible Dream Came True.&quot; However, cancer was discovered shortly afterward, and Lee died on Dec. 3, 1966 at Guadalajara Hospital in Tijuana, Mexico. He was buried at sea off Waikiki six days later.\n\n","torrent":{"xt":"urn:btih:c3fa3daf69a243328e80888de961cd8e08231a90","amp;dn":"Kui+Lee+-+The+Extraordinary+-+Hawaiian","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3fa3daf69a243328e80888de961cd8e08231a90","infoHashBuffer":{"type":"Buffer","data":[195,250,61,175,105,162,67,50,142,128,136,141,233,97,205,142,8,35,26,144]},"announce":[],"urlList":[]}}