{"title":"Bob Dylan - Must Be Santa  (2nafish)","uid":5218955,"size":119752708,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c4635eb5b595ec546aceec86ec8160f7293bda95&amp;dn=Bob+Dylan+-+Must+Be+Santa++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1260856657,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 4000 Kb/s\nAudio: Linear PCM, 48000 Hz, Stereo, 1536 kbps\n\n\nThis video has no logo.\n\nChristmas in the Heart is Bob Dylan's 34th studio album and first Christmas album, released on October 13, 2009 on Columbia. The album comprises a collection of hymns, carols, and popular Christmas songs. Dylan's royalties from this album will benefit charities both inside and outside the U.S.\n\nDylan said that although he is Jewish, he never felt left out of Christmas during his childhood in Minnesota. Regarding the popularity of Christmas music, he said, &quot;... it's so worldwide and everybody can relate to it in their own way.&quot;\n\nThe album opened at #1 on Billboard's Holiday and Billboard's Folk Album Chart, #10 on Rock Album charts and #23 on overall album charts.\n\nDylan released a music video for the song &quot;Must Be Santa&quot; directed by Nash Edgerton. In the video, Dylan and some other people are having a Christmas house party, until two of the guests start fighting and smashing things around and one of them running away. In the closing scene, we see Dylan and Santa Claus. A music video was also released for the song &quot;Little Drummer Boy&quot;.\n\nIts collective score at Metacritic stands at 65 out of 100 based on 13 reviews, indicating generally favorable reviews. The unexpected move by Dylan to record a Christmas album was received with skepticism at first. The outcome of the project was lauded by critics for bringing a fresh breath of air into these classics. Slant Magazine`s critic Jesse Cataldo said &quot;This enjoyable sense of exploration, which prizes levity in a genre that usually amounts to an artistic wasteland, is invaluable. It also proves how much life is left in the songs, and how much other artists have succeeded at butchering them.&quot; Se7en magazine's critic agreed writing &quot;The arrangement of his band mixes up the style of the songs, resulting in a repertoire of Christmas songs that genuinely sound like modern material, while avoiding ever being clichÃƒÂ©.&quot;\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:c4635eb5b595ec546aceec86ec8160f7293bda95","amp;dn":"Bob+Dylan+-+Must+Be+Santa++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4635eb5b595ec546aceec86ec8160f7293bda95","infoHashBuffer":{"type":"Buffer","data":[196,99,94,181,181,149,236,84,106,206,236,134,236,129,96,247,41,59,218,149]},"announce":[],"urlList":[]}}