{"title":"Leona Lewis - Happy  (2nafish)","uid":5217075,"size":145661956,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c4756d9d10e86485bee03a308fc3a4900d5abe13&amp;dn=Leona+Lewis+-+Happy++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1260785183,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Happy&quot; is a song performed by British pop/R&amp;B singer Leona Lewis. It was written by Lewis, Ryan Tedder, Evan &quot;Kidd&quot; Bogart, and produced by Tedder for Lewis's second album Echo. It was released on 15 September 2009, in the USA and Canada, serving as the album's worldwide lead single. The single's cover features Lewis wearing a one-off Vivienne Westwood creation.\n\nThe video for &quot;Happy&quot; was filmed in Cuba and directed by Jake Nava on 29 September 2009. It premiered on UK music channel The Box on 17 October 2009.\n\nThe video shows Lewis flirting and falling in love with a man, giving the watcher a sense that the feelings are reciprocal. However, when it becomes apparent that Lewis is in love with him, he only sees her as a good friend. The wedding proceeds and it is revealed that he marries a different woman, and Lewis though disappointed, strives to be &quot;happy&quot; with the situation. The video is interspersed with Lewis preparing herself for the wedding.\n\nEcho is the second studio album by English pop singer and songwriter Leona Lewis. It was released on 16 November in the United Kingdom by Syco Music, followed by 17 November in the United States under J Records. Its worldwide release was through Sony Music.\n\nLewis worked with Ryan Tedder, Justin Timberlake, Max Martin, John Shanks, and Harvey Mason, Jr. amongst others to produce the follow-up to her debut album Spirit. The album was preceded by the single &quot;Happy&quot;, released on 15 September.\n\n&quot;Happy&quot;, the first single from the album, premiered on the UK'S The Radio 1 Chart Show on 6 September 2009. The first televised performance of &quot;Happy&quot; was on the fourth series finale of America's Got Talent on 16 September 2009, and Lewis performed it at the VH1 Divas concert on 17 September 2009. On 29 October Lewis performed at the MalmÃƒÂ¶ Arena's Breast Cancer Pink Ribbon Gala in Sweden. She is set to perform at the 2009 MTV Europe Music Awards in Berlin on 5 November 2009. Lewis performed &quot;Happy&quot; on The X Factor on 8 November.\n\nLewis was scheduled to appear on the BBC's The One Show on 14 October 2009, but she pulled out following an incident at a booksigning of her autobiography Dreams where a man punched her in the face. She also cancelled a two-day promotional trip to Germany. She rescheduled her appearance on The One Show to 26 October. On 24 October, Lewis performed on the Swiss television show Benissimo, and on 25 October, she performed &quot;Happy&quot; live on the Dutch show Life4You.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:c4756d9d10e86485bee03a308fc3a4900d5abe13","amp;dn":"Leona+Lewis+-+Happy++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4756d9d10e86485bee03a308fc3a4900d5abe13","infoHashBuffer":{"type":"Buffer","data":[196,117,109,157,16,232,100,133,190,224,58,48,143,195,164,144,13,90,190,19]},"announce":[],"urlList":[]}}