{"title":"Der Untergang - 2Lions-Team","uid":5237940,"size":4682622752,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:c4e5b8cbc173bf8ad97572a089ef483115203878&amp;dn=Der+Untergang+-+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SAIMOR","files":-1,"time":1261611646,"description":"Duitsland / ItaliÃƒÂ« / Oostenrijk\nDrama / Oorlog\n156 minuten \n\nRegisseur: Oliver Hirschbiegel\nmet Bruno Ganz, Juliane KÃƒÂ¶hler en Alexandra Maria Lara\n\n\nBeschrijving\n\nBerlijn, april 1945. Het land staat op het punt van de totale ineenstorting. In de straten van de hoofdstad voltrekken zich hevige gevechten van huis tot huis. \nHitler heeft zich, met enige van zijn generalen en vertrouwelingen, verschanst in de FÃƒÂ¼hrer's Bunker onder de Rijkskanselarij. \nOnder hen is ook Traudl Junge, Hitler's prive secretaresse, die hem niet in de steek wil laten. \nTerwijl de situatie buiten escaleert - het Rode Leger rukt immers fors op en in de door bombardementen getekende stad spelen zich wanhopige taferelen af - \nondergaat Hitler de ineenstorting van zijn Derde Rijk achter de dikke muren van zijn bunker. \nEn hoewel Berlijn op het punt van vallen staat weigert de FÃƒÂ¼hrer de stad te verlaten. Hij wil, zoals zijn architect Speer het wist te vertellen, \n&quot;op het podium staan als het doek voor de laatste keer valt.&quot; Maar Hitler staat niet op het podium. \nTerwijl de gevolgen van zijn hopeloos verloren oorlog met alle macht over zijn volk heenvallen, werkt de FÃƒÂ¼hrer aan zijn eigen aftocht. \nSlechts enkele uren voor hun gemeenschappelijke zelfmoord trouwt hij met Eva Braun. \nIn plaats van een laatste overwinning komt er een laatste nederlaag, maar ook die moet tot in de puntjes verzorgd worden. \nNadat Hitler en Eva Braun de hand aan zichzelf hebben geslagen worden ze verbrand zodat hun lichamen niet in handen van de vijand vallen. \nVele van zijn getrouwen kiezen eveneens voor zelfmoord. Goebbels en de overgebleven generalen weigeren zich onvoorwaardelijk over te geven aan de Russen. \nAls de situatie nog hopelozer wordt besluit Magda Goebbels haar zes kinderen te vergiftigen voordat zij zelf met haar man zelfmoord pleegt. \nKort daarna weten Traudl Junge en enige anderen op het laatste moment te ontsnappen uit de bunker...\n\n\nCategorie:  Beeld  \nBron:       DVD\nAudio:      Duits \nOndertitels:Nederlands\nAudio:      Dolby Digital 5.1\n\n****************************************************************************\nGerman / Italy / Austria \nDrama / War \n156 minutes\n\n\nRegisseur: Oliver Hirschbiegel\nwith Bruno Ganz, Juliane KÃƒÂ¶hler en Alexandra Maria Lara\n\nDescription\n\nBerlijn, April 1945.  The country stands on the point of the total collapse.  In the streets of the capital, take violent fights of house till house.  \nHitler has self, with only of its generals and confidants, entrenches in the FÃƒÂ¼hrer's Bunker under the Rijkskanselarij.  \nUnder them, Traudl Junge, Hitlers prive secretary is also that want do not let him down.  \nWhile the situation outside escalates - the Red Army tears after all strongly on and in the through bombardments marked city play self desperate scenes finished - \nundergoes escalates Hitler the collapse of be Third Realm behind the dikke walls of its bunker.  \nAnd although Berlin on the point of traps state refuses to leave the FÃƒÂ¼hrer the city.  He want, as its architects Spear to tell knew it, \n&quot;on the stage stand as the cloth for the last time falls.&quot;  But Hitler do not stands on the stage.  \nWhile the consequences of are desperate lost war with all power over its people heenvallen, works the FÃƒÂ¼hrer on its own retreat.  \nOnly single hours for their common suicide, he marries Eva Braun.  Instead of a last victory comes must be looked after there a last defeat, \nbut also that till in the points.  After Hitlers and Eva Braun the hand at itself hit become they burnt so that their bodies not in hands of the enemy fall.  \nMany of its faithful molars also for suicide.  Goebbels and the been left refuse to give generals self unconditionally over at the Russians.  \nIf the situation yet more desperately decision Magda Goebbels her six children becomes commits to poison before they self with her man suicide.  \nShortly after Traudl Junge know and simply others on the last moment to escape from the bunker...  \n\n\n\n\nCategory: Image \nSource:   DVD \nAudio:    German\nSubtitles:Dutch \nAudio:    Dolby Digital 5.1\n\n*****************************************************************************\n\nBrought to you by \nROMIAS\n2Lions Team \n\n\nmeer zien?? \nKom dan eens kijken op ons forum \n    &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt; \n\n2Lions-Team for all your Dutch MOVIES and more \n\n****************************************************************************** \n\nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding.\n\n******************************************************************************\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n\n*******************************************************************************","torrent":{"xt":"urn:btih:c4e5b8cbc173bf8ad97572a089ef483115203878","amp;dn":"Der+Untergang+-+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4e5b8cbc173bf8ad97572a089ef483115203878","infoHashBuffer":{"type":"Buffer","data":[196,229,184,203,193,115,191,138,217,117,114,160,137,239,72,49,21,32,56,120]},"announce":[],"urlList":[]}}