{"title":"Pro Evolution Soccer. 2010 cracked and keygen fast download","uid":5232791,"size":5800720384,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c59c17e8d26e48d477c3e1a11b34735504b92581&amp;dn=Pro+Evolution+Soccer.+2010+cracked+and+keygen+fast+download&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"miholic","files":1,"time":1261402540,"description":"Pro Evolution Soccer 2010 (abbreviated as PES 2010 and known \n     as World Soccer: Winning Eleven 2010 in Japan) is an upcoming \n     football video game in the Pro Evolution Soccer series. The game \n     is being developed and published by Konami for release on Sony's \n     PlayStation 2, PlayStation 3 and PlayStation Portable; \n     Microsoft's Xbox 360 and Windows; Nintendo's Wii; and mobile \n     phones.\n     \n     PES 2010 was announced on 8 April 2009 and has a release date \n     of 23 October 2009 for the PC, PS3, PSP and Xbox 360 versions \n     in Europe. The playable demo for the PC, PS3 and Xbox 360 \n     versions was released on 17 September 2009.\n     \n     Lionel Messi will be a key endorsement player for PES 2010 by \n     featuring throughout the promotion and development of the game. \n     He features on the cover alongside Fernando Torres, another \n     endorsement player.\n     \n     PES 2010 will have the following features.\n     \n     * PES 2010 contains improved visuals, animations and moves, \n     including live player expressions and movements that will change \n     according to conditions on the field. Animations of dribbling and \n     shots on goal, as well as individual skills, have all been reworked.\n     * Gameplay has been made more realistic. This includes more \n     versatile goalkeepers and greater control over penalties in terms \n     of placing and accuracy.\n     * There will be an enhanced online experience: a new \n     development team is solely dedicated to improving online play \n     and other aspects such as downloadable content and more \n     updates.\n     * The AI has been improved thanks to Teamvision 2.0. Referees \n     have been reworked to make more balanced calls during matches.\n     * PES 2010 introduces greater strategy control: various \n     strategic elements, such as pass frequency and width of play, can \n     be altered.\n     * The match-day atmosphere gives a better taste of home and \n     away crowds, which will react spontaneously to all the action on \n     the pitch.\n     * Master League has been enhanced. It has improved managerial \n     aspects, resulting in an increased managerial career lifespan.\n     * 360-degree control is introduced, available on the PC, PS3 and \n     Xbox 360 versions of the game via the analogue sticks on the \n     respective controllers. PS3 owners will also benefit from this when \n     using the DualShocks D-Pad, but the Xbox 360 and Wii D-Pads \n     are limited to eight-directional control due to the hardware.\n","torrent":{"xt":"urn:btih:c59c17e8d26e48d477c3e1a11b34735504b92581","amp;dn":"Pro+Evolution+Soccer.+2010+cracked+and+keygen+fast+download","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c59c17e8d26e48d477c3e1a11b34735504b92581","infoHashBuffer":{"type":"Buffer","data":[197,156,23,232,210,110,72,212,119,195,225,161,27,52,115,85,4,185,37,129]},"announce":[],"urlList":[]}}