{"title":"CBC.DOC ZONE.CannaBiz (2010).HDTV.XviD.Ekolb","uid":5319031,"size":365800013,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c5dde8a81f1c33b396081eefb1ab6f946038ad8d&amp;dn=CBC.DOC+ZONE.CannaBiz+%282010%29.HDTV.XviD.Ekolb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Ekolb","files":3,"time":1264805510,"description":"CannaBiz\nThursday January 28, 2010 at 9 pm on CBC-TV\n\nCanada's $20 billion-dollar marijuana industry is now at a violent crossroads between crime and commerce. Impossible to police, yet steadily gaining public acceptance, the cannabis industry is now so vast and vital to Canada's national economy that it can no longer be ignored.\n\nCannaBiz unfolds in Grand Forks, BC, a small border town nestled in the Kootenay Mountains, where draft dodgers planted the first &quot;BC Bud&quot; in the 1960s. After the pine beetle chewed through what was left of the forest industry, marijuana became the backbone of the local economy. In secret forest plots, basements, barns and high-tech underground bunkers, growers nurture some of the world's most potent bud. Most of the marijuana here, and in the rest of Canada, is destined for the US market, where a pound of premium weed sells for a street price of $4,500.\n\nAcross the country, formerly laid-back marijuana growers now live in fear of armed thieves, and smugglers take huge risks to cross the beefed up American border. Conflicted police and RCMP officers like Harland Venema continue to fight a seemingly futile battle. In Grand Forks, Brian Taylor, once nicknamed &quot;the marijuana mayor&quot;, is campaigning for medical marijuana as a prescription for economic prosperity. Ex con Sam Mellace dreams of supplying medical marijuana nationally through Shoppers Drug Mart outlets.\n\nWith inside access to growers, gangsters and police, CannaBiz untangles the inner workings of the marijuana industry and raises serious questions about Canada's drug laws. Stephen Easton, a leading Canadian economist, recommends the end to marijuana prohibition, yet the government's position is to get even tougher on an industry that now employs as many Canadians as the auto industry. Are the staggering profits from the cannabis industry better off in the pockets of hard-core smugglers and criminal gangs, or would the Canadian economy benefit from taxing this exploding industry?\n\nCannaBiz is written and directed by Lionel Goddard and Chris Aikenhead for Omni Film Productions in association with the Canadian Broadcasting Corporation.\n\nFormat            : AVI\nLength            : 349 MiB for 44mn 9s 149ms\n\nCodec             : XviD\nSource            : HDTV\nLanguage          : English CA\nSubtitles         : None\nGenre             : Documentary\n\nVideo #0          : MPEG-4 Visual at 958 Kbps\nAspect            : 624 x 336 (1.857) at 29.970 fps\n\nAudio #0          : MPEG Audio at 133 Kbps\nInfos             : 2 channels, 48.0 KHz\n\nEnjoy!\nEkolb","torrent":{"xt":"urn:btih:c5dde8a81f1c33b396081eefb1ab6f946038ad8d","amp;dn":"CBC.DOC+ZONE.CannaBiz+%282010%29.HDTV.XviD.Ekolb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5dde8a81f1c33b396081eefb1ab6f946038ad8d","infoHashBuffer":{"type":"Buffer","data":[197,221,232,168,31,28,51,179,150,8,30,239,177,171,111,148,96,56,173,141]},"announce":[],"urlList":[]}}