{"title":"ChromePlus4","uid":5446632,"size":19339776,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c5e6411245224bbbb37952f7efc84b3f3f14b586&amp;dn=ChromePlus4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Petrovas","files":1,"time":1269038570,"description":"ChromePlus intends to provide the most easy-to-use browser based on Chrome.\n\nAt this stage, you can easily use it with the following features:\n\n\n\n\n\nYou don't need to locate and click the small &quot;x&quot; button on the tab to close it. In ChromePlus, you just double click within the tab area and deleted page will close.\n\n\nSuper drag\n\n\nDrag a link in the page with your left button and drop it somewhere else in the page. This can create a new page(tab) to open the link; Dragging and dropping a block of text in the page will create a page and search the text with your default search engine.\n\n\nMouse gesture\n\n\nThe Arrow Trace mouse gesture draws an arrow trace on the page while you using the right button of your mouse. In ChromePlus, you can make efficient commands with easy mouse gestures. Practiced mouse gestures can save you quite a lot of time and are fun. \n\n\nIE tab\n\n\nSome web pages use IE controls and thus can only run in IE correctly. The IE tab is designed to visit these pages. Just look for an icon/An (IE) icon appears in the right of the location bar.\n\n\nDownload Tools Support\n\n\nFor your convenience, we supported some popular download tools in the context menu of web pages. The download tools supported are: NetAnts, Orbit, QQ Xuanfeng, IS, FlashGet3, FlashGetMini, NetX, WebThunder, Xunlei. If you have installed these tools, you can find the corresponding item in the context menu when you right click on a link.\n\nDouble click tab to close page","torrent":{"xt":"urn:btih:c5e6411245224bbbb37952f7efc84b3f3f14b586","amp;dn":"ChromePlus4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5e6411245224bbbb37952f7efc84b3f3f14b586","infoHashBuffer":{"type":"Buffer","data":[197,230,65,18,69,34,75,187,179,121,82,247,239,200,75,63,63,20,181,134]},"announce":[],"urlList":[]}}