{"title":"Free Mp3 Music Alternative Industrial Euphonic Dissonance sounds","uid":5438254,"size":135010464,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c717aeaac5ee42ac20567ea87d61a8b777085e28&amp;dn=Free+Mp3+Music+Alternative+Industrial+Euphonic+Dissonance+sounds&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"euphonicdissonance","files":-1,"time":1268799752,"description":" &lt;a href=&quot;http://www.euphonicdissonance.net&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.euphonicdissonance.net&lt;/a&gt;\n\nEuphonic Dissonance Transitions Album Progressive Industrial Music sounds like David Bowie 320 bit Mp3.\n\nDescribed as David Bowie meets David Byrne at a Door's concert. Euphonic Dissonance employ hardware and software instruments to channel the zeitgeist in a hybrid sonic sance assembled from elements of rock (classic, gothic, and indy) and electronic dance (idm, breaks, and techno). \n\nEuphonic Dissonance write original crossover music mixing electric and acoustic instruments with computer based ones to create their dark industrial electronic rock sound wall of roaring tectonic basslines - dark words reinforcing progressive synthesis. \n\nSounds like: \tshiny toy guns, Peter Murphy, P J Harvey, David Bowie, System Of A Down, Ministry, Pink Floyd, Linkin Park, Aphex Twin, Mr. Bungle, Kate Bush, The Beatles, John Lennon, Nirvana, The Police, Sting, Peter Gabriel, Gorillaz, Genesis (w/ Peter Gabriel), Johhny Cash, Cypress Hill, The Cure, Jethro Tull, Korn, Sex Pistols, Tool, Faith No More, The Wallflowers, Rage Against The Machine, Brian Eno, M83, Rasputina, Bjork, Rush, Clara Rockmore, Bach, Radiohead, Wendy Carlos, iMOGEN HEAP, Pixies, Postal Service, Suzanne Vega, Eurythmics, Living Colour, Violent Femmes, Oingo Boingo, Audioslave, arcade fire, outkast, throbbing gristle, sneaker pimps, death cab for cutie, paramore, panic at the disco, weezer, my chemical romance, rammstein, powerman 5000, celldweller, marilyn manson, kmfdm, revolting cocks, static x, filter, nitzer ebb, mindless self indulgence, mdfmk, machines of loving grace, kidney thieves, front line assembly, pigface, orgy, dead or alive, puscifer, skinny puppy, snake river conspiracy, stabbing westward, tweaker, coil, vast.\n\n\niTunes reviews:\n\n\nInspired By The Greats\n     \nby PainInGulliver\n\nThere is so much David Bowie influence in the songs of Euphonic Dissonance. I hear a lot of that in Grace The Stage and Stranger Things Have Happened. I can't wait to see this band live. I hear they're live show is over the top. Kinda like a Flaming Lips concert.\nChillin\n     \nby Roll-in Mill$\n\nOne of the best albums I have ever heard....all twelve tracks are bangers.\nWow!\n     \nby Adebaser\n\nDefinitely an inspiring album! Keep the passion. \n\n----------\n\nMyspace Icon Link for Euphonic Dissonance Progressive Industrial Music Facebook Icon Link to Euphonic Dissonance Progressive Industrial Music Blogger Link Euphonic Dissonance Progressive Industrial Vampire Freaks Link Euphonic Dissonance Progressive Industrial Music progressive industrial music, david bowie, progressive industrial music, ziggy, dissonant, progressive industrial music, bowie, progressive industrial music, david bowie, progressive industrial music, thin white duke, progressive industrial music, labyrinth, progressive, bowie, many Bowie, BOWIE VIRTUAL CONCERT LIGHTER APP FOR iPHONE Bowie Virtual Concert Lighter progressive industrial music, song titles, progressive industrial music, brian eno, progressive industrial music, ziggy stardust, progressive industrial music, david bowie, progressive industrial music, progressive industrial music, brian eno, progressive industrial music, bowie, progressive industrial music, david bowie, industrial music, bowie, progressive industrial music, bowie, euphoric, i'm afraid of americans, distance, progressive industrial music, euphoric dissonance, david bowie, progressive industrial music, bowie, progressive industrial music, euphoric, euphonic distance, sounds like bowie, progressive industrial music, sound david bowie, progressive industrial music, david bowieeuphnoic eiphonic eyphonic ejphonic euohonic eulhonic eupnonic euptonic eupgonic eupbonic euphinic euphlnic euphpnic euphomic euphohic euphobic euphonoc euphonuc euphonkc euphonid euphoniv euphonix dissonnace dissnoance dsisonance disonance eissonance sissonance cissonance fissonance dossonance dussonance dkssonance diesonance diasonance didsonance diwsonance diseonance disaonance disdonance diswonance dissinance disslnance disspnance dissomance dissohance dissobance dissonsnce dissonznce dissonqnce dissonamce dissonahce dissonabce dissonande dissonanve dissonanxe","torrent":{"xt":"urn:btih:c717aeaac5ee42ac20567ea87d61a8b777085e28","amp;dn":"Free+Mp3+Music+Alternative+Industrial+Euphonic+Dissonance+sounds","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c717aeaac5ee42ac20567ea87d61a8b777085e28","infoHashBuffer":{"type":"Buffer","data":[199,23,174,170,197,238,66,172,32,86,126,168,125,97,168,183,119,8,94,40]},"announce":[],"urlList":[]}}