{"title":"Leona Lewis - Footprints In The Sand  (2nafish)","uid":5332096,"size":94590980,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c7f78c34799bd507212cae8e74a09ead64b23523&amp;dn=Leona+Lewis+-+Footprints+In+The+Sand++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1265205154,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Footprints in the Sand&quot; is a song written by Richard Page, Per Magnusson, David Kreuger and Simon Cowell, and produced by Steve Mac for Leona Lewis's debut album, Spirit. It was released in March 2008 as Lewis's third UK single, as a double A-side with &quot;Better in Time&quot;.\n\nThe music video for &quot;Footprints in the Sand&quot; was directed in London by acclaimed British director Sophie Muller back-to-back with the video for &quot;Better in Time&quot;. The video is cut with footage of Lewis's visit to Johannesburg, South Africa for Sport Relief, and it premiered on her official website and BBC Radio 1's website on 27 February 2008.\n\nA special edition of the video, featuring footage of Lewis in South Africa, was shown on BBC One on 9 March 2008.\n\nThe song is the official song of charity Sport Relief for 2008. The single was released in the United Kingdom as a digital download on 9 March 2008, with a physical release on the following day, with proceeds going to the charity. The song has been remixed for the single release.\n\n&quot;Footprints in the Sand&quot; is an adaptation of the Christian poem &quot;Footprints&quot;. Cowell originally came up with the idea to base a song around the poem, and asked songwriting and production team David Kreuger and Per Magnusson whether they could write something dealing with this subject. They took the idea along to a songwriting session the pair already had scheduled with Richard Page at his home in Malibu and finished the song the following day. In an interview with HitQuarters, Magnusson said they had thought the song would be great for Westlife, but it was offered to Lewis. When Cowell mentioned the song concept to Lewis, she agreed that it could be &quot;really quite interesting&quot;. Cowell secured a songwriting credit for coming up with the idea. Lewis describes the song as &quot;very moving, with a very emotional lyric&quot;. The song is about &quot;standing by someone and being there for people who need your help.&quot;\n\nTo promote the single, Lewis performed the song live on Dancing on Ice on 9 March 2008, with a special ice dance routine performed by Torvill and Dean.\n\nSpirit is the debut album by British singer Leona Lewis, released by Syco Music in November 2007 in the United Kingdom and Ireland with worldwide release during early 2008. The release of the album marks Lewis as the first winner of a major television talent show in both the UK and USA to be given a major global launch with a debut album. Lewis says she named the album Spirit because &quot;it is my heart and soul and the voice within that says everything is possible.&quot;\n\nSpirit debuted at number one in nine countries, including the United Kingdom, United States, Ireland, Canada, Australia, New Zealand and Germany. It held the record for the biggest digital album sales in a week ever for a new artist, male or female. On 3 December 2008 it was announced that the album had been nominated for Best Pop Album at the Grammy Awards. &quot;Bleeding Love&quot; was nominated for Best Female Pop Vocal Performance and Record Of The Year. The album was the 6th biggest selling of 2008 in the world, as according to the IFPI.\n\nAs of 23 November 2009, Spirit is the 24th best selling album of all time in the United Kingdom, with sales of 2,868,266 copies. It has gone on to sell over 7 million copies worldwide including the deluxe edition.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:c7f78c34799bd507212cae8e74a09ead64b23523","amp;dn":"Leona+Lewis+-+Footprints+In+The+Sand++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7f78c34799bd507212cae8e74a09ead64b23523","infoHashBuffer":{"type":"Buffer","data":[199,247,140,52,121,155,213,7,33,44,174,142,116,160,158,173,100,178,53,35]},"announce":[],"urlList":[]}}