{"title":"Relient K - Sleigh Ride   (2nafish)","uid":5203050,"size":127920132,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c86c0e52b822f4d7d5c15e4ef388c13b460dd120&amp;dn=Relient+K+-+Sleigh+Ride+++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1260254183,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nLet It Snow, Baby... Let It Reindeer is the second Christmas album by Christian rock band Relient K. It was released on October 23, 2007, selling 4,500 copies in its first week. The album is a re-release of the band's first Christmas album, Deck the Halls, Bruise Your Hand, but with seven new songs and some other changes, such as track listing and a new ending to one song. The details were announced by Jesus Freak Hideout on August 21, 2007, and by IGN around the same time. The album peaked at #96 on the Billboard 200 list in its fourth week and at #15 on iTunes. &quot;Merry Christmas, Here's to Many More&quot; played during the December 14th 2007 episode of Ghost Whisperer. A re-issue of the album was released on iTunes on November 18, 2008. It includes renditions of &quot;Silver Bells,&quot; &quot;God Rest Ye Merry Gentlemen,&quot; and &quot;O Holy Night,&quot; as well as a music video for their version of &quot;Sleigh Ride.&quot;\n\nThe band's video for &quot;Sleigh Ride&quot; was made by Funny Pages Productions. It is an animated video, and the band had mentioned in recent years that they always wanted to do an animated video. It features all of the band members as rabbits in Winter. The Matt Thiessen rabbit fails to get the attention of a girl rabbit, which leads the other four band members to steal Santa's sleigh so that he can impress her. After the two take off in the sleigh, Santa tries to get it back by using a giant snowman. After some close calls, the other band members build a snowwoman to draw the snowman off. In the end, they give Santa his sleigh back, and the Ethan Luck rabbit sneaks a present from Santa's sleigh for Matt to give to the girl rabbit. The video was released in November 2008.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:c86c0e52b822f4d7d5c15e4ef388c13b460dd120","amp;dn":"Relient+K+-+Sleigh+Ride+++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c86c0e52b822f4d7d5c15e4ef388c13b460dd120","infoHashBuffer":{"type":"Buffer","data":[200,108,14,82,184,34,244,215,213,193,94,78,243,136,193,59,70,13,209,32]},"announce":[],"urlList":[]}}