{"title":"Farscape - Le guerre dei Pacificatori - Miniserie conclusiva - D","uid":5323844,"size":1977303087,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c87122ffac2e144d6ebda33737bc288b072049ae&amp;dn=Farscape+-+Le+guerre+dei+Pacificatori+-+Miniserie+conclusiva+-+D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Rayden_10","files":3,"time":1264954468,"description":"Storia e ambientazione:  L'astronauta John Crichton dell'Agenzia Spaziale IASA effettua un volo spaziale di routine nel tentativo di dimostrare una teoria scientifica utilizzando l'atmosfera terrestre per lanciare il suo modulo spaziale, Farscape 1, ad una velocitÃƒÂ  elevatissima. Qualcosa tuttavia va storto e il suo modulo spaziale, colpito da un'improvvisa ondata di radiazioni, genera un tunnel spaziale in cui viene trascinato e trasportato in un punto lontanissimo e sconosciuto dell'universo, nel bel mezzo di una battaglia. Qui, dopo aver urtato accidentalmente un'altra navetta ed aver causato la morte del suo pilota, il protagonista viene salvato e portato a bordo di un'astronave vivente, il leviatano Moya, che trasporta un gruppo di prigionieri alieni in fuga dai Pacificatori, una razza xenofoba che ha istituito una dittatura militare in questa zona della galassia.\n\nIl pilota Pacificatore ucciso accidentalmente ÃƒÂ¨ perÃƒÂ² fratello del Capitano Bailar Crais, ufficiale incaricato di ricatturare i fuggitivi, che stravolto dall'ira per la morte del fratello intraprende una crociata personale per ricatturare i fuggitivi e il presunto assassino John Crichton.\n\nDa qui iniziano le avventure di John Crichton che, solo in un luogo lontano anni luce dalla Terra, cercherÃƒÂ  una via per sfuggire al suo inseguitore e per far ritorno tra gli umani.\n\n\nCuriositÃƒÂ : Farscape ÃƒÂ¨ una serie televisiva di fantascienza ideata da Rockne S. O'Bannon ein Australia dalla Jim Henson Company in collaborazione con il canale televisivo via cavo Sci Fi Channel.\n\n\nNazione: USA, Australia\nAnno: 1999 - 2004\nStagioni: 4 + miniserie finale\nGenere: fantascienza\nDurata episodio: 90 min circa\n\n\n\nDati tecnici del Mux:\n\nFonte: DVD\nCodec: Xvid\nRisoluzione: 608 x 352\nBitrate: 1000 Kb/s circa\nFps: 25.000\nCodec audio: Mp3\nBitrate audio: 192 Kb/s ITA, 128 Kb/s Eng\nAltri dati audio: 2 canali stereo, 48.000 Hz","torrent":{"xt":"urn:btih:c87122ffac2e144d6ebda33737bc288b072049ae","amp;dn":"Farscape+-+Le+guerre+dei+Pacificatori+-+Miniserie+conclusiva+-+D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c87122ffac2e144d6ebda33737bc288b072049ae","infoHashBuffer":{"type":"Buffer","data":[200,113,34,255,172,46,20,77,110,189,163,55,55,188,40,139,7,32,73,174]},"announce":[],"urlList":[]}}