{"title":"smeserver-7.4-i386.iso","uid":5361295,"size":615393280,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:c94327b078b21a4061b9e8a413023eb77c924429&amp;dn=smeserver-7.4-i386.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ldjoha","files":1,"time":1266111456,"description":"Why spend a fortune on Windows server software when you can get more for so much less?!\n\nThe SME Server CD provides a flexible, worry-free, network server solution you won't outgrow.\n\nSME Server v7.4 is the latest version of the award-winning e-smith Server and Gateway, the world's leading open-source server software for small and medium-sized enterprises.\n\nExceptionally reliable and easy to use, SME Server can be installed and configured in less than 15 minutes - yet it's powered by a secure and open Linux platform that's fully upgradeable and customizable. Simply install it on any standard PC and in minutes you'll have a robust Linux-based server capable of fully replacing those expensive Windows server licenses and providing a full range of services - including e-mail, firewall, file and print-sharing, web hosting, remote access and more.\n\nSME Server integrates easily with Windows, Macintosh, and Unix/Linux clients, and within a Windows network environment. It's as simple to use as a server appliance, but unlike a &quot;sealed-box&quot; appliance the entire system is modular and extensible, so it can be tailored to the needs of individual businesses. ","torrent":{"xt":"urn:btih:c94327b078b21a4061b9e8a413023eb77c924429","amp;dn":"smeserver-7.4-i386.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c94327b078b21a4061b9e8a413023eb77c924429","infoHashBuffer":{"type":"Buffer","data":[201,67,39,176,120,178,26,64,97,185,232,164,19,2,62,183,124,146,68,41]},"announce":[],"urlList":[]}}