{"title":"The Killers - Don't Shoot Me Santa  (2nafish)","uid":5199287,"size":167159812,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:cebc51149bde360b53bb6fd5b1ad8d67e3e018bf&amp;dn=The+Killers+-+Don%5C%27t+Shoot+Me+Santa++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"2nafish","files":-1,"time":1260077715,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Don't Shoot Me Santa&quot; is a song by Las Vegas-based rock band The Killers. The song was released November 27, 2007 (2007-11-27), as a digital download. A portion of the proceeds from this song went to AIDS charities as part of the (PRODUCT)RED campaign, headed by Bono and Bobby Shriver. It is The Killers' second Christmas download single following 2006's &quot;A Great Big Sled&quot;.\n\nAccording to Japanese Vogue, the video for &quot;Don't Shoot Me Santa&quot; was directed, edited, and co-produced by actor/director/visual artist Matthew Gray Gubler (from the cast of Criminal Minds) who is also a native of Las Vegas.\n\nThe music video starts in a desert with a puppet version of Flowers and a puppet version of Santa in a puppet theater in Santa's trailer. Then, Santa pops up to say his part &quot;I've got a bullet in my gun!&quot; It goes to Flowers tied up in a chair with Christmas tree trimmings and Santa running around him. Later on, Flowers is tied up in Santa's car with Santa driving. It then goes back to the Santa's trailer with Flowers still tied up in a chair watching Santa dig up his grave. The band come up behind 3 small trees, break the trimmings, and escape in Santa's car, trailing him behind. Santa ends up covering up Flowers' puppet, and goes to the band (in puppet form) holding up a sign saying, 'Merry Christmas from The Killers'.\n\nThe role of Santa (both singing, and acting in the music video) is performed by Ryan Pardey. He performed this song live, with the band, at KROQ Almost Acoustic Christmas in December 2007. He and Flowers were shown dancing together on stage, and he soaked Flowers with a water-gun. The Killers have written a song about Pardey called &quot;Questions With the Captain&quot;. The song appears as a hidden track on the end of their B-sides album Sawdust, but can only be found on the CD.\n\nThe Killers are an American alternative rock band from Las Vegas, Nevada, formed in 2002. The band consists of Brandon Flowers (vocals, keyboards, synths), Dave Keuning (guitar, backing vocals), Mark Stoermer (bass guitar, backing vocals) and Ronnie Vannucci Jr. (drums, percussion).\n\nPart of the post-punk revival movement, The Killers draw their influences from music styles of the 1980s. The group's debut album, Hot Fuss (2004) brought the band mainstream success. The Killers' second album, Sam's Town, was released in 2006, and the compilation album Sawdust containing B-sides, rarities, and new material, was released in 2007. Their third studio album, Day &amp; Age, produced by Stuart Price, was released in 2008.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:cebc51149bde360b53bb6fd5b1ad8d67e3e018bf","amp;dn":"The+Killers+-+Don%5C%27t+Shoot+Me+Santa++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cebc51149bde360b53bb6fd5b1ad8d67e3e018bf","infoHashBuffer":{"type":"Buffer","data":[206,188,81,20,155,222,54,11,83,187,111,213,177,173,141,103,227,224,24,191]},"announce":[],"urlList":[]}}