{"title":"Xilisoft Video Converter Ultimate 5.1.26.1211","uid":5247846,"size":16742492,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:cf84afef57c41f2733bc1a7108747d1011ae3d42&amp;dn=Xilisoft+Video+Converter+Ultimate+5.1.26.1211&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"funxplore","files":7,"time":1262226802,"description":"Xilisoft Video Converter is easy, fast, reliable, and loaded with features. It's capable of converting videos of all popular formats like AVI, MPEG, WMV, DivX, MP4, H.264/AVC, AVCHD, MKV, RM, MOV, XviD, 3GP, and audio MP3, WMA, WAV, RA, M4A, AAC, AC3, OGG. Now you can convert video, audio, and animated images to play on your PSP, PS3, iPod, iPhone, Apple TV, Xbox and other digital multimedia devices. All made possible with Xilisoft Video Converter. \nConvert HD and SD video formats \nConvert between audio formats: MP3, WMA, WAV, AAC and so on \nConvert video to iPod, iPhone, PSP, PS3, Xbox, mobile phone, MP4 players \nEdit video, clip, merge, split, add watermark and special effects\nHigh definition, fast speed and expert conversion \nSo enormous video, audio and picture formats supported beyond your imagination\nHigh-Definition video converter\nServed with a wide range of High-Definition video formats, the video converter enables you to convert video between multiform High-Definition movies, such as H.264/MPEG-4 AVC, AVCHD Video (*.m2ts, *.mts), Apple TV h.264 720P, MKV, HD WMV, MPEG2/MPEG-4 TS HD Video, etc., as well as convert video from High-Definition to Standard-Definition for watching.\nSuper high speed to convert video\nThe video converter can detect your CPU automatically and supports multi-core CPU for a single task, it not only can help you convert files at high speed but will also improve the speed of which the video conversion takes place.\nVideo and audio conversion\nNo matter whether you are converting between multifarious video formats, convert AVI, MPEG, WMV, DivX, MP4, H.264/AVC, MKV, RM, MOV, XviD, 3GP, FLV, or mutually transforming among MP3, WMA, WAV, RA, M4A, AAC, AC3, MP2, OGG and so on, or extracting any audio format from your video, it can all be done with just a few clicks.\nTransformation between video and pictures\nProduce a creative video from your favourite photos within minutes, or create a picture collection from your movies or fun videos as souvenir/memento, to view and enjoy them with your friends and family at your fingertips.","torrent":{"xt":"urn:btih:cf84afef57c41f2733bc1a7108747d1011ae3d42","amp;dn":"Xilisoft+Video+Converter+Ultimate+5.1.26.1211","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf84afef57c41f2733bc1a7108747d1011ae3d42","infoHashBuffer":{"type":"Buffer","data":[207,132,175,239,87,196,31,39,51,188,26,113,8,116,125,16,17,174,61,66]},"announce":[],"urlList":[]}}