{"title":"A Historia de Ester EP01 - SDTV Nacional 2010 - 350mb - by ACMB","uid":5410004,"size":366322240,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:cfc5914c120f740d19b5c788a53939b423a44bb2&amp;dn=A+Historia+de+Ester+EP01+-+SDTV+Nacional+2010+-+350mb+-+by+ACMB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"acmb2","files":4,"time":1267726319,"description":"Desde a morte na guerra atÃƒÂ© a procura de uma rainha\n\nMorte na guerra\n \nAbial (Juan Alba)  e Lia (CÃƒÂ¡ssia Linhares) contam para a filha Hadassa (Gabriela Durlo) como ÃƒÂ© JerusalÃƒÂ©m, a terra prometida aos judeus. Enquanto isso, nas ruas de SusÃƒÂ£, soldados amalequitas surpreendem judeus, que correm e gritam desesperados. Muitos judeus morrem no ataque. Mordecai (Ewerton de Castro) foge apavorado. Hadassa escuta atentamente seus pais contarem histÃƒÂ³rias sobre o templo sagrado e o rei Davi, quando Mordecai os interrompe e avisa que os amalequitas invadiram a cidade. Abiail, Hadassa, Lia e Mordecai fogem apavorados. Eles acabam sendo encurralados por soldados amalequitas. Um guerreiro acerta um golpe em Abiail, que cai morto. Uma flecha atinge Lia. Hadassa sofre ao ver a mÃƒÂ£e sangrando e chora apavorada. Lia pede que a filha tenha sempre orgulho do povo judeu e morre nos seus braÃƒÂ§os. Mordecai salva Hadassa de ser atingida por um guerreiro. \n \nAnos depois...\n \nHadassa acorda do pesadelo, jÃƒÂ¡ com vinte anos. Mordecai a consola. Ela chama o primo para se mudarem para JerusalÃƒÂ©m, mas Mordecai diz que ainda nÃƒÂ£o ÃƒÂ© a hora. Ela pede para ir sozinha e revela que era um sonho de seus pais partir para a Terra Prometida. Mordecai pede ao amigo Joel (Giuseppe Oristanio) que leve Hadassa com sua famÃƒÂ­lia.\nHadassa conta histÃƒÂ³ria para algumas crianÃƒÂ§as, quando vÃƒÂª Ana (LetÃƒÂ­cia Colin) passando mal. Ana se anima ao saber que o rei e seus guardas irÃƒÂ£o passar pela rua, jÃƒÂ¡ que estÃƒÂ¡ apaixonada pelo soldado Aridai (Paulo Nigro). Hadassa acompanha a amiga. Simion (MaurÃƒÂ­cio Ribeiro) passa pela multidÃƒÂ£o para chegar ao palÃƒÂ¡cio. Ruben (Marcio Kieling) zomba do amigo, mas fica enfeitiÃƒÂ§ado ao ver Hadassa.\n \nA forÃƒÂ§a de Assuero\n \nA cidade de SusÃƒÂ£ nunca reunira tantas culturas diferentes no comando de um ÃƒÂºnico rei, Assuero (Marcos Pitombo).O rei Assuero desfila em seu cavalo com a comitiva. Todos se curvam ao rei. Hadassa fica fascinada com a beleza de Assuero, mas vÃƒÂª sua aluna atravessando a rua e quase sendo atropelada pelos cavalos da comitiva. Num impulso, a pega do chÃƒÂ£o. Soldados se aproximam com lanÃƒÂ§as e espadas. Assuero, no entanto, tem uma intensa troca de olhares com Hadassa. Ele manda os soldados se afastarem. MemucÃƒÂ£ (Paulo Figueiredo) discursa para o povo a favor de Assuero, enquanto a comitiva distribui jÃƒÂ³ias e objetos de valor para os sÃƒÂºditos. Ana e Aridai tambÃƒÂ©m trocam olhares. Rebecca (Eliete Cigarini) observa a filha e fica indignada ao perceber a paquera. Joel e Mordecai nÃƒÂ£o se curvam diante da comitiva do rei. Ana segue em direÃƒÂ§ÃƒÂ£o ao encontro com Aridai, mas ÃƒÂ© interceptada pelos pais. HamÃƒÂ£ (Paulo Gorgulho) manda Mordecai se ajoelhar, mas ele se nega. HamÃƒÂ£ acerta o judeu com um golpe, que cai sangrando. Joel socorre o amigo. Ana aproveita para ir ao encontro de Aridai. Rebecca a segue. Aridai e Ana se beijam e sÃƒÂ£o flagrados por Rebecca. Para que a mÃƒÂ£e nÃƒÂ£o conte nada a Joel, Ana promete nunca mais se encontrar com Aridai. Harbona (Rocco Pitanga) avisa a rainha Vasti (Daniela Galli) que Assuero pede sua presenÃƒÂ§a. HamÃƒÂ£ fica furioso com Mordecai. Dalfom (Gabriel Gracindo) instiga ainda mais o ÃƒÂ³dio do pai. Zeres (Vanessa Gerbelli) pede que o marido se acalme e diz que depois que ele for nomeado imperador, HamÃƒÂ£ poderÃƒÂ¡ fazer Mordecai se curvar a ele. HamÃƒÂ£ e Dalfom apoiam a ideia de Zeres.\n \nÃƒâ‚¬ procura de uma rainha\n \nSimion e Harbona organizam o palÃƒÂ¡cio para o banquete do rei. MemucÃƒÂ£ parabeniza Assuero, que pretende atacar a GrÃƒÂ©cia. Vasti avisa Assuero que darÃƒÂ¡ um jantar para as mulheres dos prÃƒÂ­ncipes do reino. Hadassa aconselha Mordecai a nÃƒÂ£o ir ao banquete oferecido pelo rei. Ruben tambÃƒÂ©m fica decepcionado ao saber que Hadassa irÃƒÂ¡ para JerusalÃƒÂ©m com a famÃƒÂ­lia de Joel. O palÃƒÂ¡cio estÃƒÂ¡ cheio de convidados para o banquete oferecido por Assuero. Ruben pede a mÃƒÂ£o de Hadassa a Mordecai, que fica feliz, mas diz que a sobrinha ÃƒÂ© quem tem que escolher. Todos os convidados se curvam diante do rei. Simion prova a bebida e a comida antes do rei. Os convidados clamam pela presenÃƒÂ§a da beleza de rainha Vasti. Assuero manda Harbona chamar a rainha. Vasti festeja com as mulheres dos prÃƒÂ­ncipes enquanto Zeres joga a sorte e diz que sua vida terÃƒÂ¡ muitas mudanÃƒÂ§as. Ela diz que os deuses mandaram a rainha seguir sua intuiÃƒÂ§ÃƒÂ£o. Diante disso, ela recusa o convite do rei. HamÃƒÂ£ escuta Harbona contando para Assuero que Vasti se recusa a vir e espalha para os convidados. Todos ficam indignados. Incentivado por MemucÃƒÂ£ e HamÃƒÂ£, Assuero decide destituir Vasti do trono. Vasti fica revoltada ao saber da decisÃƒÂ£o do rei. Ela tambÃƒÂ©m discute com Zeres, que foi quem a mandou seguir sua intuiÃƒÂ§ÃƒÂ£o. HamÃƒÂ£, entÃƒÂ£o, pede que Assuero reÃƒÂºna todas as virgens do reino a fim de escolher a nova rainha. Ao ouvir a novidade, Mordecai e Ruben se desesperam. Joel fica revoltado ao saber que sua filha poderÃƒÂ¡ ser levada pra o harÃƒÂ©m. ComeÃƒÂ§a um tumulto. Rebecca tenta evitar que Ana seja levada, mas os guardas a arrastam dali. Mordecai pede que Hadassa se esconda, mas soldados invadem sua casa e ameaÃƒÂ§am matÃƒÂ¡-lo. Hadassa aparece e se entrega, salvando a vida de Mordecai.\n","torrent":{"xt":"urn:btih:cfc5914c120f740d19b5c788a53939b423a44bb2","amp;dn":"A+Historia+de+Ester+EP01+-+SDTV+Nacional+2010+-+350mb+-+by+ACMB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cfc5914c120f740d19b5c788a53939b423a44bb2","infoHashBuffer":{"type":"Buffer","data":[207,197,145,76,18,15,116,13,25,181,199,136,165,57,57,180,35,164,75,178]},"announce":[],"urlList":[]}}