{"title":"Windows Codename Longhorn","uid":5257636,"size":14114107352,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:cff3cb2cf6f2097efb638f9ef413ca3c75f8d823&amp;dn=Windows+Codename+Longhorn&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"iMarc222","files":82,"time":1262627076,"description":"Development of Windows Vista occurred over the span of five and a half years, starting in earnest in May 2001,[1] prior to the release of Microsoft's Windows XP operating system, and continuing until November 2006.\n\nMicrosoft originally expected to ship the new version sometime late in 2003 as a minor step between Windows XP (codenamed &quot;Whistler&quot;) and Windows 7 (codenamed &quot;Blackcomb&quot; and &quot;Vienna&quot;). Vista's original codename, &quot;Longhorn&quot;, was an allusion to this plan: While Whistler and Blackcomb are large ski resorts in British Columbia, Longhorn is the name of a bar between the two mountains that Whistler's visitors pass to reach Blackcomb. Gradually, &quot;Longhorn&quot; assimilated many of the important new features and technologies slated for &quot;Blackcomb&quot;, resulting in the release date being pushed back a few times. Many of Microsoft's developers were also re-tasked with improving the security of Windows XP. Faced with ongoing delays and concerns about feature creep, Microsoft announced on August 27, 2004 that it was making significant changes. &quot;Longhorn&quot; development basically started afresh, building on the Windows Server 2003 codebase, and re-incorporating only the features that would be intended for an actual operating system release. Some previously announced features, such as WinFS and NGSCB, were dropped or postponed.\n\nAfter &quot;Longhorn&quot; was named Windows Vista in mid-2005, an unprecedented beta-test program was started which involved hundreds of thousands of volunteers and companies. Between September 2005 and October 2006, Microsoft released regular Community Technology Previews (CTP) to beta testers, and two release candidates to the general public. Development of Windows Vista came to a conclusion with the November 8, 2006 announcement of its completion by co-president of Windows development, Jim Allchin.\t","torrent":{"xt":"urn:btih:cff3cb2cf6f2097efb638f9ef413ca3c75f8d823","amp;dn":"Windows+Codename+Longhorn","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cff3cb2cf6f2097efb638f9ef413ca3c75f8d823","infoHashBuffer":{"type":"Buffer","data":[207,243,203,44,246,242,9,126,251,99,143,158,244,19,202,60,117,248,216,35]},"announce":[],"urlList":[]}}