{"title":"HD VideoConverteR MutiLinguaL PubLIsher LIcenCe","uid":5254958,"size":16396658,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d00022b4f58115b8989e0cd95645005d0df522f1&amp;dn=HD+VideoConverteR+MutiLinguaL+PubLIsher+LIcenCe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"BenHardn","files":-1,"time":1262517592,"description":"HD Video Converter\n\nHervorragender, einfach zu handhabender Video Converter, die alle gÃƒÂ¤ngigen Video- und Audioformate mit hoher Geschwindigkeit konvertiert.\n\n    * High-Definition und hohe Geschwindigkeit\n      UnterstÃƒÂ¼tzt die Konvertierung von HD-Videos, einschlieÃƒÅ¸lich H.264/AVC, TS, AVCHD, MKV usw. Batch-Konvertierung und Multithreading erlauben hohe Konvertierungsgeschwindigkeit (400% schneller) als Folge von mehradriger CPU-UnterstÃƒÂ¼tzung.\n    * FÃƒÂ¤rben Sie Ihre Videos nach Ihren WÃƒÂ¼nschen\n      Schneiden Sie an Ihren Videos, fÃƒÂ¼gen artistische Effekte und Wasserzeichen hinzu, um dadurch noch perfektere Videos zu erhalten. Splitten Sie Videos, bestimmen Sie Video-GrÃƒÂ¶ÃƒÅ¸e und Bitrate, wÃƒÂ¤hlen Sie verschiedene Parameter fÃƒÂ¼r die Konvertierung und erhalten so ein Video nach Ihren WÃƒÂ¼nschen.\n    * GenieÃƒÅ¸en Sie Ihre Video-Konvertierung\n      Viele Multimedia-GerÃƒÂ¤te wie iPod, Apple TV, PSP, PS3, Xbox usw. werden unterstÃƒÂ¼tzt. CPU wird automatisch entdeckt und arbeitet mit hÃƒÂ¶chster Geschwindigkeit. Arbeitet im Hintergrund und After-Done-Aktionen erleichtern Ihnen die Arbeit.\n\n\n\n\nHD Video Converter\n\nExcellent, easy-to-use video converter, all popular video and audio formats with high conversion speed.\n\n    * High-definition and high speed\n      Support the conversion of HD video, including H.264/AVC, TS, AVCHD, MKV, etc. Batch conversion and multithreading to allow high conversion rate (400% faster) as a result of multi core CPU support.\n    * Color your videos to your needs\n      Trim your videos, add artistic effects and watermarks, to get this more perfect videos. They split videos, you can determine video size and bit rate, select different parameters for the conversion and then get a video to your liking.\n    * Enjoy your video conversion\n      Many multimedia devices like iPod, Apple TV, PSP, PS3, Xbox, etc. are supported. CPU is automatically detected and is working at top speed. Works in the background and after-Done actions make your job easier.","torrent":{"xt":"urn:btih:d00022b4f58115b8989e0cd95645005d0df522f1","amp;dn":"HD+VideoConverteR+MutiLinguaL+PubLIsher+LIcenCe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d00022b4f58115b8989e0cd95645005d0df522f1","infoHashBuffer":{"type":"Buffer","data":[208,0,34,180,245,129,21,184,152,158,12,217,86,69,0,93,13,245,34,241]},"announce":[],"urlList":[]}}