{"title":"Bonelab 1.4.0.5","uid":5316727,"size":15129442,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d104c0ec19dec283bf660ae6d624b7e1b2ce6e3e&amp;dn=Bonelab+1.4.0.5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"soulshade777","files":1,"time":1264735779,"description":"This is not my torrent. I took downloaded it from mukatat3, whom I don't know. Basically I am a student that would like to see a greater spread of educational programs like this one. I happen to study bones, and this is an elegant program. I am unsure whether this is the full version or not. I downloaded the trail, and the size differs (heavier on the trail version). This seems to be fully functional, and it is clean (Tested in linux virtualbox windows 7 &amp; eset smart security 4). If you discover this is not the full version, leave a note. If you know where the full version might be for this, bonelab II or anatomylab II, leave a note please. \n\nBoneLab is a teaching, learning and presentation tool for the anatomy of the human skeleton. BoneLab is suitable for secondary level school education, pre-university education and patient education. It is used by many High School teachers in various countries. BoneLab is a program for Microsoft Windows.\n\n With its rapid access to colorized 3D-views and the emphasis on interactivity, this application helps to develop and facilitate the students interest in the fascinating subjects of human anatomy. BoneLab is both suitable for interactive whiteboards, and active exploration on the PC.\n\nDesigned for creative interaction, 210 build-in 3D views can be  explored and students can create their own illustrations by adding name labels and save it as custom view. Due to a new auto-navigation method, additional views can be quickly assembled by combining stored views as easy as a set of building blocks.\n\nClicking a bone provides instant online information from Wikipedia via the integrated online browser window.\n\nThe option to search views for a given bone name and an automatically maintained dictionary of name labels are in addition helpful to facilitate a quick, basic understanding of the anatomy of the human skeleton.\n\n    *\n\n      A skeletal model with 275 parts of bones, teeth and cartilage is integrated.\n    *\n\n      Optional addition of custom annotations and comments.\n    *\n\n      Optional auto-colorization for instant visual identification.\n    *\n\n      Multilingual support for Deutsch, English, EspaÃƒÂ±ol, FranÃƒÂ§ais  Italiano and PortuguÃƒÂªs.\n    *\n\n      All bones are stored with correct Latin and local language names.\n    *\n\n      Recalling of previous views via undo/redo commands.\n","torrent":{"xt":"urn:btih:d104c0ec19dec283bf660ae6d624b7e1b2ce6e3e","amp;dn":"Bonelab+1.4.0.5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d104c0ec19dec283bf660ae6d624b7e1b2ce6e3e","infoHashBuffer":{"type":"Buffer","data":[209,4,192,236,25,222,194,131,191,102,10,230,214,36,183,225,178,206,110,62]},"announce":[],"urlList":[]}}