{"title":"Howard Stern - Staff Revelation Game 2006","uid":5261409,"size":1098868736,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:d25773b0affb0364dd9405bd1e12660c8ab0d29c&amp;dn=Howard+Stern+-+Staff+Revelation+Game+2006&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1262744620,"description":"Staff Revelations: 01/09/06. 8:00am - Thanks to Marksfriggin\n\nRevelation time! Howard decided to hold off on the press conference to do the big revelation part of the show. He's been talking about doing this for months. Everyone on the show told Will a story about their life that no one has ever heard. Will Murray was the one who heard all of the stories and kept them secret until now. \n\nHoward was going to read the revelations himself. He saw that there were 11 total revelations and no one was going to know who they belonged to. The people participating in the Revelation are... Howard, Robin, Fred, Artie, Benjy, JD, Gary, Sal, Richard, Scott the Engineer and Jason. Here are the revelations... \n\n1) I cheated on my wife and she caught me. \n2) I once hid in a bathroom closet and pleasured myself as my family members went to the bathroom. \n3) In the last year I got a girl pregnant and had to pay for her abortion. \n4) I think I'm addicted to porn, I jerk off twice a day and prefer to masturbate, rather than having real sex. \n5) I have spent well over $10,000 on internet porn. \n6) My buddy and I once ordered massage girls but they ripped us off and left us staring at each other in our underwear. \n7) I have pleasured myself with meat and vegetables. \n8) I have a half sister I have never met and don't want to. \n9) I've had cosmetic surgery. \n10) A guy once blew his load on my chest. \n11) I once had my stomach pumped for alcohol poisoning and when I woke up, an acquaintance of the same sex was fondling me. \n\nThen cut to a week later when the revelations are revealed.","torrent":{"xt":"urn:btih:d25773b0affb0364dd9405bd1e12660c8ab0d29c","amp;dn":"Howard+Stern+-+Staff+Revelation+Game+2006","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d25773b0affb0364dd9405bd1e12660c8ab0d29c","infoHashBuffer":{"type":"Buffer","data":[210,87,115,176,175,251,3,100,221,148,5,189,30,18,102,12,138,176,210,156]},"announce":[],"urlList":[]}}