{"title":"Nordwand_(North Face)_German dvd rip_2CDs","uid":5369129,"size":943030200,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d2613720fc59011cbb8730317e2dab9fba07cfd1&amp;dn=Nordwand_%28North+Face%29_German+dvd+rip_2CDs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Dromi","files":3,"time":1266364798,"description":"Synopsis\nA handful of men set aside their differences to conquer one of Europe's tallest mountains in this period drama inspired by a true story. In 1936, Nazi Germany is looking to shore up its reputation in the eyes of the world, and after a pair of German climbers dies in an effort to climb the North face of the Eiger in the Swiss Alps, the state is looking to find another group who can succeed where the earlier team failed. Henry Arau (Ulrich Tukur), the publisher of one of Berlin's biggest newspapers, is a loyal son of the Third Reich, and when his editorial secretary, Luise Fellner (Johanna Wokalek), tells him she knows some climbers who would be willing to take on the Eiger, Tukur gives her a free hand to assemble a team and make this dream a reality. Close friends Toni Kurz (Benno FÃƒÂ¼rmann) and Andi Hinterstoisser (Florian Lukas) are serving in the German army when Fellner (who once dated Kurz) tries to persuade them to climb the Eiger. While Hinterstoisser is willing to take the risk in the name of patriotism, Kurz is cynical about the Third Reich and says he'll put his life on the line only for his own reasons and not to please Germany's leaders. Kurz and Hinterstoisser finally begin the climb in mid-summer, only to discover that a pair of Austrians, Willy Angerer (Simon Schwarz) and Edi Rainer (Georg Friedrich), are now challenging them in a race to the top. Nordwand (aka North Face) was an official selection at the 2008 Locarno Film Festival. ~ Mark Deming, All Movie Guide\n\nFrame: 480x272\nTotal Bitrate: 130kbps\nFormat: avi","torrent":{"xt":"urn:btih:d2613720fc59011cbb8730317e2dab9fba07cfd1","amp;dn":"Nordwand_%28North+Face%29_German+dvd+rip_2CDs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2613720fc59011cbb8730317e2dab9fba07cfd1","infoHashBuffer":{"type":"Buffer","data":[210,97,55,32,252,89,1,28,187,135,48,49,126,45,171,159,186,7,207,209]},"announce":[],"urlList":[]}}