{"title":"HyperCam [v2.16.03]","uid":5224746,"size":993697,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:d292166ad2e70965593c45ffccec3f8856e7fbf8&amp;dn=HyperCam+%5Bv2.16.03%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ICProfits","files":3,"time":1261073420,"description":"HyperCam v2.16.03 is powerful video capture software that records AVI movies (screencam) directly from your monitor, for software presentations, software training, demos, tutorials, and fun! HyperCam supports text annotations, sound, and screen notes (great for creating automated software demos!). You can also select Frame rate and compression quality prior to video capture. Compatible with 32 bit and 64 bit releases of Windows 7, Vista, XP, 2000, NT4, ME and Windows 98. Please note that HyperCam is not intended for re-recording of other video clips from the screen (e.g. playing in Media Player, RealVideo, QuickTime etc.), but rather for creating regular software presentations, tutorial, demos etc.\n\nFeatures:\n System-wide hot keys to start, pause, stop recording, and to snap single frames\n Easy precision visual screen area or window selection\n Unique panning mode lets your area follow your cursor\n Multiple video compression choices\n Optionally annotate your movies with pop-up text boxes, when recording\n Optional sound, with choices for recording quality\n Capture in any screen color depth\n Automatically incrementing file names for captures\n Frame rate, compression, and key frame choices\n Convenient, user-definable hot keys, including record pause\n Integrated playback buttons\n Mouse cursor recording can be turned on or off, true shape of the cursor is recorded\n Optional &quot;starburst&quot; recording on mouse click, customized for size, color and duration\n Optional recording of mouse sound clicks","torrent":{"xt":"urn:btih:d292166ad2e70965593c45ffccec3f8856e7fbf8","amp;dn":"HyperCam+%5Bv2.16.03%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d292166ad2e70965593c45ffccec3f8856e7fbf8","infoHashBuffer":{"type":"Buffer","data":[210,146,22,106,210,231,9,101,89,60,69,255,204,236,63,136,86,231,251,248]},"announce":[],"urlList":[]}}