{"title":"Corel Draw Graphic Suite X4 NL","uid":5376714,"size":386160654,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d33a8772c1a66bd72abf9aae0536b94c9d21e0f1&amp;dn=Corel+Draw+Graphic+Suite+X4+NL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SurfdragonNL","files":1,"time":1266595038,"description":"Hey guys!\n\nWhile browsing the web I found out there was no decent upload of CorelDraw Graphic Suite X4 in Dutch available anywhere.\n\nSince CorelDraw Graphic Suite X4 is available in 17 languages I should be able to find more than just English and Portugese, yet no luck with the provided activators.\n\nNow here's some funny part... there is no need at all to activate CorelDraw Graphic Suite X4... They use protexis, a 3rd party piece of software to check if you've been activated. So I went on searching and found the right crack. In other words: there's just one .dll we replace and the trial of 15 days just never expires!\n\nThe CorelDraw Graphic Suite X4 in this upload is in DUTCH and is NOT a multilingual version. The crack can be used for any language though, but I'll create another torrent for that.\n\n--------------------------------------------------------------------\n\nHallo daar!\n\nTerwijl ik over het web aan 't surfen was kwam ik er achter dat er niet ÃƒÂ©ÃƒÂ©n goede CorelDraw Graphic Suite X4 in Nederlands beschikbaar was.\n\nAangezien CorelDraw Graphic Suite X4 in 17 talen beschikbaar is zou ik toch meer moeten kunnen vinden dan alleen Engels en Portugees, maar allemaal zonder de juiste activatie. \n\nNu komt 't leuke gedeelte: je hoeft CorelDraw Graphic Suite X4 helemaal niet te activeren! Ze gebruiken Protexis, een extra stukje software dat controleert of je geactiveerd bent. Dus ik zocht nog eens verder en kwam er achter dat de juiste crack er al is. Met andere woorden: we vervangen ÃƒÂ©ÃƒÂ©n .dll en de probeerversie verloopt gewoon nooit!\n\nDe CorelDraw Graphic Suite X4 in deze upload is in NEDERLANDS en is GEEN meertalige versie. De crack kan je wel in elke taal gebruiken. Ik zal die ook in een andere torrent uploaden.\n\n\n\n\nVeel plezier! \nHave fun!\n\n\n\n","torrent":{"xt":"urn:btih:d33a8772c1a66bd72abf9aae0536b94c9d21e0f1","amp;dn":"Corel+Draw+Graphic+Suite+X4+NL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d33a8772c1a66bd72abf9aae0536b94c9d21e0f1","infoHashBuffer":{"type":"Buffer","data":[211,58,135,114,193,166,107,215,42,191,154,174,5,54,185,76,157,33,224,241]},"announce":[],"urlList":[]}}