{"title":"Missus Beactly-Nara Ast Incense(1970)","uid":5317307,"size":90895563,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d34d72892e0139aff0a712153ecd57a455cb2eaf&amp;dn=Missus+Beactly-Nara+Ast+Incense%281970%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dr.hass","files":10,"time":1264760004,"description":"Missus Beastley were among the earliest bands of the new progressive rock wave, being foundedin Herford in 1968, recorded their debut album in January 1970 with Hansi Fischer (flute, fromXhol, later Embryo) and Dieter Serfas (pereussion, from Amon Duul II). This was a glimpse intoearly German underground jazz-rock with lots of flute, psychedelic organ and guitars.\n\nThe bandcould be compared to Xhol and Embryo. Soon after the recordings finished, Missus Beastleyexpanded to become a sextet with Paul Vincent and Michael Scholz. Half a year later, Vincentwas replaced by Roman Bunka and a seventh member, Jurgen Benz, joined. By the end of theyear, the band were bankrupt and their activities terminated. Nothing more was heard fromMissus Beastley until Autumn 1973, when reformed the band and went on tour in Germany.\n\nThisquintet (D) also recorded an album for Nova in 1974, containing a slick, funky jazz-rock, totallydifferent to the previous album. Lutz Oldemeier and Miekautsch left in 1975 to be replaced byButze Fischer and Burkard Schmidt. In the interim, Jim McGillivray of Epitaph drummed threemonths for Missus Beastley. Along with Embryo, Ton Steine Scherben and Sparifankal, MissusBeastley founded the independent record company April.\n\nLutz Oldemeier - Drums, Percussion\nAtzen Weihmeyer - Guitar, Vocals\nWolfgang Nickel - Organ, Piano, Vocals\nPedja Hofmann - Bass, Vocals\nHansi Fischer - Flute\nDeiter Serfas - Drums","torrent":{"xt":"urn:btih:d34d72892e0139aff0a712153ecd57a455cb2eaf","amp;dn":"Missus+Beactly-Nara+Ast+Incense%281970%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d34d72892e0139aff0a712153ecd57a455cb2eaf","infoHashBuffer":{"type":"Buffer","data":[211,77,114,137,46,1,57,175,240,167,18,21,62,205,87,164,85,203,46,175]},"announce":[],"urlList":[]}}