{"title":"Star Wars [Fate of the Jedi 2] Omen by Christie Golden[PDF.Doc.T","uid":5199820,"size":2149260,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d3c5cc7e78385dc1489730ae74551896019a9778&amp;dn=Star+Wars+%5BFate+of+the+Jedi+2%5D+Omen+by+Christie+Golden%5BPDF.Doc.T&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"GMD-JEDI","files":-1,"time":1260104557,"description":"Star Wars - Fate of the Jedi - Omen Ebook in\nPDF, DOC (M$ Word) and Txt formats\n\nThe Jedi Order is in crisis. The late Jacen Solo's shocking transformation into murderous Sith Lord Darth Caedus has cast a damning pall over those who wield the Force for good: Two Jedi Knights have succumbed to an inexplicable and dangerous psychosis, criminal charges have driven Luke Skywalker into self-imposed exile, and power-hungry Chief of State Natasi Daala is exploiting anti-Jedi sentiment to undermine the Order's influence within the Galactic Alliance.\n\nForbidden to intervene in Jedi affairs, Luke is on a desperate mission to uncover the truth behind Jacen's fall to the dark side -- and to learn what's turning peaceful Jedi into raving lunatics. But finding answers will mean venturing into the mind-bending space of the Kathol Rift, and bargaining with an alien species as likely to destroy outsiders as deal with them. Still, there is no other choice and no time to lose, as the catastrophic events on Coruscant continue to escalate. Stricken by the same violent dementia that infected her brother, Valin, Jedi Knight Jysella Horn faces an equally grim fate after her capture by Natasi Daala's police. And when Han and Leia Solo narrowly foil another deranged Jedi bent on deadly destruction, even acting Jedi Grand Master Kenth Hamner appears willing to bow to Daala's iron will -- at the expense of the Jedi Order.\n\nBut an even greater threat is looming. Millennia in the past, a Sith starship crashed on an unknown, low-tech planet, leaving the survivors stranded. Over the generations, their numbers have grown, the ways of the dark side have been nurtured, and the time is fast approaching when this lost tribe of Sith will once more take to the stars to reclaim their legendary destiny as rulers of the galaxy. Only one thing stands in their way to dominance, a name whispered to them through the Force: Skywalker. \n\n\n\nvvvvvvvvvvvvvvvvvvvvvvvv\n&gt;                      &lt;         \n&gt; w w w                &lt;\n&gt;   ExtraTorrent       &lt;\n&gt;               com    &lt;\n^^^^^^^^^^^^^^^^^^^^^^^^","torrent":{"xt":"urn:btih:d3c5cc7e78385dc1489730ae74551896019a9778","amp;dn":"Star+Wars+%5BFate+of+the+Jedi+2%5D+Omen+by+Christie+Golden%5BPDF.Doc.T","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3c5cc7e78385dc1489730ae74551896019a9778","infoHashBuffer":{"type":"Buffer","data":[211,197,204,126,120,56,93,193,72,151,48,174,116,85,24,150,1,154,151,120]},"announce":[],"urlList":[]}}