{"title":"Phantom's Ultimate Rare Porn Sampler","uid":5222988,"size":812684474,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:d6d734bba866dc99a5738f19d304b6f526b45b74&amp;dn=Phantom%5C%27s+Ultimate+Rare+Porn+Sampler&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Sothis333","files":1,"time":1261003643,"description":"PHANTOM'S ULTIMATE RARE PORN SAMPLER - Back in the 90's mail order video pirates like Threat Theatre, Phantom Video and others would track down the rarest most out of control adult/sleaze films from all over the world. A compilation was put together some years back and the result is an amazing around the world display of human sexuality that is off the charts. This very rare volume has clips from damn near impossible to find adult films from Europe, Japan and the U.S. Clips from: &quot;The Kinky Kamerman's Vulgar Vacation Series, Our Naughty Niece, Sex Match of the Century, S&amp;M Torture Freaks,  Lady Gourmet (eye opening), Martina - Queen of the Sluts, Captured Prisoner 2, Ultimate Fantasy of Rape, Two at Once, Exhibitionist Slaves, Bondage Desire, Beyond the Edge of Depravity, Tales of Naked Humiliation and more. 2 full hours. Just about every form of sexuality is in this rare compilation. Quality varies from segment to segment as this was taken from a decade old VHS but overall is pretty good. Over the top gang!\n\nNote: All films in this sampler were made prior to July 1995 and are therefore exempt from the requirements of 18 USC section 2257 and CFR 75.","torrent":{"xt":"urn:btih:d6d734bba866dc99a5738f19d304b6f526b45b74","amp;dn":"Phantom%5C%27s+Ultimate+Rare+Porn+Sampler","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6d734bba866dc99a5738f19d304b6f526b45b74","infoHashBuffer":{"type":"Buffer","data":[214,215,52,187,168,102,220,153,165,115,143,25,211,4,182,245,38,180,91,116]},"announce":[],"urlList":[]}}