{"title":"Antenna Web Design Studio v3.3 (Build 176)","uid":5204976,"size":19353420,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d798f838573de64b7425898869386aafa044bbb7&amp;dn=Antenna+Web+Design+Studio+v3.3+%28Build+176%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tikkua","files":-1,"time":1260335956,"description":"Antenna enables you to make great looking web sites rapidly. Create a professional web site to promote yourself or your company. Publish your site online or distribute on CD as an interactive CV. Be seen - make a good impression - get noticed!\n\nYou can create your own web pages and digital photo galleries in minutes, without any HTML knowledge. Antenna's powerful editor is entirely visual, and pixel accurate - putting you in control. Wherever you drag &amp; drop text, pictures, buttons, flash animation and movies on the page, that's exactly where they will appear in the web browser.\n\nWhen you are ready to publish your site, you won't need to buy any additional software - Antenna has its own publisher built in, and it can be set to publish changes only, so you can update your site very quickly.\n\nYou can also create smooth gradient backgrounds and attractive glossy buttons without switching between applications - it's all built in! Give yourself a competitive edge and dip your toes into the international scene at any time - make any part of your web site multilingual. And if you need a hand there's a set of free online tutorials and expert tips, a comprehensive 100 page fully illustrated User Guide and free technical support.\n\n\n\nInstall Info:\n\nJust run the EXE setup and install Antenna Web Design Studio (don't let Antenna Web Design Studio run after install)\n\nNext click on the Serial's button and Click on 1 of the button's With the name's on it (only 1) to register under that name it will atomically Register Antenna Web Design Studio for you. \n\nNow you are done close the setup and test out the program.\n\nHave fun  ","torrent":{"xt":"urn:btih:d798f838573de64b7425898869386aafa044bbb7","amp;dn":"Antenna+Web+Design+Studio+v3.3+%28Build+176%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d798f838573de64b7425898869386aafa044bbb7","infoHashBuffer":{"type":"Buffer","data":[215,152,248,56,87,61,230,75,116,37,137,136,105,56,106,175,160,68,187,183]},"announce":[],"urlList":[]}}