{"title":"Britney Spears - Womanizer   (2nafish)","uid":5353836,"size":133761028,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:d7ae94ff1313ae1eae50e3a1d46d43aa08296826&amp;dn=Britney+Spears+-+Womanizer+++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1265876418,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos.\n\n\n&quot;Womanizer&quot; is a song by American recording artist Britney Spears from her sixth studio album Circus. It was released on September 26, 2008 by Jive Records as the first single of the album. The song, described by Spears as a girl anthem, recalls a womanizing man, while the protagonist of the song makes clear she knows who he really is. Produced and co-written by Nikesha Briscoe and Rafael Akinyemi of The Outsyders, the song is musically an uptempo electropop song with influences of Spears' songs from her previous two studios albums. Spears re-recorded some vocals after a snippet of the track was leaked before it was released.\n\nThe song was well-received by contemporary critics, with reviewers complimenting its hook and deeming it as a comeback single for Spears. &quot;Womanizer&quot; was commercially successful, topping the charts in Belgium, Canada, Turkey, Denmark, Finland, France, Norway, Sweden and the United States. It also reached the top ten in Australia, Japan, New Zealand and many European countries. In the United States, it was her first single to reach number one since &quot;...Baby One More Time&quot;, almost 10 years prior. The song also became the fifth best-selling single of the 2000s.\n\nThe music video was directed by Joseph Kahn and was created by Spears as a sequel to the music video of &quot;Toxic&quot;. The video portrays Spears as a woman who disguises herself in different costumes and follows her boyfriend through his daily activities to expose him in the end. The video also contains scenes of Spears naked in a steam room, as a response to the attacks she had received over the years about her weight. It received positive reviews and was considered as a return to form for Spears.\n\nSpears performed &quot;Womanizer&quot; on various TV shows and on The Circus Starring Britney Spears, where she performed it as the encore number of the show, wearing a policewoman uniform. The song has been covered by a number of artists from different genres, including Lily Allen, Franz Ferdinand and Girls Aloud. It received a Grammy Nomination in 2010 in the Best Dance Recording category, but lost to Lady Gaga for her song &quot;Poker Face&quot;.\n\nThe video begins with an opening caption that reads &quot;Womanizer&quot;. During the introduction, Spears is naked and smiling at a sauna, while covering herself with her hands. These scenes are seen throughout the video. When the first verse begins, a blond Spears wearing a slip nightgown is making breakfast for her boyfriend as he gets ready for work. When he is at the office, he sees a new secretary, which is actually Spears in disguise wearing horn-rimmed glasses and a pencil skirt. She starts dancing in front of him and sings the chorus. She makes him follow her into the photocopier, where she photocopies her buttocks. On the back, we see an awkward-looking man, the same who appears in the plane scene on &quot;Toxic&quot;. Then, Spears is disguised as a redhaired waitress in a restaurant. She dances around him with her dancers and plays with him over the kitchen counter. After this, her boyfriend is seen getting driven home by Spears, disguised as chauffeur. She starts to kiss him, driving the car with her heel until both get home. Once they get into the bedroom, Spears reveals that she was the three women he was &quot;womanizing&quot; all along. She then begins attacking her boyfriend. This is shown through Spears as her three alter egos, and then as the real version of herself. Spears throws a blanket over him and making the bed. The video ends with Spears smiling and the opening caption.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:d7ae94ff1313ae1eae50e3a1d46d43aa08296826","amp;dn":"Britney+Spears+-+Womanizer+++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7ae94ff1313ae1eae50e3a1d46d43aa08296826","infoHashBuffer":{"type":"Buffer","data":[215,174,148,255,19,19,174,30,174,80,227,161,212,109,67,170,8,41,104,38]},"announce":[],"urlList":[]}}