{"title":"The City of Lost Children","uid":5248235,"size":340632645,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:d8c6b736e122e8d710885a0fa7403862eceef8e8&amp;dn=The+City+of+Lost+Children&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"emersline","files":3,"time":1262236802,"description":"Na adaptaÃƒÂ§ÃƒÂ£o Psygnosis 'do filme The City of Lost Children jogar Miette, uma jovem ÃƒÂ³rfÃƒÂ£ forÃƒÂ§ada a perambular pelas ruas mal-humorado e desolada de Paris, em um futuro prÃƒÂ³ximo distÃƒÂ³pico, onde as crianÃƒÂ§as sÃƒÂ£o roubados por um cientista louco e fez jogar mau filme adaptaÃƒÂ§ÃƒÂµes para o PlayStation. OK, realmente nÃƒÂ£o. Mas ÃƒÂ© difÃƒÂ­cil imaginar um destino pior para as crianÃƒÂ§as de amanhÃƒÂ£ do que ser atingido impotentes no meio de tantos enigmas tedioso e arbitrÃƒÂ¡ria como esta.\n\nA jogabilidade ÃƒÂ© do Myst atende Alone in the Dark, 3-D, terceiro grande aventura pessoa. Caminhe ao redor. Lentamente. Clique no material. Veja se alguma coisa acontecer. Normalmente nÃƒÂ£o, embora cada um esforÃƒÂ§o fÃƒÂºtil ÃƒÂ© recompensado com o comentÃƒÂ¡rio irritante, &quot;nÃƒÂ£o posso fazer nada&quot;, de Miette. O resultado final ÃƒÂ© que vocÃƒÂª comeÃƒÂ§a a ficar em qualquer lugar possÃƒÂ­vel na cidade, na esperanÃƒÂ§a de que itens ÃƒÂºteis aparecerÃƒÂ¡ em seu item &quot;ÃƒÂºtil&quot; janela para que vocÃƒÂª possa procurar o lugar certo para estar segurando o item correto quando vocÃƒÂª apertar o botÃƒÂ£o de aÃƒÂ§ÃƒÂ£o. Immersive? NÃƒÂ£o.\n\nControle de Miette ÃƒÂ© inÃƒÂ¡bil na melhor das hipÃƒÂ³teses. A rotaÃƒÂ§ÃƒÂ£o ÃƒÂ© escorregadio e impreciso, fazendo com que vocÃƒÂª se deparar com inÃƒÂºmeros senÃƒÂµes quando vocÃƒÂª estÃƒÂ¡ tentando simplesmente andar pela rua. AlÃƒÂ©m disso, cada vez que vocÃƒÂª executar em outro barril, caixa, sem sentido ou outro impedimento para o progresso, Miette solta um gemido, eo controle ÃƒÂ© temporariamente suspenso enquanto ela faz uma pausa com uma animaÃƒÂ§ÃƒÂ£o de dois segundo de seu desÃƒÂ¢nimo. Agora que ÃƒÂ© entretenimento.\n\nQuebra-cabeÃƒÂ§as do jogo sÃƒÂ£o arbitrÃƒÂ¡rios e nÃƒÂ£o sÃƒÂ£o particularmente intuitivos. ComÃƒÂ©rcio de mÃƒÂ¡rmores para uma poÃƒÂ§ÃƒÂ£o para dormir? Go figure. Coloque um osso em uma caixa registadora para breve o sistema de seguranÃƒÂ§a em um cofre? Come on. A falta de retenÃƒÂ§ÃƒÂ£o exigida pelo The Game estimula o tipo de jogo aleatÃƒÂ³rio que sÃƒÂ³ pode ser descrito como frustrante. SoluÃƒÂ§ÃƒÂµes para os enigmas raramente produzem uma sensaÃƒÂ§ÃƒÂ£o de realizaÃƒÂ§ÃƒÂ£o desde que mais frequentemente entÃƒÂ£o nÃƒÂ£o sÃƒÂ£o resolvidos atravÃƒÂ©s de casualidade, e nÃƒÂ£o de raciocÃƒÂ­nio. Seria um feito extremo de boa sorte para terminar este jogo sem um passo a passo, como o quebra-cabeÃƒÂ§as sÃƒÂ£o tÃƒÂ£o contra-intuitivo.\n\nPara agravar este problema sÃƒÂ£o os grÃƒÂ¡ficos. Eles sÃƒÂ£o impressionantes. Eles sÃƒÂ£o lindos. Beautiful, fundos escuros definir um humor lÃƒÂºgubre pressÃƒÂ¡gio para Miette's (inÃƒÂºtil, irritante) andanÃƒÂ§a solitÃƒÂ¡ria. Infelizmente, eles sÃƒÂ³ prejudicam a jogabilidade. Crazy, Dr. Caligari esque-ÃƒÂ¢ngulos de cÃƒÂ¢mera, muitas vezes tornam a navegaÃƒÂ§ÃƒÂ£o Miette atravÃƒÂ©s da terceira dimensÃƒÂ£o quase impossÃƒÂ­vel. Quanto vocÃƒÂª vai apreciar a melancolia grÃƒÂ¡vida de um cÃƒÂ©u cybergothic? Pouco, quando isso significa que vocÃƒÂª nÃƒÂ£o pode encontrar o saco estÃƒÂºpido de bolinhas. Muitos dos itens de estoque mais importantes sÃƒÂ£o completamente invisÃƒÂ­vel atÃƒÂ© que vocÃƒÂª esteja literalmente em pÃƒÂ© em cima deles - na verdade, alguns nunca aparecem na tela, exceto em seu item ÃƒÂºtil pop-up. Por que criar um jogo que exige jogadores a gastar 20 minutos de suas vidas em pÃƒÂ© sobre as caixas de um cais no meio da noite, glorioso triste, olhando para um tubo de metal invisÃƒÂ­vel?\n\nA mÃƒÂºsica, como grÃƒÂ¡ficos de fundo, ÃƒÂ© deslumbrante, haunting, e perfeitamente adequado a vibe sinistra do futuro triste The Game's. Infelizmente, o restante do som de The Game ÃƒÂ© dominado por lamentando o protagonista ÃƒÂ© incessante.\n\nOs jogadores nÃƒÂ£o querem controlar desamparado, personagens choramingar. Enquanto eles podem nÃƒÂ£o ter de assumir a identidade de um hiper-macho Duke Nukem pratos que os fogos de artifÃƒÂ­cio bastante, uh ... iniciar uma loja de fogos de artifÃƒÂ­cio. Eles querem sair com um momento de glÃƒÂ³ria.","torrent":{"xt":"urn:btih:d8c6b736e122e8d710885a0fa7403862eceef8e8","amp;dn":"The+City+of+Lost+Children","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8c6b736e122e8d710885a0fa7403862eceef8e8","infoHashBuffer":{"type":"Buffer","data":[216,198,183,54,225,34,232,215,16,136,90,15,167,64,56,98,236,238,248,232]},"announce":[],"urlList":[]}}