{"title":"Roxio Easy Media Creator Suite 10 w/CD Key","uid":5413530,"size":1652512768,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d9100f111b434bd4b88ed6db46f6cb330e648be5&amp;dn=Roxio+Easy+Media+Creator+Suite+10+w%2FCD+Key&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":8,"uploader":"2mean2die","files":-1,"time":1267827071,"description":"This ISO has all the files including the CD Key and Activation Folder.\nMount ISO using Magic ISO or similar program to create your own copy of\nthe disc.\n\n\nThe new Roxio Easy Media Creator-Ã‚Â« 10 gives you creative inspiration and all the tools you need to enhance your digital lifestyle. Create, share and enjoy your movies, memories and music as only you can.\n\nConvert audio and video files to the format of your choice right on your Windows desktop.\nSend videos towith one click.\nSave tons of time by ripping CDs from multiple drives.\n\nAudio\nCapture streaming internet radio or any audio playing on your PC directly from your Windows Vista desktop. Video\nAdd a Smart Sound soundtrack to your movie or slideshow that perfectly matches your project. Even jazz up or slow down the pace without looping! Photo\nTurn a camera phone picture into a keepsake with the Mobile Photo Doctor. Mobile\nAuto-sync digital media on your PC and mobile devices. Set up custom profiles for easy transfer of music, photos and video from your mobile phone to PC and back. Backup\nEver wonder whats on those discs you burned two years ago? Creator 10 catalogs your discs and their contents -- even when the discs are no longer in the drive. Copy\nCopy your favorite audio, movies or TV shows from any iPod to your PC. Copy unprotected HD DVD data discs with one click.\n\nSystem Requirements\nMinimum System Requirements:\n\n* Windows Vista with 1.6 GHz Intel processor, 512 MB RAM\n* Windows XP with 500 MHz processor or faster; 128 MB RAM\n* 1 GB of free hard disk space for typical installation of all components\n* 1024x768, 16-bit color graphics card\n* DirectX 9 or higher compatible sound card and graphics card\n* Windows Media Player 10 or higher\n* Microsoft Internet Explorer 6 or higher\n* DVD-ROM drive is required to install the software","torrent":{"xt":"urn:btih:d9100f111b434bd4b88ed6db46f6cb330e648be5","amp;dn":"Roxio+Easy+Media+Creator+Suite+10+w%2FCD+Key","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9100f111b434bd4b88ed6db46f6cb330e648be5","infoHashBuffer":{"type":"Buffer","data":[217,16,15,17,27,67,75,212,184,142,214,219,70,246,203,51,14,100,139,229]},"announce":[],"urlList":[]}}