{"title":"The Hurt Locker - DVD - Ready to burn - Unidogma","uid":5425251,"size":4430819328,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d99d77ade06b3e036c45c478807c82acd487db4a&amp;dn=The+Hurt+Locker+-+DVD+-+Ready+to+burn+-+Unidogma&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"unidogma","files":-1,"time":1268231594,"description":"The Hurt Locker - Ready to Burn DVD Files - Unidogma\n\n\n\n\nWebsite: http://www.thehurtlocker-movie.com/\n\n\n\n\nThe Hurt Locker is a 2008 American war film. It follows a United States Army Explosive Ordnance Disposal (EOD) team during the Iraq War.\n\nThe film was directed by Kathryn Bigelow. The screenplay was written by Mark Boal, a freelance writer who was embedded as a journalist in 2004 with a US bomb squad in Iraq. It stars Jeremy Renner, Anthony Mackie, and Brian Geraghty as members of a U.S. Army EOD unit in Iraq and follows their tour together as they contend with defusing bombs, the threat of insurgency, and the tension that develops among them.[3][4] The film was shot in Jordan, within miles of the Iraq border.\n\nIt was first released theatrically in Italy in 2008, when it premiered at the Venice Film Festival. After being shown at the Toronto International Film Festival in North America, it was picked up for distribution in the United States by Summit Entertainment.[5] It was released in the United States on June 26, 2009, in New York and Los Angeles. Based on the success of its limited run, the independent film received a more widespread theatrical release in the United States on July 24, 2009. Because the 2008 film was not originally released in the U.S. (at least in an Oscar-qualifying run in Los Angeles) until 2009, it was eligible to be judged for that year's awards, the 82nd Academy Awards held in 2010.\n\nThe Hurt Locker was one of the most acclaimed films of 2009, earning awards and honors from numerous critics' organizations, festivals and groups. It was nominated for nine Academy Awards and won six, including Best Picture and Best Director for Bigelow, who became the first woman to win the award.[6] The film also swept the 2010 BAFTA Awards, winning best film, director, original screenplay, editing, cinematography and sound.\n\n","torrent":{"xt":"urn:btih:d99d77ade06b3e036c45c478807c82acd487db4a","amp;dn":"The+Hurt+Locker+-+DVD+-+Ready+to+burn+-+Unidogma","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d99d77ade06b3e036c45c478807c82acd487db4a","infoHashBuffer":{"type":"Buffer","data":[217,157,119,173,224,107,62,3,108,69,196,120,128,124,130,172,212,135,219,74]},"announce":[],"urlList":[]}}