{"title":"Cooley High DVD Video TS","uid":5308623,"size":4478353408,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:dacd2f6e4a11bf9229625f6cf9a6052535dc3d8b&amp;dn=Cooley+High+DVD+Video+TS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"miamishot","files":11,"time":1264486271,"description":"Used DVD Decrypter in file mode - Video TS file\n\nCooley High is a 1975 feature film produced and released by American International Pictures and written by Eric Monte (co-creator of Good Times). The film, set in 1964 Chicago, Illinois, stars Glynn Turman and Lawrence Hilton-Jacobs, and featuring a soundtrack made up primarily of 1960s Motown hits.\n\nThe film is considered a classic of black cinema, and its soundtrack features a new Motown recording, G.C. Cameron's hit single &quot;It's So Hard to Say Goodbye to Yesterday&quot;. That song was covered in 1991 by Motown act Boyz II Men on the group's first LP, named Cooleyhighharmony in honor of this film.\n\nCooley High is frequently compared favorably to the 1973 George Lucas film American Graffiti and the The Big Chill. ABC had planned a television adaptation of Cooley High, but the pilot was poorly received, and Fred Silverman, the head of the network, asked the pilot's producers, TOY Productions, to redo the show as a sitcom with new characters (Raj, Rerun and the rest)and with a new title so as not to confuse it with Monte's &quot;Cooley High.&quot; New writers were hired, cast changes made and a switch from one-camera film to three-camera delivered &quot;What's Happening!&quot; to the network where it ran from 1976 to '79. The show was then purchased by Columbia Pictures and ran in syndication for a number of years.\n\nMonte based the film on his experiences from attending the real-life Cooley Vocational High School (which is no longer standing) that served students from the Cabrini-Green public housing projects in Chicago. While the film was set in and around Cabrini-Green, it was primarily filmed at another Chicago-area housing project. Monte has said that he wrote the film to dispel myths about growing up in the projects: &quot;I grew up in the Cabrini-Green housing project and I had one of the best times of my life, the most fun you can have while inhaling and exhaling&quot;","torrent":{"xt":"urn:btih:dacd2f6e4a11bf9229625f6cf9a6052535dc3d8b","amp;dn":"Cooley+High+DVD+Video+TS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dacd2f6e4a11bf9229625f6cf9a6052535dc3d8b","infoHashBuffer":{"type":"Buffer","data":[218,205,47,110,74,17,191,146,41,98,95,108,249,166,5,37,53,220,61,139]},"announce":[],"urlList":[]}}