{"title":"Trucker.2008.DVDRip.H264","uid":5262934,"size":313811457,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:daee162a27b186bd61e8883f4f7848679731554e&amp;dn=Trucker.2008.DVDRip.H264&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"twentyforty","files":1,"time":1262796273,"description":"*** Small-sized 2-pass re-encode of DVD rip for computers (PC, Mac), PS3 or Xbox, portable and mobile devices (Ipod, Itouch) . ***\n*** Video is 480x272 H264; audio is 44.1 kHz/stereo AAC LC and container is MP4. ***\n\nI can recommend CoreCodec for H264 (avc1, x264) video-playback, free DivX 7 for AAC sound-playback (and .mkv with AAC), Haali splitter (free, comes with CoreCodec) as the fastest and best combination for Windows Media Player. This is what I use.\nVLC player (free), mplayer (free) and KMplayer (free) are available as alternative for all platforms (operating systems) out there and have BUILT-IN codecs and MP4 capabilities. But, video quality is approx. 10-15% lower, blurrier at least on system I have.\nOne can try CCCP matroska codec pack, where ffdshow codec/filter packs and Haali splitter comes in one package and support MP4 playback - but extra caution is required during the install process.\nQuickTime of course, supports H264/AAC natively.\nPS3 + HDMI cable + newer TV have been reported as best combination.\nAnd please, do not watch it with a nose in the screen, take proper distance to the monitor or TV (as advised in TV manuals).Many of movies I encode have embedded subtitles. So far, only VLC player is able to use them correctly.\n\nTrucker (2008)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1087527&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1087527&lt;/a&gt;\n 7.4/10   230 votes  \nGenre: Drama\n\nDirected by James Mottern. \nWith Michelle Monaghan, Nathan Fillion\n\nPlot: Trucker tells the story of Diane Ford (Monaghan), a young female, independent truck driver living life effortlessly and freely. All seems going to plan or lack there of until her estranged son (Jimmy Bennett) is dropped off on her doorstep due to his father's recent diagnosis of cancer. It is this time where we find Diane's world is turned upside down. Responsibility and the maternal instinct, two important things that have laid dormant in Diane's mind for sometime are swiftly reactivated. Along with this new found purpose, all the other elements that have inhabited her life for ten years are rattled; her awkward relationship with her friend Runner (Nathan Fillion, //Firefly, Serenity, Waitress, Castle//), her ailing ex Leonard (Benjamin Bratt), and his new love in his life Jenny (Joey Lauren Adams).\n\nInput:  Trucker.2008.DVDRip.XviD-VoMiT\nEnglish Subtitles available on p.od.nap.i.si net(I've seen it now, but movie was encoded yestrday...sorry).\n\nThe film is definitely worth a watch and as it may not fit well with everyone, you have to admire the attempt nonetheless. Michelle Monaghan and Nathan Fillion give some of the best works of the year. Trucker is definitely worth the watch.\n\n","torrent":{"xt":"urn:btih:daee162a27b186bd61e8883f4f7848679731554e","amp;dn":"Trucker.2008.DVDRip.H264","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"daee162a27b186bd61e8883f4f7848679731554e","infoHashBuffer":{"type":"Buffer","data":[218,238,22,42,39,177,134,189,97,232,136,63,79,120,72,103,151,49,85,78]},"announce":[],"urlList":[]}}