{"title":"Star.Wars.The.Force.Unleashed.Ultimate.Sith.Edition","uid":5388758,"size":15753811798,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:db3c0cd2a64c4a8e4a9fa693f3e31c0c65d48018&amp;dn=Star.Wars.The.Force.Unleashed.Ultimate.Sith.Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dsnyder24","files":-1,"time":1266970483,"description":"\n\n\n \n   The story and action of Star Wars: The Force Unleashed expands with the\n  release of Star Wars The Force Unleashed: Ultimate Sith Edition, a special\n  new version of the game that will show gamers the deepest, darkest side of\n  the Force in a story that puts them on a collision course with Luke Skywalker\n  himself. The Ultimate Sith Edition includes all of the original missions\n  found in Star Wars: The Force Unleashed as well as three new levels and tons\n  of bonus content.\n\n  Features\n\n  * Star Wars The Force Unleashed: Ultimate Sith Edition combines the\n    original Star Wars: The Force Unleashed videogame and three new levels to\n    create the definitive ultimate-evil storyline of the events that occurred\n    between the two classic Star Wars movie trilogies.\n  * Additional content includes two levels set on Coruscant and Tatooine and\n    an all-new bonus level available only in the Ultimate Sith Edition\n    package.\n  * The Ultimate Sith Edition expands the story of Star Wars: The Force\n    Unleashed and re-imagines the Star Wars Saga as if the Secret Apprentice\n    had killed Darth Vader and taken his place at The Emperor's side,\n    becoming the most powerful Sith Lord in the universe.\n  * In the Ultimate Sith Edition, the Emperor sends his new apprentice to the\n    planet Tatooine to dispatch Obi-Wan Kenobi -- who has been hiding on the\n    planet ever since the events of Star Wars: Episode III Revenge of the\n    Sith. During their hunt for the reclusive Jedi, players will also explore\n    the depths of Jabba the Hutt's palace and encounter notorious bounty\n    hunter Boba Fett.\n  * In the game's thrilling finale, the Secret Apprentice is sent to the\n    planet Hoth on a crusade to crush the Rebellion once and for all. While\n    on Hoth, players face Luke Skywalker himself while visiting iconic\n    locations seen in Star Wars: Episode V The Empire Strikes Back.\n  * The Ultimate Sith Edition gives gamers a chance to experience the full\n    power of the dark side of the Force. Create devastating attack combos\n    using the Secret Apprentice's lightsaber and over-the-top Force powers\n    Ã‚Â­ Force push, grip, repulse and lighting. Upgrade and master these\n    powers to leave a path of destruction behind you in your quest to rid the\n    Galaxy of the Jedi.\n  * The Secret Apprentice doesn't just defeat his enemies with the Force -\n    he hurls them through walls, smashes them into objects, shocks them with\n    lightning, and even transforms them into Force-charged bombs capable of\n    massive destruction.\n\n\nExcellent game, if you are a  star wars fan then you couldn't have asked  for better.\nGame Works great, as soon as you patch; so download it, install it, patch it , then crack it. \nif cracked already  u must paste the original first before you can patch it , just don't forget to paste the crack back at the end. If u have problem crashing when u are playing, like computer shut down... \n...  i Have the latest in video card graphics, cpu speed and etc.... what i learned from Playing Batman Arkam Asylum is that you have to get your pc to cool down cause those are very intensive graphics and so the pc becomes extremely hot when that gets over bearing, your system in order to save itself, shuts down. \nI have the nvidia 9800GTS, so in the Nvidia control Panel,  adjust up the core clock, memory clock and shader clock. also bring the cooling down to 20 instead of 100 ( you can then create an automatic rule to activate that plan everytime you play the game so you don't have to always adjuste your memory clocks back and forth) and then make sure u turn everything else on your pc off. Everything that you can... no side gadgets, any program that needs to be off; that you do have to do everytime you play; just go to task manager, processes and take note of things there are on that u can do without.  so you can have a great experience... i know it sounds like a lot specially when u know u have  spent a lot of cash on your system, but hey i went from crashing every 2 mins to playing over 6 hours... well i finished Batman Arkham Asylum  and that's how Ilearned at all... still playing this one here,so hope i could help some of you out there, Rememeber To Share .  Enjoy it Guys.\nXandro\n\n\n\n","torrent":{"xt":"urn:btih:db3c0cd2a64c4a8e4a9fa693f3e31c0c65d48018","amp;dn":"Star.Wars.The.Force.Unleashed.Ultimate.Sith.Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db3c0cd2a64c4a8e4a9fa693f3e31c0c65d48018","infoHashBuffer":{"type":"Buffer","data":[219,60,12,210,166,76,74,142,74,159,166,147,243,227,28,12,101,212,128,24]},"announce":[],"urlList":[]}}