{"title":"Conflict - Vietnam [Multi3][PC]","uid":5273980,"size":1744171681,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:dc400b019ab38f22ca1c728e7f1a11eb7ce34e9b&amp;dn=Conflict+-+Vietnam+%5BMulti3%5D%5BPC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"iMiLK","files":-1,"time":1263319143,"description":"STORY\n\nA haunting depiction of a truly grisly war, Conflict: Vietnam is the next instalment in the multi-award winning Conflict series, which has to date, sold over 3.5 million copies worldwide.\n\nConflict: Vietnam follows the progress of four US soldiers, cut off from their unit and behind enemy lines during the 1968 Tet Offensive. Tasked with fighting their way back to friendly lines, they are faced with day-to-day survival in a hostile environment where the enemy could be hiding anywhere and everywhere. They are un-concerned with the course of the war but brutally aware as to the presence of the Viet Cong and of finding any way they can to survive.\n\nConflict: Vietnam is a third person shooter where the player takes full control of all four squad members, utilising their different skill sets and tactical abilities to carefully out-flank enemies, neutralise targets and potential threats and make it back to friendly lines in one piece.\n\nThe game is made up of fourteen huge missions, each with a number of individual and varying objectives. You will lead your squad through ruined temples, down Vietnamese rivers, into local villages (with friendly and non-friendly fire) through the jungle and into the ancient Vietnamese capital of Hoi.\n\nUnlike Conflict: Desert Storm, Conflict: Vietnam does not set out to depict the course of the war; instead it bears witness to four men struggling for survival in the hostile Vietnam jungle against a ruthless terrain and seemingly ever-present 'invisible' enemy.\nFEATURES\n\n    * 14 missions including close-quarter combat, gunboats, chopper and napalm.\n    * Infamous Vietcong booby traps: Bouncing Betties, Punji Stake Pits and Grenade trip wires.\n    * A cunning and ruthless enemy able to hunt and ambush you.\n    * Genre defining cooperative multi-player combat made famous in the award-winning Conflict series.\n\n\n\n    Global Star Software\nDeveloper:\n    Pivotal Games\nGenre:\n    Historic Shooter\nRelease Date:\n    Oct 5, 2004 (more) \nESRB:\n    MATURE\nESRB Descriptors:\n    Blood and Gore, Intense Violence, Strong Language, Suggestive Themes, Use of Drugs\n\n\n\n#Minimum System Requirements\n\n\nSystem:\n    Pentium 1.5 GHZ or equivalent\nRAM:\n    128 MB\nVideo Memory:\n    32 MB\nHard Drive Space:\n    2500 MB\n\n\n#Recommended System Requirements\n\n\nSystem:\n    Pentium 2 GHZ or equivalent\nRAM:\n    128 MB\nVideo Memory:\n    128 MB\nHard Drive Space:\n    2500 MB\n\n\n","torrent":{"xt":"urn:btih:dc400b019ab38f22ca1c728e7f1a11eb7ce34e9b","amp;dn":"Conflict+-+Vietnam+%5BMulti3%5D%5BPC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc400b019ab38f22ca1c728e7f1a11eb7ce34e9b","infoHashBuffer":{"type":"Buffer","data":[220,64,11,1,154,179,143,34,202,28,114,142,127,26,17,235,124,227,78,155]},"announce":[],"urlList":[]}}