{"title":"FIREPOWER, Tim Johnston","uid":5434717,"size":3973748113,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:dc8d0c5cba11522003d7a9399d3d117c75c4b0d1&amp;dn=FIREPOWER%2C+Tim+Johnston&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"cyberbitz","files":1,"time":1268554536,"description":"Tuesday, November 17, 2009\n\nThis is a complete copy of Tim/Timothy  the company &quot;FIREPOWER&quot; main server computer, 7 years of records. These people ripped off Australian people for around 100 Million dollars, maybe a lot more. How much they took from other countries is not known yet.\n \nThe product they tried to sell the whole planet is simply a mothball containing a chemical called nepthaline This chemical stoppes your engine smoke for a while but destroys it eventually and they knew this, the evidence is all on this server.\nHere it is for all you private investigators and IT people around the world to have a go at.\n \nHenk Beugelaar\n\nCyberbitz Internet Cafe\n\nPerth, Western Australia\n \n\nUpdated Sunday, March 14, 2010\n\nI have cruched it to make it a bit easier for download. \n\nAlso, for the novices I have included the bittorrent client &quot;Utorrent&quot; which is probably the lightest and fastest available.\n\nTo read all the information from this server you need to set up a PC with windows 2000, outlook express 6 and office '97.\n\nYou will need Winrar 3.92 to unzip it\n\nHave fun\n\nHenk\n\nPs. - The west Australian Newspaper article (Saturday 28th of February 2009) with my name on it was quite funny I thought. They called me a &quot;Laid-back Internet Cafe Owner&quot; while in reality I rebuild the server and spend 3 months investigating it.\n\nI did a 2500 reports hard copy printout for the Australian Government (Department witheld), this was very intense work the depth of that the West Australian reporters had no idea and the article certainly showed that.\n\nMy &quot;reward&quot; from the West Australian newspaper was to be a free lunch at the local Hotel but I got stood up...\n\nFunny\n\n\n\n\n","torrent":{"xt":"urn:btih:dc8d0c5cba11522003d7a9399d3d117c75c4b0d1","amp;dn":"FIREPOWER%2C+Tim+Johnston","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc8d0c5cba11522003d7a9399d3d117c75c4b0d1","infoHashBuffer":{"type":"Buffer","data":[220,141,12,92,186,17,82,32,3,215,169,57,157,61,17,124,117,196,176,209]},"announce":[],"urlList":[]}}