{"title":"Need For Speed: SHIFT [XBOX360] [NTSC] (No Rar)","uid":5376310,"size":7840186570,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:dc96161ba0fe157a911a50a8cef6a3677698b7bc&amp;dn=Need+For+Speed%3A+SHIFT+%5BXBOX360%5D+%5BNTSC%5D+%28No+Rar%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"thenoobish","files":5,"time":1266585875,"description":"Need For Speed: SHIFT (2009 | Rus | Eng | NTSC) [XBOX 360]\n\nPlatform: XBOX360\nGenre: Arcade, Racing, Simulator, 3D\nDeveloper: Electronic Arts\nReleased: 2009\nLanguage: English\nMultiplayer: No\nPublication Type: license\nRegion / Security: NTSC-U &amp; J\n\nDescription:\nNeed for Speed, as we have known it the last few years, ceased to exist. Street racing and intrusive police went to the past, and replace them in a hurry serious car competition. New game series - Need for Speed: Shift - involved not fixated on self-copying EA Black Box, a European team Slightly Mad Studios, which has not changed into frivolous &quot;pokatushki. Studio lint on full auto simulators with the correct physics, realistic damage model, the view from the cockpit and other attributes of &quot;adult&quot; games.\nGame features:\nA realistic driving experience - Need for Speed SHIFT allows you to experience the true momentum and position themselves behind the wheel of a racing car. Each car is reproduced with incredible accuracy, handing the player a sense of speed and credibility of what is happening.\nDynamic effects of damage - a collision, whether it be a rival car on the road or fence, the player feels the same, what happens when such a collision in real life - a combination of visual and audio effects will pass the state driver's players and disrupt the race.\nFully customizable vehicle - Need for Speed SHIFT allows players to improve every element of the car - from exterior and interior, and ending with the tuning of the engine, allowing you to make a real production car racing car.\nRealistic cars and tracks - Need for Speed SHIFT will be presented more than 15 racing tracks, among which there are both very real and fictional. Famous racetracks, for example, exhausting dvadtsatikilometrovaya Nordschleife Nordschleife, side by side in a game with established developers routes (Glendale, for example, is replete with differences of heights, sharp turns and blind jumps). To drive will be available approximately 70 licensed cars including the Pagani Zonda F, Audi RS4, Porsche 911 GT3 RSR.","torrent":{"xt":"urn:btih:dc96161ba0fe157a911a50a8cef6a3677698b7bc","amp;dn":"Need+For+Speed%3A+SHIFT+%5BXBOX360%5D+%5BNTSC%5D+%28No+Rar%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc96161ba0fe157a911a50a8cef6a3677698b7bc","infoHashBuffer":{"type":"Buffer","data":[220,150,22,27,160,254,21,122,145,26,80,168,206,246,163,103,118,152,183,188]},"announce":[],"urlList":[]}}