{"title":"Call of Duty 4 Server Fix 1.7 XeMoRpH","uid":5215674,"size":38927401,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:dcf17cf3ae2a07dcb590e16c26dfc486d4686cf4&amp;dn=Call+of+Duty+4+Server+Fix+1.7+XeMoRpH&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"joz111","files":6,"time":1260750603,"description":"1: Install the program. Note that the cod4 directory install the stuff.\n2: Go in there where you have installed, eg &quot;C: \\ Program Files \\ Activision \\ Call of Duty 4 - Modern Warfare&quot;\n3: There is a file that &quot;server_play.exe&quot; or &quot;server_play-..........&quot; I start, if you've done that come in the CoD4 Console window.\nFirst to enter the rcon passwordo / server password like this:\neg rcon_password somethin '.\nThen check out the IP address, if I do not know where they should be here is a link on which you can see: http://ipcim.com/\nIf you've done that is attached to a program (modern rcon), we do not have to configure the server to know the rcon commands! (This could also die without a program there that the console window and change it as you enter Course\nMap mp_shipment\n\nthe use of modern rcon:\n\nJava is necessary for the use of the program - on which you can download here (http://www.java.com/en/download/index.jsp)\n\n1: If you started the program, enter the host to the IP address that you wrote this page!\n2: Port: haggyuk it blank, open the console because of the 28,960 ports that fund the program as there is shopping!\n3: Enter the Rcon passwordo what you wrote in the console window\n4: Connect, and others to think you do not need to explain\n\nHow much for your server?\nStart the cod4 et pull the console of the mushroom, type 0 AS connect to the IP address and portodat example like this: &quot;connect: 62.201.112.25:28960&quot;\nOr take it to the Xfire servers.\n\n\nPunkbuster Setup!\nIf you have updated your PB is outreach to the server you can throw and those who go up.\n1: pbsetup.exe file to copy the COD4 PB folder, select the start COD4 game, and update\n2: This is only the client side to update the server side does not!\n3: an enclosed &quot;pbsvnew.dll&quot; file, copy it to your PB folder and it updated the server-side Punkbuster\n(This is the current PB in November 2009, later updated in about half a year after I need you!)\n\n\n\nImportant! Self att the firewall because the console will not be able to connect to the server.\nIt is recommended to disable the Windows firewall, antivirus and firewall to stop until all of the server running!\n\n\n\nIt can modes to choose, you will go to the cod4 folder and there are options like &quot;server_play_mod-promodlive204.\n\nThat would be all good if you did everything you should run your server!.\n\n\nSystem Requirements\nIf you want to play on your server:\n2.5 GHz Processor\n1GB RAM\n128Kb/s-os upload speeds up to about 5 people try 7\n256Kb / s upload speed of 11 normal people carry loose ping | |\n1mb / s upload 20-25 people run smoothly can good pings |\n\nModes:\nPromodlive204\nPezbot\nBTDalpha02\nHardcore\nand the Original\n\n\n\nThat would be a whole .....\n\nIf you need additional assistance,|open the forum soon! |\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:dcf17cf3ae2a07dcb590e16c26dfc486d4686cf4","amp;dn":"Call+of+Duty+4+Server+Fix+1.7+XeMoRpH","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dcf17cf3ae2a07dcb590e16c26dfc486d4686cf4","infoHashBuffer":{"type":"Buffer","data":[220,241,124,243,174,42,7,220,181,144,225,108,38,223,196,134,212,104,108,244]},"announce":[],"urlList":[]}}