{"title":"Webcam7 0.9.9.16B34182Beta","uid":5406851,"size":10195651,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:de294a63db53802cd9725132064d3572a261d609&amp;dn=Webcam7+0.9.9.16B34182Beta&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tinalprioay","files":2,"time":1267626554,"description":"webcam 7 is a powerful webcams and network cameras monitoring, recording and streaming software for private and professional use. it offers unique features and unequaled ease of use to let you manage multiple video sources on the same computer. It is the ideal tool to secure your goods and keep an eye on them remotely from your phone or over internet.\n\nwebcam 7 is a brand new product based on webcamXP.\nThe user interface is the same however it offers exciting enhancements such as :\n? Flash Video (FLV) audio and video streaming (high frame rate for low bandwidth)\n? MJPEG recording with audio support.\nThis version is ideal for putting live webcam on your web page and is robust for 24/7 broadcasting. Supports a single video source.\n\nwebcam 7 Free is the basic product for home-users. It lets you to stream via HTTP, Windows Media or to upload via FTP/FTPS or HTTP/HTTPS Post. It also lets you add overlays / watermarks over your video streams and the basic features such as capturing or recording at fixed interval. This version is ideal for putting live webcam on your web page and is robust for 24/7 broadcasting. Supports a single video source.\n\nwebcam 7 Private is already more advanced and beside the multiple video sources support is also offers the possibility to filter by IP and to manage who can access your video streams smartly. You can limit users in view time and don't have to worry about your privacy. Supports up to 5 video sources.\n\nwebcam 7 PRO is the most advanced version of the software. It has all the features of the Private version and supports and includes the motion detector (optical and/or acoustic detectors), the advanced alerts manager, the ability to log traffic to files and the digital video recorder (permanent recording). It's the perfect solution for advanced security purposes at low cost. Supports unlimited number of video sources.\n\nIt is now available for beta testing and you can install it even if webcamXP is already installed, it will use its own settings, the only part in common is the IP Camera Directshow filter.\nIf you have a webcamXP license issued less than 2 years ago then you are entitled to use webcam 7 PRO. a free single source mode and the PRO trial mode are also enabled.","torrent":{"xt":"urn:btih:de294a63db53802cd9725132064d3572a261d609","amp;dn":"Webcam7+0.9.9.16B34182Beta","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de294a63db53802cd9725132064d3572a261d609","infoHashBuffer":{"type":"Buffer","data":[222,41,74,99,219,83,128,44,217,114,81,50,6,77,53,114,162,97,214,9]},"announce":[],"urlList":[]}}