{"title":"Xslimmer v1.7.7","uid":5375048,"size":5424643,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:df2bb83e87c19bbafcd8046bf6afdb0658938062&amp;dn=Xslimmer+v1.7.7&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Iso_Soul","files":2,"time":1266545448,"description":"Xslimmer, the friendly way to right-size your apps without losing functionality.\n\n--&gt;Remove unnecessary code from fat binaries. Xslimmer determines which code your machine needs and removes the rest. This is achieved by removing the code inside the Universal Binaries that does not fit with your machine's architecture, a code that never gets executed and just wastes your disk space.\n\n--&gt;Strip out unneeded languages. Safari is available in more than a dozen languages, Adium in more than 20. This is great, but how many of those do you need? Xslimmer allows you to select how many languages you want to preserve in your apps and will remove the rest, recovering lots of precious free space from your disk.\n\n--&gt;Xslimmer not only frees space wasted by unused code, it can even increase your Mac's performance. Some of our users have reported applications loading in almost half the time, because OS X does not need to analyze Xslimmed applications in search for the most suitable version of the code.\n\nWhat's New?\n--&gt;Adds the option to keep all native host architectures (32 and 64 bits), as explained below. It also solves a very rare crasher that could occur when the applications list was refreshed after modifying Xslimmer's preferences.\n\nInstallation:\n--&gt; Open folder &amp; mount dmg\n--&gt; Drag app to your applications folder\n--&gt; Done!\n\nENJOY!! \n--&gt; IsolatedSoul5591","torrent":{"xt":"urn:btih:df2bb83e87c19bbafcd8046bf6afdb0658938062","amp;dn":"Xslimmer+v1.7.7","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df2bb83e87c19bbafcd8046bf6afdb0658938062","infoHashBuffer":{"type":"Buffer","data":[223,43,184,62,135,193,155,186,252,216,4,107,246,175,219,6,88,147,128,98]},"announce":[],"urlList":[]}}