{"title":"Acoustic Legends HD Disc 2","uid":5249094,"size":7970908425,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:df66a81805c1b494a9eb9e43be1cc0e51ee20c99&amp;dn=Acoustic+Legends+HD+Disc+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tggrng123","files":18,"time":1262218110,"description":"Acoustic Legends HD\n\nPowered by the Kontakt Player 2 engine\n, Acoustic Legends HD delivers 19 gigabytes of acoustic guitar, including picked notes, finger-picked notes, natural and artificial mutes, chords, harmonics, harmonic chords, release layers, and even fret noise sampled for each guitar. It contains several different steel string guitars, nylon strings, twelve strings, acoustic bass, as well as a bonus folder featuring mandolin, ukulele, and banjo. Acoustic Legends HD features guitars from McPherson, Taylor, Gibson, Martin, and other manufacturers.\n\nAlso included are bonus patches of special effects, doubled guitars, and more. Acoustic Legends HD also incorporates 'chord banks' containing twelve different chord types in varying positions, with multiple velocity layers and multiple takes per layer. The chord banks include both up-strokes and down-strokes, making it simple to create fully authentic rhythm guitar parts.\n\nFeatures:\n\n19 gigabytes of acoustic guitars.\n24-bit, 96kHz samples, utilizing the finest in high-end microphones and pre-amps, sampled in thorough detail including release layers, fret noise, finger noise, and more.\nNumerous articulations and styles of playing, including finger picked, plastic picked, harmonics, harmonic chords, mutes, single notes, and chord banks.\nMassive chord instruments, sampled by both 6-string and 12-string guitars, featuring 12 different chord types, optional capo control. down- and up-strokes, mute strums, body knocks, making it possible to create authentic rhythm guitar strumming patterns.\nMultiple and contrasting guitars sampled within each folder, including 2 different nylon-stringed guitars, 7 different steel-stringed guitars, 2 different twelve-stringed guitars, etc.\nVariation patches for each guitar, including delays, phasers, choruses, flangers, compressors, and unusual effects.\nBonus content including acoustic bass, banjo, mandolin (single notes, chords, and tremolo), ukulele (single notes and chords), and guitar effects (body knocks, fret noise).\nBonus special effects content featuring dozens of unusual sound design patches, based upon the sample sets of the acoustic guitars but warped in unique and musically distinct ways.\nOptimized onscreen EQ controls.\nEasy-to-use built-in reverb module and stereo width control.\nRemote control of various sonic parameters available via MIDI CC.\nMulti-timbral operation, supporting up to 64 simultaneous instruments (subject to RAM availability), receiving up to 64 MIDI channels (16 in plug-in mode).\nKontakt Player 2 engine, supporting standalone operation as well as plug-in operation in all major hosts that support Audio Units, VST, RTAS, or DXi plug-ins.\nSpecial upgrade pricing to the full version of Kontakt 2, which allows for fuller editing of the instruments.\n\nMac &amp; PC","torrent":{"xt":"urn:btih:df66a81805c1b494a9eb9e43be1cc0e51ee20c99","amp;dn":"Acoustic+Legends+HD+Disc+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df66a81805c1b494a9eb9e43be1cc0e51ee20c99","infoHashBuffer":{"type":"Buffer","data":[223,102,168,24,5,193,180,148,169,235,158,67,190,28,192,229,30,226,12,153]},"announce":[],"urlList":[]}}