{"title":"What on Earth (crop circles) 2009 DVDrip divx","uid":5222646,"size":589338671,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:dfd5dbb547a5c8427ecbfdf10f4795367a9aea0e&amp;dn=What+on+Earth+%28crop+circles%29+2009+DVDrip+divx&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"wtf6666","files":2,"time":1260989002,"description":"A personal message from Suzanne Taylor...\n\nI never set out to be a filmmaker. (yeah it shows)\n\nBut the moment I first witnessed the awesome mystery and beauty of the crop circles, everything changed.\n\nSomehow, the circles and their secrets filled me with a sense of wonder, of joy... and of hope (for myself, for humanity, for our world).\n\nAbove all, I was filled with the desire to share this incredible experience.\n\nWith everyone. Everywhere.\n\nSo I became a filmmaker. I made &quot;What On Earth?&quot;\n\nAnd now, after many years, many adventures and most importantly, many meetings with wonderful friends all over the planet...\n\nIn a giant effort to share the wonder, power and mystery of the circles with the world, and to bring this experience to YOU, an extraordinary group of experts and organizations have joined forces with me to offer the bonus gifts below...\n\nPLUS... When you order the DVD today, you'll not only have instant access to this wonderful selection of valuable bonuses, but you'll also get a special 20% DISCOUNT! This is a limited time offer, though -- please give this your attention immediately since it's only around for a very short period.\n\nThanks once again to everyone whose love and support made &quot;What On Earth?&quot; a reality.\n\n--\n\nNote from uploader. These people are a bunch of bullshit artists, lying their arses off on the man made subject of crop circles. trying to make themselves a quick buck out of the gullible public. Quite shameful. &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1444294/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1444294/&lt;/a&gt;","torrent":{"xt":"urn:btih:dfd5dbb547a5c8427ecbfdf10f4795367a9aea0e","amp;dn":"What+on+Earth+%28crop+circles%29+2009+DVDrip+divx","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfd5dbb547a5c8427ecbfdf10f4795367a9aea0e","infoHashBuffer":{"type":"Buffer","data":[223,213,219,181,71,165,200,66,126,203,253,241,15,71,149,54,122,154,234,14]},"announce":[],"urlList":[]}}