{"title":"A*Teens - Floorfiller  (2nafish)","uid":5375901,"size":154392580,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e059b84ba87656889a6d69b5f2c1c902e511a41c&amp;dn=A%2ATeens+-+Floorfiller++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1266575531,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Floorfiller&quot; is A*Teens' second single from their third album Pop 'Til You Drop, also featured on its European edition New Arrival.\n\nThe funky dance track was released to radio in July 2002 in North America and in August 2002 in South America. It reached number-six in Mexico.\n\nThe track was written by Grizzly, Tysper and Mack, who also worked with the band on &quot;Upside Down&quot; and &quot;Halfway Around the World&quot;. The single was released in Europe in October 2002 and it reached number four in Sweden, earning a Gold Certification, thirty-three in Germany, and forty-six in Austria.\n\nThe video was directed by Sanaa Hamri and filmed in the club, The Loft, in Los Angeles, California. The A*Teens participated on the creation of the concept for the video.\n\nThe video was popular on music channels, leaving the request video charts 2002 as the 63rd most played video on MTV Mexico, and 45th on MTV Argentina. It also made it to number twenty-three on Telehit's Top 100 List of 2002. The choreographer of this video was Charles Klapow, (the choreographer for High School Musical).\n\nA DVD single was released on October 29, 2002, in the U.S. to promote the album and the video. It sold relatively well in the U.S. and Mexico.\n\nPop 'til You Drop! is the second studio album and third album overall by the A*Teens, released in 2002.\n\nRecorded between 2001 and 2002 in Stockholm, Sweden, Pop 'til You Drop! provide a more American-driven sound rather than just Europop.\n\nFor the first time, the A*Teens participated on the writing of the tracks and the design of the album and image.\n\nIt was released as an American only release on June 18, 2002, in the hype of the promotion of the first single, Elvis' cover &quot;Can't Help Falling in Love&quot; (which was the soundtrack of Disney's movie Lilo &amp; Stitch), the album peaked at #45 on the Billboard Charts and it was certified Gold after their first headlining tour in the United States.\n\nDue to the big demand, the album was released in Mexico, Argentina and other countries in Asia and Latin-America.\n\nThe album spawned one more hit single &quot;Floorfiller&quot;. Both &quot;Floorfiller&quot; and &quot;Can't Help Falling in Love&quot; were released in Europe despite that the album was never released there. Some promo copies of the album that were unleashed in the United States included the bonus track &quot;Have a Little Faith in Me&quot; but this track was never commercially released until 2003 when their fourth album &quot;New Arrival&quot; was released.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:e059b84ba87656889a6d69b5f2c1c902e511a41c","amp;dn":"A%2ATeens+-+Floorfiller++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e059b84ba87656889a6d69b5f2c1c902e511a41c","infoHashBuffer":{"type":"Buffer","data":[224,89,184,75,168,118,86,136,154,109,105,181,242,193,201,2,229,17,164,28]},"announce":[],"urlList":[]}}