{"title":"wrong.side.of.town.2010.x264 -knarfie123-","uid":5368901,"size":1432513088,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e0b6083cd70e53d1746832263386ea5f83368227&amp;dn=wrong.side.of.town.2010.x264+-knarfie123-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"knarfie123","files":-1,"time":1266358560,"description":"ex-Navy Seal Bobby Kalinowski lives a quiet, peaceful life as a landscape architect in an LA suburb with his wife Dawn and 16 year old daughter Brianna. Tonight they are invited out for an evening on the town by new neighbors clay and Elise Freeman to a happening club downtown. Little did they know that this would be the start of a life or death ordeal for the group. While at the club, Dawn is accosted by one of the club owners, Ethan Bordas. When Bobby intervenes and accidentally kills Ethan defending his wife, his enraged older brother, Seth, puts a one hundred thousand dollar bounty on his head. Now Bobby must escape LA while being pursued by every criminal, wise guy and thug in the city. Bobby decides to separate from his wife and neighbors and revert to his Navy Seal training to survive. To complicate matters, Seth has a corrupt police sergeant preventing Bobby from getting any help from the law! However, they all underestimate the fighting skills and abilities of Bobby Kalinowski who battles through an army of thugs to finally make it back home. But, relentless, Seth doesn't stop there. He targets Bobby's family next and kidnaps his daughter. His plan is successful and he lures Bobby to his seedy warehouse complex for the final showdown.\n\n720x384 DVD RIP\nenglish 2ch audio","torrent":{"xt":"urn:btih:e0b6083cd70e53d1746832263386ea5f83368227","amp;dn":"wrong.side.of.town.2010.x264+-knarfie123-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0b6083cd70e53d1746832263386ea5f83368227","infoHashBuffer":{"type":"Buffer","data":[224,182,8,60,215,14,83,209,116,104,50,38,51,134,234,95,131,54,130,39]},"announce":[],"urlList":[]}}