{"title":"Sean Hannity - Dec 17 2009 CF mp3","uid":5226035,"size":36320495,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:e0beee89fd57b05e8117e41a20f42626448af269&amp;dn=Sean+Hannity+-+Dec+17+2009+CF+mp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"twoname","files":3,"time":1261130067,"description":"Show Guests:\n\nJohn Boehner\nJohn Andrew Boehner (born November 17, 1949) is a conservative Republican American politician who is currently serving as the House Minority Leader in the 111th Congress. He serves as a U.S. Representative from Ohio's 8th congressional district, which includes several rural and suburban areas near Cincinnati and Dayton and a small portion of Dayton itself.\n\nKarl Rove\nKarl Christian Rove (born December 25, 1950) was Senior Advisor and Deputy Chief of Staff to former PresidentGeorge W. Bush until his resignation on August 31, 2007. He has headed the Office of Political Affairs, the Office of Public Liaison, and the White House Office of Strategic Initiatives. Since leaving the White House, Rove has worked as a political analyst and contributor for Fox News, Newsweek and The Wall Street Journal.\n\nFor most of his career prior to his employment at the White House, Rove was a political consultant almost exclusively for Republican candidates. Rove's campaign clients have included Bush (2000 and 2004 presidential elections, 1994 and 1998 Texas gubernatorial elections), Senator John Ashcroft (1994 U.S. Senate election), Bill Clements (1986 Texas gubernatorial election), Senator John Cornyn (2002 U.S. Senate election), Governor Rick Perry (1990 Texas Agriculture Commission election), and Phil Gramm (1982 U.S. House and 1984 U.S. Senate elections).\n\nRove's name has come up in a number of political scandals, including the Valerie Plame affair, the Bush White House e-mail controversy and the related dismissal of U.S. attorneys controversy . ","torrent":{"xt":"urn:btih:e0beee89fd57b05e8117e41a20f42626448af269","amp;dn":"Sean+Hannity+-+Dec+17+2009+CF+mp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0beee89fd57b05e8117e41a20f42626448af269","infoHashBuffer":{"type":"Buffer","data":[224,190,238,137,253,87,176,94,129,23,228,26,32,244,38,38,68,138,242,105]},"announce":[],"urlList":[]}}