{"title":"Search and Replace 6.3","uid":5361195,"size":3188827,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e1084df6deab6ef7755dbd759bd8dd099c6474df&amp;dn=Search+and+Replace+6.3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"donkeydick121","files":-1,"time":1266105732,"description":"Search and Replace is for Windows NT/2000/XP, Windows 2003, Windows Vista, \n                        Windows 7. Both 32-bit and 64-bit.\n\nPlease seed (share) these programs. Most people (just like me when I started) don't know how to do this. It simply means that when the download is complete, don't press stop or close down your program. It will then be available to anyone who wants to download it from you. Thanks.\n\nSearch and Replace is an award winning, easy to use search and replace utility loved by programmers, webmasters, and novice computer users alike.\n\nIt can search subdirectories and ZIP files and do case sensitive or insensitive searches. Extensive support for grep style regular expression search &amp; replacements includes operations that span more than one line, incrementing number replacements, and inserting the path &amp; filename in replaced files.\n\nBinary search &amp; replace is also available. You can specify multiple include/exclude file masks and filters based on file date &amp; size.\n\nThe program can also launch associated programs on &quot;found&quot; files, e.g., launch your web browser if the search hit occurs in an .htm or .html file.\n\nIf you need to find and replace text, or just find text, this utility is a must have. \n\nIt is significantly faster than other Windows grep-only utilities and allows replacing for the same price as those programs which offer only grep capabilities.\n\n","torrent":{"xt":"urn:btih:e1084df6deab6ef7755dbd759bd8dd099c6474df","amp;dn":"Search+and+Replace+6.3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1084df6deab6ef7755dbd759bd8dd099c6474df","infoHashBuffer":{"type":"Buffer","data":[225,8,77,246,222,171,110,247,117,93,189,117,155,216,221,9,156,100,116,223]},"announce":[],"urlList":[]}}