{"title":"Immoral Sisters","uid":5347195,"size":1683141936,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:e1236c5987657af750619d78924c4cdc5c000cb5&amp;dn=Immoral+Sisters&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tulling1337","files":7,"time":1265678571,"description":"The story revolves around a mother, Yukie Kitazawa, and her two adopted daughters, Rumi and Tomoko. Yukie has a car accident while her husband is away on a business trip, and is forced to repay the other party, a young man named Taketo Nogawa, by sexual means. Taketo and his father, a powerful and corrupt business owner, blackmail and violate Yukie, Rumi and Tomoko.\n\nBut Yukie's husband has been impotent for some time (due to his suppressed sexual attraction to Tomoko), and Yukie cannot help but welcome the sexual attention Taketo shows her. Taketo is depicted as an impulsive, frustrated young man prone to occasional outbursts.\n\nYumi, who works at Taketo's father's company, also joins in the emotional maelstrom; at times, she appears to be a loyal servant of the company and its interests, such as collecting the money owed by Yukie. At other times, she seems more concerned with the solidarity of the Kitazawa family.\n\nIn the middle of it all stands Tomoko, the younger sister, a girl so innocent that she loves everyone. Tomoko does all in her power to keep the family happy and together despite their lack of genetic bonds.\n\nAi Shimai does not strictly adhere to chronological order; it could be that the second and third parts depict separate, alternate endings. Also, some scenes are viewed through the eyes of different characters, a narrative technique that allows the advancing story to switch back and fill in where it previously left off. The series contains both heterosexual and lesbian love-making (sometimes in the same scene\n\n\n\n\nThis is every episode.","torrent":{"xt":"urn:btih:e1236c5987657af750619d78924c4cdc5c000cb5","amp;dn":"Immoral+Sisters","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1236c5987657af750619d78924c4cdc5c000cb5","infoHashBuffer":{"type":"Buffer","data":[225,35,108,89,135,101,122,247,80,97,157,120,146,76,76,220,92,0,12,181]},"announce":[],"urlList":[]}}