{"title":"CryptoEdit v1.5 [IsolatedSoul5591]","uid":5413987,"size":467921,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:e15ee7fa8ebc14fba48497d347593b768246d9b4&amp;dn=CryptoEdit+v1.5+%5BIsolatedSoul5591%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Iso_Soul","files":2,"time":1267844380,"description":"Product Description:\nCryptoEdit is a full featured word processor for reserved documents, handling TEXT, RTF and RTFD (with images) format.\nIt saves documents on disk _always_ as Blowfish encrypted and is the ideal solution to manage reserved documents with formatted text and images.\nCryptoEdit is absolutely simple, powerful and secure. It allows to edit document as a normal simple word processor which can handle text and images. All the feature available in a modern Cocoa based rich text processor are available in CryptoEdit.\nThe text can be formatted using rules, different font,style, size, color. All the usual manipulations of fonts are available via menu and dialogs plus custom styles are available. Spelling in your native language. Text search is full implemented.\nInsertion of images inside the document with just drag and drop. Import from other documents in standard TEXT or RTF or RTFD (RTF + images) . Export as TEXT, RTF or standard RTFD (included images)\nCryptoEdit can also add to every document a public note that everyone can see trying to open the document, this can be used to comunicate a note by the author (if the document is for distribution, as an example, on how to obtain the password) or just a reminder if the document is for internal use only.\n\nAdditional info:\nEasy and simple\nNative for Cocoa, universal binary native on both Intel and PPC, optimized under leopard\nUses a strong Blowfish algorithms\nSave always as encrypted, helping you avoid security problems\nFull featured RTF editor with rulers, fonts, styles, unlimited number of documents and more...\nInserts images with a simple drag and drop.\nCan import from TEXT, RTF and also from RTFD (Rich Text Format + embedded images)\nCan export documents as standartd TEXT, RTF, RTFD (images included)\nSave as crypted also embedded images\nOpen and decrypt in a flash\nCan genereate secure distributable documents\nCan add public notes visible without password for document general information\n\nWhat's New?\n--&gt; Saved document remember position and size\n--&gt; Improved stability\n--&gt; Bug fix\n\nInstallation:\n--&gt; Mount dmg &amp; drag app to your applications folder\n--&gt; Program is already cracked! No need to register!\n--&gt; Don't use &quot;License&quot; menu.\n--&gt; Done!\n\nENJOY!! \n--&gt; IsolatedSoul5591","torrent":{"xt":"urn:btih:e15ee7fa8ebc14fba48497d347593b768246d9b4","amp;dn":"CryptoEdit+v1.5+%5BIsolatedSoul5591%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e15ee7fa8ebc14fba48497d347593b768246d9b4","infoHashBuffer":{"type":"Buffer","data":[225,94,231,250,142,188,20,251,164,132,151,211,71,89,59,118,130,70,217,180]},"announce":[],"urlList":[]}}