{"title":"Asia el Culo del Mundo DvdRip PerÃƒÂº","uid":5206702,"size":733960233,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e1aa7248ead66b800ee41b419aca1d94a93852bd&amp;dn=Asia+el+Culo+del+Mundo+DvdRip+Per%C3%83%C2%BA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gichellita","files":-1,"time":1260401441,"description":"Titulo Original: Asia ... El Culo del Mundo\n\nDirecciÃƒÂ³n: Juan Carlos Torrico \n\nGuiÃƒÂ³n: Gianfranco Annichini y Juan Carlos Torrico \n\nReparto: Javier Valdez, Maggie Vega, Enrique Victoria, Patty de la Fuente, Miguel Medina \n\nAÃƒÂ±o: 1992\n\nSinopsis:\n\nCuando CristÃƒÂ³bal ColÃƒÂ³n descubriÃƒÂ³ AmÃƒÂ©rica creyÃƒÂ³ haber llegado a Asia. Lo mismo nos paso a nosotros, creÃƒÂ­mos llegar a un sitio y sucede que llegamos a otro. Es que en la vida casi nada sucede como uno lo ha planeado, siempre ocurre algo imprevisto y todo cambia. Es que si todo fuera previsible, si todo se pudiera pronosticar Ã‚Â¡QuÃƒÂ© aburrido serÃƒÂ­an los dÃƒÂ­as!........y que pocas cosas tendrÃƒÂ­a uno que contar.\n\nManuel (Javier ValdÃƒÂ©s) escapa de unos tipos que lo buscan para matarlo, al parecer esta metido en negocios ilÃƒÂ­citos. Su padre Fortunato (Enrique Victoria) lo busca porque al ÃƒÂ©l tambiÃƒÂ©n lo estÃƒÂ¡n siguiendo por culpa de Manuel. Los dos inician un viaje en auto, salen hacia el norte de Lima. En el camino recogen a una estudiante de antropologÃƒÂ­a llamada Beatriz (Patricia de la Fuente). Manuel esta cansado y le cede al timÃƒÂ³n a Beatriz, aprovechando que este se queda dormido ella no continua por la carretera panamericana norte, sino que voltea segÃƒÂºn ella por un atajo para llegar mÃƒÂ¡s rÃƒÂ¡pido a quien sabe donde.\n\nCuando Manuel despierta esta en medio del desierto, con unos cerros que se ven a lo lejos. Su padre y Beatriz han caminado y han llegado a un lugar donde sÃƒÂ³lo hay una casa. AllÃƒÂ­ vive una mujer sumamente sensual y preciosa llamada Dora (MarÃƒÂ­a AngÃƒÂ©lica Vega). Ella les da posada pero les comenta que pronto va llegar su pareja llamada Santiago (Miguel Medina). Le preguntan como se llama ese sitio agreste, ella dice que se llama Asia.\n\nManuel logra llegar a Asia, se baÃƒÂ±a y asÃƒÂ­ desnudo en una laguna Dora lo observa. Es de esta forma que ambos se conocen. Esa noche hacen el amor pero ella le dice que pronto va llegar Santiago. En efecto al otro dÃƒÂ­a llega Santiago, para esto Manuel ya ha descubierto que este hombre es policÃƒÂ­a. Lo peor es que se ha metido con su mujer. Manuel le dice a Santiago: Asia el culo del mundo, a donde solo se llega por error o por cojudo. TambiÃƒÂ©n le dice que Beatriz es una loca que quiere granjearse la simpatÃƒÂ­a de los dioses, Fortunato es un viejo que vive en su pasado militar y por ÃƒÂºltimo que Dora les ha brindado una buena estadÃƒÂ­a, ademÃƒÂ¡s se pinta como un tipo sano. Se olvida que Santiago no tiene ni un pelo de tonto. Lo puede desenmascarar en cualquier momento, en el menor descuido.\n\n\n\n\n\n                                Disfruten y semillen ( seed )\n","torrent":{"xt":"urn:btih:e1aa7248ead66b800ee41b419aca1d94a93852bd","amp;dn":"Asia+el+Culo+del+Mundo+DvdRip+Per%C3%83%C2%BA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1aa7248ead66b800ee41b419aca1d94a93852bd","infoHashBuffer":{"type":"Buffer","data":[225,170,114,72,234,214,107,128,14,228,27,65,154,202,29,148,169,56,82,189]},"announce":[],"urlList":[]}}