{"title":"Clear Lake WI 2009 SWESUB DVDRip XviD","uid":5446470,"size":734153175,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e37f3f2cd717b4a930e7d466317e8081e877e341&amp;dn=Clear+Lake+WI+2009+SWESUB+DVDRip+XviD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"FF_hightopper","files":-1,"time":1269031756,"description":"En grupp barndomsvÃƒÂ¤nner ÃƒÂ¥tervÃƒÂ¤nder till sin hemstad fÃƒÂ¶r att uppdatera sig om de fasansfulla hÃƒÂ¤ndelser som hÃƒÂ¤nde fÃƒÂ¶r 15 ÃƒÂ¥r sedan.\n\nIn 1993, some residents of the small town of Clear Lake, WI fell victim to a strange and horrible disease. An influential local preacher blamed the outbreak on the heresy and sins of some in the town. As loved ones, especially children, continued to get sick and die, the preachers fiery sermons caused a modern day religious hysteria like the inquisitions of the past. As the residents of the town turned on each other, a group of 5 high school students, seemingly brainwashed by the preacher, helped the preacher kidnap and kill accused heretics and sinners in a 3 day spree they called their &quot;Holy War&quot;. By the time the government health officials arrived to investigate the outbreak illnesses, 23 people had gone missing and most of the townspeople had fled. The government evacuated and quarantined the town and not soon after, as bodies were found, the preacher was arrested for the murders. The 5 students, all juveniles at the time, testified against the preacher in exchange for immunity from prosecution, then went their separate ways. 15 years later, a documentary filmmaker has tracked down the 5 students. Despite initial resistance, she convinces them to return to Clear Lake to help her tell the sensational story of a town and people lead to evil in the name of religion. But when they return to the town, strange things begin to happen, and when the documentary filmmaker disappears, and another of the group is found killed, the rest of them realize they must deal with the ghosts of the past, and that maybe one of the group is still fighting the &quot;Holy War..&quot;","torrent":{"xt":"urn:btih:e37f3f2cd717b4a930e7d466317e8081e877e341","amp;dn":"Clear+Lake+WI+2009+SWESUB+DVDRip+XviD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e37f3f2cd717b4a930e7d466317e8081e877e341","infoHashBuffer":{"type":"Buffer","data":[227,127,63,44,215,23,180,169,48,231,212,102,49,126,128,129,232,119,227,65]},"announce":[],"urlList":[]}}