{"title":"Omarion feat. Jay Rock - Hoodie  (2nafish)","uid":5417034,"size":147181572,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e3a717ad5b3a689babcbae3283a28d3c1ba37079&amp;dn=Omarion+feat.+Jay+Rock+-+Hoodie++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1267961776,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Hoodie&quot; is the second single from Omarion's third studio album, Ollusion. The song, which features Jay Rock, has failed to chart.\n\nThe video is dedicated to Michael Jackson, and has been described by Omarion himself as &quot;a mix between 'Beat It' and Bad. The single's sequel is set to be 'Speedin' following the events of the 'Hoodie' music video'.&quot;\n\nOllusion is the third studio album from R&amp;B singer Omarion on EMI.[4] The album was released January 12, 2010. This is also reported to be Omarion first solo album with the Parental Advisory label on it. It sold 21,200 copies its first week.\n\nOmari Ismael Grandberry (born November 12, 1984), better known as Omarion, is an American R&amp;B singer, actor, songwriter, record producer, dancer, and former lead singer of the boy band, B2K. His third album Ollusion was released January 12, 2010 with the lead single &quot;I Get It In.&quot; Omarion is also currently the newest judge of the hit show America's Best Dance Crew on MTV.\n\nIt was reported that on the July 20th, Omarion had signed with Lil Wayne's Young Money Label under Cash Money Records. But rumors had began to spread that Omarion was dropped from the label due to leaking the single &quot;I Get It In&quot; featuring Lil Wayne. On August 21, 2009 Omarion Posted on Twitter that he wasn't dropped from Young Money Records for leaking the song, but had asked to be released from Young Money Records to pursue other arrangements with no conflict with the company or its roster. He also added that he has a lot of respect for Lil Wayne, and what he is so notorious for. This was also supported later that week in an interview with Lil Wayne he stated himself that it was just a 'business decision' and Omarion asked for the release to better his career. Since parting ways with Young Money, Omarion created his own imprint StarWorld Entertainment and signed with EMI while redoing the 1st single &quot;I Get It In&quot;, which now features So Icey/Atlantic artist Gucci Mane. &quot;Hoodie&quot; will be the follow-up single with Jay Rock.\n\n\nSome lyrics in this video are censored.\n\n\nMy Videos: &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:e3a717ad5b3a689babcbae3283a28d3c1ba37079","amp;dn":"Omarion+feat.+Jay+Rock+-+Hoodie++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3a717ad5b3a689babcbae3283a28d3c1ba37079","infoHashBuffer":{"type":"Buffer","data":[227,167,23,173,91,58,104,155,171,203,174,50,131,162,141,60,27,163,112,121]},"announce":[],"urlList":[]}}