{"title":"The Proposal (2009)(Multi subs 9) 2Lions-Team","uid":5230712,"size":4691790311,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:e3d721d410e2a5e751c6d215e35e4c53d7966daf&amp;dn=The+Proposal+%282009%29%28Multi+subs+9%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Pioen","files":106,"time":1261321588,"description":"The Proposal (2009)  \n\nVanaf 8 december in de videotheek    \n\n\nVerenigde Staten\nKomedie / Romantiek\n107 minuten\n\ngeregisseerd door Anne Fletcher\nmet Sandra Bullock, Ryan Reynolds en Mary Steenburgen\n\nDe invloedrijke redactrice Margaret dreigt uitgezet te worden naar haar vaderland Canada. Om dit te voorkomen dwingt ze haar niets vermoedende en komische assistent Andrew om zich met haar te verloven, terwijl ze hem al jarenlang het leven zuur maakt. Hij gaat akkoord met de verloving maar tegen een paar persoonlijke voorwaarden. Het onwaarschijnlijke stel reist af naar Alaska om de eigenzinnige familie van Andrew te ontmoeten. Het zelfbeheerste stadsmeisje komt dan in de ene komische situatie na de andere terecht, waarin ze zich als een vis op het droge voelt. Met een onvoorbereid huwelijk in het vooruitzicht en de vreemdelingenautoriteiten op de hielen, beloven Margaret en Andrew met enige aarzeling zich aan het plan te houden. Ongeacht de angstvallige gevolgen...\n\nEnglish\n\nFor three years, Andrew Paxton has slaved as the assistant to Margaret Tate, hard-driving editor at a New York publisher. When Margaret, a Canadian, faces deportation for an expired visa, she hatches a scheme to marry Andrew - he agrees if she'll promise a promotion. A skeptical INS agent vows to test the couple about each other the next Monday. Andrew had plans to fly home that weekend for his grandma's 90th, so Margaret goes with him - to Sitka, Alaska - where mom, dad, and grams await. Family dynamics take over: tensions between dad and Andrew, an ex-girlfriend, Andrew's dislike of Margaret, and her past color the next few days, with the INS ready to charge Andrew with fraud\n\n\nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail\n\nNEDERLANDSE RETAiL\n\nFormaat : DVD5 Pal\nViDEO : UNTOUCHED\nAUDiO : DD 5.1 English\nSubs : Dutch, English, Portuguese, Swedish, Norwegian, Danish, Finnish, Icelandic, Hindi, \nMENU: YES, Dutch Edited where Needed\nEXTRA'S : KEPT SOME EXTRA'S\n \n\nGenre : Komedie\nRomantiek\n \nWeblink : http://www.moviemeter.nl/film/52966\nWeblink : http://www.imdb.com/title/tt1041829 \n\n\n***************************************** \n\nBrought to you by\nPioen \n\n2Lions Team \n\n\n\n\n\n2Lions-Team for all your Dutch MOVIES and more \n\n***************************************** \n\nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!Info \nto the fakers , get a life !!!\n","torrent":{"xt":"urn:btih:e3d721d410e2a5e751c6d215e35e4c53d7966daf","amp;dn":"The+Proposal+%282009%29%28Multi+subs+9%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3d721d410e2a5e751c6d215e35e4c53d7966daf","infoHashBuffer":{"type":"Buffer","data":[227,215,33,212,16,226,165,231,81,198,210,21,227,94,76,83,215,150,109,175]},"announce":[],"urlList":[]}}