{"title":"The Blind Side (2009)","uid":5266924,"size":734590890,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e46ab23802415449b6e107a9bde094e39944df3b&amp;dn=The+Blind+Side+%282009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Raffaa","files":1,"time":1262915775,"description":"The Blind Side is a 2009 American drama sports film written and directed by John Lee Hancock, and based on the 2006 book The Blind Side: Evolution of a Game by Michael Lewis. The storyline features Michael Oher, an offensive lineman who plays for the Baltimore Ravens of the NFL. The film follows Oher from his impoverished upbringing, through his years at Wingate Christian School (a fictional representation of Briarcrest Christian School), his adoption by Sean and Leigh Anne Tuohy, and on to his position as one of the most highly coveted prospects in college football.\nThe film stars Quinton Aaron as Michael Oher, Sandra Bullock as Leigh Anne Tuohy, Tim McGraw as Sean Tuohy, Oher's adoptive parents, and Kathy Bates as Miss Sue, Oher's tutor. The movie also features appearances by several current and former NCAA coaches, including SEC coaches Houston Nutt and Ed Orgeron (Oher's coaches in college, though Nutt represented Arkansas at the time and therefore does so in the film), Phillip Fulmer, and Nick Saban, former coaches Lou Holtz and Tommy Tuberville, and recruiting analyst Tom Lemming.\n\nDVD Screener:\n\nA/10, V/10.\n\nEnjoy!!!!!","torrent":{"xt":"urn:btih:e46ab23802415449b6e107a9bde094e39944df3b","amp;dn":"The+Blind+Side+%282009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e46ab23802415449b6e107a9bde094e39944df3b","infoHashBuffer":{"type":"Buffer","data":[228,106,178,56,2,65,84,73,182,225,7,169,189,224,148,227,153,68,223,59]},"announce":[],"urlList":[]}}