{"title":"uTorrent 2.0.0 RC2 - Newest Version","uid":5239508,"size":1723594,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e523e93d22915400a9a9a3197fb2d03dcc8bc92d&amp;dn=uTorrent+2.0.0+RC2+-+Newest+Version&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"speeedy_man","files":4,"time":1261687072,"description":"Ã‚ÂµTorrent is a small and incredibly popular BitTorrent client. \nMicro-Sized Yet Feature Filled\n\nMost of the features present in other BitTorrent clients are present in Ã‚ÂµTorrent, including bandwidth prioritization, scheduling, RSS auto-downloading and Mainline DHT (compatible with BitComet). Additionally, Ã‚ÂµTorrent supports the Protocol Encryption joint specification (compatible with Azureus 2.4.0.0 and above, BitComet 0.63 and above) and peer exchange.\n\nResource-Friendly\n\nÃ‚ÂµTorrent was written with efficiency in mind. Unlike many torrent clients, it does not hog valuable system resources - typically using less than 6MB of memory, allowing you to use the computer as if it weren't there at all. Additionally, the program itself is contained within a single executable less than 220 KB in size.\n\nSkinnable and Localized\n\nVarious icon, toolbar graphic and status icon replacements are available, and creating your own is very simple. Ã‚ÂµTorrent also has support for localization, and with a language file present, will automatically switch to your system language. If your language isn't available, you can easily add your own, or edit other existing translations to improve them!\n\nActively Developed and Improved\n\nThe developer puts in a lot of time working on features and making things more user-friendly. Releases only come out when they're ready, with no schedule pressures, so the few bugs that appear are quickly addressed and fixed.\n\nChangeLog : \n\n- Fix: disconnect issue with seeds\n- Fix: uTP over Teredo at high speeds, and MTU problems on some kinds of networks\n- Fix: Add translations to new graph strings","torrent":{"xt":"urn:btih:e523e93d22915400a9a9a3197fb2d03dcc8bc92d","amp;dn":"uTorrent+2.0.0+RC2+-+Newest+Version","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e523e93d22915400a9a9a3197fb2d03dcc8bc92d","infoHashBuffer":{"type":"Buffer","data":[229,35,233,61,34,145,84,0,169,169,163,25,127,178,208,61,204,139,201,45]},"announce":[],"urlList":[]}}