{"title":"Van Morrison-1967-1979","uid":5367734,"size":1637228994,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e5bdb6baf5653331125dda1fd97ae500be201e3d&amp;dn=Van+Morrison-1967-1979&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"flitigalisa","files":259,"time":1266280363,"description":" &lt;a href=&quot;\nhttp://thepiratebay.se/user/flitigalisa&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/flitigalisa&lt;/a&gt;\n\nVan Morrison, OBE (born George Ivan Morrison; 31 August 1945) is a critically acclaimed Northern Irish singer and songwriter with a reputation for being stubborn and idiosyncratic. His live performances at their best are regarded as transcendental and inspired; while some of his recordings, such as the studio albums Astral Weeks and Moondance, and the live album It's Too Late to Stop Now, are widely viewed as among the greatest ever made. \nKnown as &quot;Van the Man&quot; to his fans, Morrison started his professional career when, as a young teenager in the late 1950s, he played a variety of instruments including guitar, harmonica, keyboards and saxophone in a range of Irish showbands who covered the popular hits of the day before rising to prominence in the mid-1960s as the lead singer of the gritty Northern Irish R&amp;B band Them with whom he recorded the garage band classic, &quot;Gloria&quot;. His solo career began under the pop-hit oriented guidance of Bert Berns with the release of the hit single &quot;Brown Eyed Girl&quot; in 1967. After Berns' death, Warner Bros. Records bought out his contract and allowed him several sessions to record Astral Weeks in 1968. Even though this album would gradually garner high praise, it was initially poorly received; however, the next one, Moondance, established Morrison as a major artist, and throughout the 1970s he built on his reputation with a series of critically acclaimed albums and live performances. Morrison continues to record and tour, producing albums and live performances that sell well and are generally warmly received; sometimes collaborating with other artists, such as Georgie Fame and The Chieftains. In 2008 he performed Astral Weeks live for the first time since 1968.\nMuch of Morrison's music is structured around the conventions of soul music and R&amp;B, such as the popular singles, &quot;Brown Eyed Girl&quot;, &quot;Moondance&quot;, &quot;Domino&quot; and &quot;Wild Night&quot;. An equal part of his catalogue consists of lengthy, loosely connected, spiritually inspired musical journeys that show the influence of Celtic tradition, jazz, and stream-of-consciousness narrative, such as Astral Weeks and lesser-known works such as Veedon Fleece and Common One. The two strains together are sometimes referred to as &quot;Celtic Soul&quot;.Morrison has received considerable acclaim, including six Grammy Awards, being inducted into both the Rock and Roll Hall of Fame and the Songwriters Hall of Fame, and appearing on several &quot;Greatest Artists&quot; lists.\n\n","torrent":{"xt":"urn:btih:e5bdb6baf5653331125dda1fd97ae500be201e3d","amp;dn":"Van+Morrison-1967-1979","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5bdb6baf5653331125dda1fd97ae500be201e3d","infoHashBuffer":{"type":"Buffer","data":[229,189,182,186,245,101,51,49,18,93,218,31,217,122,229,0,190,32,30,61]},"announce":[],"urlList":[]}}