{"title":"Mariah Carey feat. Ne-Yo - Angels Cry  (2nafish)","uid":5322904,"size":168976388,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e5e80095cc25a8079883d7ce3ad5a9c0ea86d7e7&amp;dn=Mariah+Carey+feat.+Ne-Yo+-+Angels+Cry++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1264925265,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos.\n\n\nMemoirs of an Imperfect Angel is the twelfth studio album by American pop and R&amp;B singer Mariah Carey. Originally scheduled for release on August 25, 2009, the project was released on September 29 through Island Records in the U.S. and November 23, 2009 with Mercury Records in the UK. The album was predominately produced and written by Carey, Christopher &quot;Tricky&quot; Stewart and Terius &quot;The-Dream&quot; Nash.\n\nIt was preceded by the U.S. top ten hit &quot;Obsessed&quot; and upon release the album was generally well-received by critics who awarded it 69/100 in aggregated reviews compared to 63/100 from her previous effort E=MC2 (2008). However, commercially the album only managed to debut and peak at number three in the U.S. with sales of 168,000; a disappointment compared to E=MC2 which sold over 463,000 and opened at number one.\n\nIt's second single, a cover of Foreigner's classic &quot;I Want to Know What Love Is&quot; reached number 60 on U.S. Hot 100 and top 30 in Europe whilst third US-only single, &quot;H.A.T.E.U.&quot;, only reached 72 on the U.S. R&amp;B charts. The album has also inspired a tour Angels Advocate Tour and a remix album Angels Advocate to be released in March 2010.\n\nCarey first made a promotional appearance on August 2, 2009 on Americas Got Talent, where she taped her performance of &quot;Obsessed&quot;. The episode aired on August 5, 2009. Then in September Carey began performing at her Live At the Pearl concerts in Las Vegas on September 10 and September 11, where she sang several of her famous hits, the first two singles from Memoirs of an Imperfect Angel, &quot;Obsessed&quot; and &quot;I Want to Know What Love Is&quot; and premiering two other songs from the album, &quot;Angels Cry&quot; and &quot;Up Out My Face&quot;. These were followed by appearing on The Oprah Winfrey Show on September 18, where Carey gave an interview with husband Nick Cannon and sang &quot;I Want to Know What Love Is&quot;. On October 5, Carey performed a concert for select contest winners at the P.C. Richard Theater in TriBeCa, New York where she sang &quot;Obsessed&quot;, &quot;H.A.T.E.U.&quot;, and &quot;I Want to Know What Love Is&quot; from the album. Also, she sang &quot;Always Be My Baby&quot; and &quot;We Belong Together&quot;. Carey resumed her Las Vegas shows at Live At the Pearl concerts on October 9 and October 10, this time changing the setlist and performing songs which she has either not sang live this millenium or debuting live performances of songs from previous albums. Carey also sang &quot;H.A.T.E.U.&quot;, in order to promote it as her third single, in addition to &quot;Obsessed&quot; and &quot;I Want To Know What Love Is&quot;.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:e5e80095cc25a8079883d7ce3ad5a9c0ea86d7e7","amp;dn":"Mariah+Carey+feat.+Ne-Yo+-+Angels+Cry++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5e80095cc25a8079883d7ce3ad5a9c0ea86d7e7","infoHashBuffer":{"type":"Buffer","data":[229,232,0,149,204,37,168,7,152,131,215,206,58,213,169,192,234,134,215,231]},"announce":[],"urlList":[]}}