{"title":"A dolls house (German) English subs PC version DivX LO-RES","uid":5238904,"size":633533750,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e6089e0a49f68e4e6221c33c8ffcd9c79cf6c45a&amp;dn=A+dolls+house+%28German%29+English+subs+PC+version+DivX+LO-RES&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mrizzo2","files":3,"time":1261661724,"description":"caveat emptor - LO-RES video, basic audio, PC version, 320 X 240\n\nI would like to thank myraharym fo the piratebay/you-tube user community for bringing us this lovely movie from Germany, Director Fassbinder's version of Henrik Ibsen's &quot;A dolls House&quot; titled &quot;Nora Helmer&quot; in the German rendition.\n\nWe did try to download the 1GB mpeg movie version on the net however the file we ended up with was damaged (header only showed that the movie was 12 minutes, and audio was missing in parts, no english subs that well matched could be found on the net and the resolution quality was quite low). Yet despite all this, we were thrilled to catch a glimpse of a movie no one seems to have to offer for sale anywhere! We even checked ebay.de I guess someone has to come up with a better original for a re-launch of it for TV use etc.\n\nThis movie is an important movie for mankind! Too much about the differences in people, in what is human nature and in what are the right perceptions and values that we can bring to situations based on our own preconceptions and sense of socialization additionally. The way forward for the human race must be decided on the right analysis of this movie in all its dimensions in fact.\n\nOf the various rtenditions out there, the Hopkins version didno justice at all to what is Ibsen's &quot;moral of the story&quot; as the contrast between the characters picked to play the leading roles is in fact altogether negating of what id Ibsens real intent in bringing out differences that we must all see.\n\nIn this regard, the most honest treatment of Ibsens story comes to us in the version from Norway (if you visit our movie reviews website at moviesbyrizzo.info you will find a freely downloadable copy of this &quot;out of print&quot; version too). The contrast between the characters played by the leading actors in that version is completely supreme in the right treatment of the text and is therefore of the greatest value for literary examination and critical evaluation of the issues involved.\n\nThat said, Fassbinder's Nora Helmer  has great value additionally in that we see the difference in the German treatment of this movie material in what is a rendition with much less tension and dissonance in the leading role actors as there is a great deal of congruence between them in personality relating and in mutual respect at a level that has to be taken note of, as it does result in longevity of the spirit for all concerned, Nora most especially (played by the lovely and very intelligent Ms. Margit Cartensen). We therefore think that even this extremely lo-res version of the movie (with included hard coded English subs) is a valuable enough offering for a viewing on your PC or ipod styled device, if the audio quality is reasonable enough to you too.\n\nWe simply converted the 11 parts of the flv posted on you-tube into a divx file that can be viewed at your leisure even on a laptop too especially as you sip a coffee at a nice cafe, in order to have a great &quot;conversation starter&quot; at your disposal, and for the edification of all our community members everywhere they are concerened about the greatest matters facing society as a whole.\n\nWe will soon have the American version of this movie for you as well, in DVD quality conversion as we will convert the PAL DVD since its the only one available on the market at this point. (Stars Ms.Jane Fonda).\n\nI was picked to play Torvald myself in this production at a summer class at the University of Alberta some decades ago now. I even wrote a different ending to the script in what would have been an &quot;attempted reconciliation&quot; between the actors, deciding that it just wouldnt have worked for the characters involved to make the effort involved, given the vast differences we see in the Norwegian treatment of the material, most especially as it remains most accurate in my view to the telling of this story by Henrik Ibsen ghimself, in the first place so as to best serve humankind.\n\nenjoy this lovely version from Germany as much beauty is supremely\nseen here for the benefit of those that would want to draw lessons\nfrom differening treatments of the material as indicated in the foregoing.\nThat all said, if you havent seen the version from Norway, you havent seen this movie at all. Thatrs just the truth I submit!\n\nMichael Rizzo Chessman\nmoviesbyrizzo.info\n\n\n\n\n  ","torrent":{"xt":"urn:btih:e6089e0a49f68e4e6221c33c8ffcd9c79cf6c45a","amp;dn":"A+dolls+house+%28German%29+English+subs+PC+version+DivX+LO-RES","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6089e0a49f68e4e6221c33c8ffcd9c79cf6c45a","infoHashBuffer":{"type":"Buffer","data":[230,8,158,10,73,246,142,78,98,33,195,60,143,252,217,199,156,246,196,90]},"announce":[],"urlList":[]}}