{"title":"Re-Drum - Another Path Between Universes [2010, FLAC, Downtempo]","uid":5455733,"size":210256978,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e7c55adf93897c1a5c2d094df2a9b448871136f6&amp;dn=Re-Drum+-+Another+Path+Between+Universes+%5B2010%2C+FLAC%2C+Downtempo%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":16,"time":1269317497,"description":"Here we have the new release by one of the most active and talented tT community members, and that's of course Re-Drum. Once again he is proving his diversity in electronic music genres. After the IDM and Ambient sounds on Different Analysis album, across Minimal and Dub Techno on Colours I &amp; II, we are honored to enjoy some Downtempo styled music on his latest album. This is one sample-intensive journey that you can rotate for a whole day while you're geeking around on the net. Thank you once again Re-Drum!\n\n\nMessage from author:\n\nSo, here's my last project: &quot;Another Path Between Universes&quot;. Most of the tracks were made during 2009 except &quot;Tempus Fugit&quot; which is an old experimentation on samples I've made 5 years ago. Like my previous release &quot;Differential Analysis&quot;, this album is mainly sample based, some of the tracks are just made out of samples (A long run, einstein on the beach). You'll hear a lot of samples from movies, I'll let you find which are those movies This album is mainly influenced by trip-hop, breaks and IDM but you'll hear some techno, house and electro influences also.\n\nI've been contacted by a chicago based label, Turbulent Calm records, to release my deep/dub techno tracks. I'll let you know when it will be released (on beatport, juno...). This EP will feature Purple, LSD, Vortex Dub and Sagan's Dream.\n\nYou can listen to them here: http://www.soundcloud.com/re-drum\n\nChill and Enjoy\nRe-Drum","torrent":{"xt":"urn:btih:e7c55adf93897c1a5c2d094df2a9b448871136f6","amp;dn":"Re-Drum+-+Another+Path+Between+Universes+%5B2010%2C+FLAC%2C+Downtempo%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7c55adf93897c1a5c2d094df2a9b448871136f6","infoHashBuffer":{"type":"Buffer","data":[231,197,90,223,147,137,124,26,92,45,9,77,242,169,180,72,135,17,54,246]},"announce":[],"urlList":[]}}