{"title":"Everything Is.","uid":5451551,"size":691154944,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e84557eeef66f615d7c6846a5602b4b6e4fda29b&amp;dn=Everything+Is.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Doohaas","files":1,"time":1269201525,"description":"Director's comments:\nIn the summer of 2009 I wanted to make a film that showed beautiful things the way they are, and the way the will continue to be. This project evolved into capturing these things as cinematically as possible while still keeping the technique minimal enough to correspond with the subject matter portrayed in the film, things as I found them, and as they will continue to be. Dan Smith and I started experimenting with still shots in July during many of our famous expeditions to the legendary &quot;Hole&quot; in South Portland, mostly these shots consisted of what we saw as the beauty in everyday life that seemed unusual to us, or especially prominent. \n\nI also knew that I wanted to rely heavily on music. All of my previous, while less serious attempts have all (at least the vast majority) revolved heavily around the soundtrack, this idea comes from my love for music above most things, and also from by belief that the moving images and sounds mingled together can and do create some of the most moving and satisfying art. \n\nAnyway, the reason this is being posted here is because most of the music in this film is made by myself under Drone, which is another thing I wanted to do which is to have this be something completely originally mine, I didn't quite do it though because there are a couple of songs from the fabulous Jesse Gertz in the film, but I don't care cause Gertz is the fucking man.\n\nMusic from the film may be found at:\n","torrent":{"xt":"urn:btih:e84557eeef66f615d7c6846a5602b4b6e4fda29b","amp;dn":"Everything+Is.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e84557eeef66f615d7c6846a5602b4b6e4fda29b","infoHashBuffer":{"type":"Buffer","data":[232,69,87,238,239,102,246,21,215,198,132,106,86,2,180,182,228,253,162,155]},"announce":[],"urlList":[]}}