{"title":"Christmas Vacation 1 + 2 with Dutch subs by QeroLX","uid":5405313,"size":1469349888,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e8909621473119a9ec950ae50896f220ad007622&amp;dn=Christmas+Vacation+1+%2B+2+with+Dutch+subs+by+QeroLX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"roel.aka.QeroLX","files":2,"time":1267569043,"description":"Christmas Vacation (1989)\n\nClark Wilhelm Griswold had some disastrous vacations at both Wallyworld and in Europe. Now he wants to compensate for this by having a special &quot;Griswold Family Christmas&quot;, and after months of careful planning he invites both of his parents, both of his wife, Ellen's parents even his uncle Louis and his senile aunt Bethany. However, what Clark does not realize that his no-manner cousin-in law Eddie was coming over in his new trailer. Clark even prepares his house for Christmas with over 20,000 lights and a tree that does not even fit in the living room. As Christmas eve comes, Clark will soon realize that a series of unfortunate events will start to unravel for him, as the Christmas Turkey would burst and have no meet, his aunt's cat would chew on the lights and his uncle Louis will burn up his tree, and he will even soon discover that his boss have cut the Christmas bonus to give him a month in the jelly club, can Clark keep it together and understand the true meaning of Christmas?\n\nChristmas Vacation 2: Cousin Eddie's Island Adventure (2003)\n\nThough Eddie's fired right at Christmastime, his boss sends him and his family on a South Pacific vacation, hoping Eddie won't sue him after being bitten by a lab monkey. When the Tuttle family winds up trapped on a tropical island, however, Eddie manages to provide for everyone and prove himself a real man.\n\nby QeroLX\n\nEnjoy The Movie &amp; Seed!!\n\n","torrent":{"xt":"urn:btih:e8909621473119a9ec950ae50896f220ad007622","amp;dn":"Christmas+Vacation+1+%2B+2+with+Dutch+subs+by+QeroLX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8909621473119a9ec950ae50896f220ad007622","infoHashBuffer":{"type":"Buffer","data":[232,144,150,33,71,49,25,169,236,149,10,229,8,150,242,32,173,0,118,34]},"announce":[],"urlList":[]}}