{"title":"Em. Griffin, Szerezzunk baratokat","uid":5268581,"size":889856,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e8b277c4858fd9759be12399ab4e7d733e173611&amp;dn=Em.+Griffin%2C+Szerezzunk+baratokat&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1262972752,"description":"Miert kevesbe fontos a baratsag, mint a szerelem? - teszi fel a kerdest Em Griffin. Mert az atlagember nem tud mit kezdeni az intimitassal. Pedig az igaz baratsagok segitsegevel melyulhet onismeretunk, erosodhet onbecsulesunk, masokba vetett bizalmunk, konnyebben oldjuk meg problemainkat. Az amerikai kommunikaciokutato ebben a koteteben a baratsag lelektani, szocialpszichologiai, kommunikacioelmeleti, teologiai es etikai szempontjait jarja korul. A rejtozkodoen tudomanyos kozlesmodot a szemleletes peldak, a szemelyesseg, az oszinte onfeltaras, a segito elkotelezettseg teszi mindenki szamara ertheto, es ugyanakkor szivhez szolo olvasmannya. A jo kommunikaciohoz onvizsgalaton es onismereten at vezet az ut; a baratsagok megtartasa erdekeben bizalmat kell epiteni, egyezmenyekre kell jutni es tudni kell megbocsatani is. Erre tanit az elvezetesen megirt, olvasmanyos, finom humorral atszott, am tartalmaban nagyon komoly es oszinte konyv. Em Griffin kotete eppen ezert hezagpotlo a baratsagrol szolo szakirodalomban. Dr. Buda Bela \n","torrent":{"xt":"urn:btih:e8b277c4858fd9759be12399ab4e7d733e173611","amp;dn":"Em.+Griffin%2C+Szerezzunk+baratokat","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8b277c4858fd9759be12399ab4e7d733e173611","infoHashBuffer":{"type":"Buffer","data":[232,178,119,196,133,143,217,117,155,225,35,153,171,78,125,115,62,23,54,17]},"announce":[],"urlList":[]}}