{"title":"Stargate SG-1 S04 D3 PAL 2Lions-Team","uid":5422773,"size":4631800849,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:e95b2af6c16a0f34cf674bd278a44d2a1eb2cb41&amp;dn=Stargate+SG-1+S04+D3+PAL+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"wietseherman","files":-1,"time":1268140046,"description":"Stargate SG-1 S04 D3 PAL 2Lions-Team\n\nScorched Earth - Stargate SG-1 begeleidt een kolonisatiepoging van een erg gevoelig ras. Het blijkt dat een ander buitenaards ras de planeet ook voor kolonisatie geschikt acht, en daartoe de hele planeet steriliseert.\n\nBeneath the Surface - De geheugens van de leden van SG-1 wordt gewist waarna ze aan het werk gezet worden in een ondergrondse faciliteit.\n\nPoint of No Return - Een man die overal complotten inziet weet verdacht veel van het Stargate programma.\n\nTangent - De luchtmacht heeft een Death Glider omgebouwd om er gebruik van te maken. O'Neill en Teal'c gaan een testvlucht maken, maar helaas gaat er iets mis.\n\nScorched Earth - Earth resettles a group of Enkaran refugees, a race of humans who have become specifically adapted to their homeworld and thus require exact environmental conditions, to another planet, but an alien spaceship is transforming the new planet into a hostile environment. \n\nBeneath the Surface - The members of SG-1 have had their memories altered and been put to work in an underground industrial complex. They must recover their memories in order to escape. \n\nPoint of No Return - An odd man called Martin Lloyd has inexplicable knowledge of the Stargate and claims that he is from outer space. He remembers his home address.\n\nTangent - Teal'c and O'Neill test-fly the first experimental aircraft based on combined Earth and Goa'uld technologies, but soon someone else takes control of the X-301.\n\nSource : retail\nFormat : DVD5\nVideo : Pal\nSound : DD 5.1\nLanguages : EN\nMenu : Yes\nExtra : No\nSubs : EN NL FR\nCover: Included\n\nBrought to you by\nB2B\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum   &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl/index.php&lt;/a&gt;\n\n2Lions-Team for all your Dutch MOVIES and more\n*****************************************************\nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden.\nDon`t quit after you finished the download, but keep seeding.\n*****************************************************\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name.\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n\n*****************************************************\t\t","torrent":{"xt":"urn:btih:e95b2af6c16a0f34cf674bd278a44d2a1eb2cb41","amp;dn":"Stargate+SG-1+S04+D3+PAL+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e95b2af6c16a0f34cf674bd278a44d2a1eb2cb41","infoHashBuffer":{"type":"Buffer","data":[233,91,42,246,193,106,15,52,207,103,75,210,120,164,77,42,30,178,203,65]},"announce":[],"urlList":[]}}