{"title":"Corbin Fisher - - - Blowing Ian ((MictrmbL))","uid":5204352,"size":134290665,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:ea0ec6a785bf48732dd139034f37c391039bc6dc&amp;dn=Corbin+Fisher+-+-+-+Blowing+Ian+%28%28MictrmbL%29%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mictrmbl","files":10,"time":1260304533,"description":"From the vaults of Corbin Fisher:\n\nThis one was a fun one to film, in no small part because it's always fun watching Logan break in a new CF stud and be the one to first introduce them to guy/guy fun.\n\nBut another reason it was fun to film is that Ian was convinced the entire video would be a disaster. He was convinced it would take hours to film because he would not get aroused in the slightest. He wasn't sure he'd be able to get hard at all and, even if he did, didn't think he could ever cum from having a guy blow him. It's not uncommon for our straight studs to feel this way and warn us about how badly they'll do when getting off with a guy for the first time. What these guys don't know is that we know what we're doing here, and Logan most definitely knows what he's doing! ;)\n\nIan finds that out pretty quick in this video, and while you could tell he was having tons of fun with his guy/girl vids over on ACS, you could also tell he was pretty blown away but how good it felt to have Logan blowing him in this one! Don't ever doubt the skill of a master like Logan!! hehe.\n\nObviously being straight and agreeing to let another guy get you off is no trivial matter. But we see again and again here on CF that once over the mental hurdle of being willing to give it a shot in the first place, a young and ready college cock doesn't need a lot of convincing to figure out what it likes and what makes it feel good and those feelings quickly take over so that, beyond just his hard cock, it's also his mind being blown by it all!","torrent":{"xt":"urn:btih:ea0ec6a785bf48732dd139034f37c391039bc6dc","amp;dn":"Corbin+Fisher+-+-+-+Blowing+Ian+%28%28MictrmbL%29%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea0ec6a785bf48732dd139034f37c391039bc6dc","infoHashBuffer":{"type":"Buffer","data":[234,14,198,167,133,191,72,115,45,209,57,3,79,55,195,145,3,155,198,220]},"announce":[],"urlList":[]}}