{"title":"Cher - Save Up All Your Tears  (2nafish)","uid":5364388,"size":119480324,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:ea144f7ad6c36398611aeacda643d6aa79378bf0&amp;dn=Cher+-+Save+Up+All+Your+Tears++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1266220282,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Save Up All Your Tears&quot; is a song written by Desmond Child and Diane Warren, and originally released by Welsh singer Bonnie Tyler. The song was subsequently covered by other artists including Robin Beck and Cher.\n\nThe original Bonnie Tyler version of the song was featured on the album called Notes From America in the United States and entitled Hide Your Heart throughout the rest of the world. The song was produced by its co-writer, Desmond Child, who was enjoying chart success in the US with singles by Bon Jovi including &quot;Livin' on a Prayer&quot;. The single, released in 1988, did not approach the success of previous releases like &quot;Total Eclipse of the Heart&quot; and &quot;Holding Out for a Hero&quot;, and charted only on airplay charts in Europe.\n\nIn 1991, Cher released a cover of the song as the second U.S. and third European single from her twenty-first album, Love Hurts. While Beck was the only artist to take the song Top Ten, Cher's version of the song did the best in the U.S. and the UK, cracking the top 40 to peak at #37 in both markets.\n\nCher's music video for &quot;Save Up All Your Tears&quot; was rather racy, but not as racy as its predecessor &quot;If I Could Turn Back Time&quot;. In the video Cher sports three different wigs as well as three different outfits. She first wears a light pink lingerie nighty and a large red curly wig and next another skimpy black lingerie outfit with a dark brown curly wig. The final outfit she wears was one of her most extravagant to date, a dominatrix-themed black leather and chain top, with fishnet stockings and leather nets for sleeves, accompanied by Cher's signature long straight black hair. Twice during the video she turns around to display that she is wearing a thong which reveals a rather large tattoo across her backside. A photograph of this outfit taken by Herb Ritts would be used for the poster for her Love Hurts Tour. Under the banner of &quot;Cher's Back!&quot; with this buttock-revealing poster Cher performed several dates in Europe during her Love Hurts Tour. Later she also performs the song during the reharsal for her Farewell Tour, this performance is available only as a Bonus Material in the DVD of the show.\n\nLove Hurts is the twenty-first studio album by American singer-actress Cher, released on June 11, 1991 by Geffen Records. The RIAA certified it Gold on August 27, 1991. It is the final studio album with the record label Geffen. The lead single from the album was, &quot;Love and Understanding&quot; and the follow-up singles were &quot;Save Up All Your Tears&quot;, &quot;Love Hurts&quot;, &quot;Could've Been You&quot; and &quot;When Lovers Become Strangers&quot;.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:ea144f7ad6c36398611aeacda643d6aa79378bf0","amp;dn":"Cher+-+Save+Up+All+Your+Tears++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea144f7ad6c36398611aeacda643d6aa79378bf0","infoHashBuffer":{"type":"Buffer","data":[234,20,79,122,214,195,99,152,97,26,234,205,166,67,214,170,121,55,139,240]},"announce":[],"urlList":[]}}