{"title":"Discovery.The Hottest Place on Earth (2009).WS.PDTV.XviD.Ekolb","uid":5272033,"size":365805504,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:eac9cd8072273be1cba05aadea09d829aa26d402&amp;dn=Discovery.The+Hottest+Place+on+Earth+%282009%29.WS.PDTV.XviD.Ekolb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Ekolb","files":3,"time":1263273481,"description":"HOTTEST PLACE ON THE EARTH (2009)\n\nThe Danakil Depression in Northern Ethiopia is the hottest, harshest and most scientifically rich area on Earth. There is almost no water. It is one of the most geologically active areas on the planet, where volcanoes and earthquakes rip the Earth apart, opening vast fissures in a matter of hours. And despite boasting exceptional geology, an extraordinary climate (with temps shooting to 60 C), distinctive tribal community and logic-defying wildlife - virtually nothing is known of this unforgiving region. Now, a team of top scientists and international experts - including volcanologists, anthropologists, medics, zoologists, and vets - participate in a cutting-edge, multi-discipline mission to explore one of the least known but most fascinating regions on the planet. Here, they meet the Afar, a legendary warrior tribe, who rely on their camels and goats for survival.\n\nBBC presenter Kate Humble investigates how tough life is for an Afar woman; veterinary scientist Steve Leonard wants to learn about the relationship between the Afar and their animals, and to help with animal medicine where he can; Dr Mukul Agarwal looks at the health issues faced in this most hostile of environments. Then, earth scientist Dougal Jerram looks at the extraordinary volcanic activity of the region and its impact on the bigger geological picture of the Rift Valley; and biologist Richard Wiese searches for extreme life forms in the boiling soil of a massive volcanic fissure.\n\nFormat            : AVI\nLength            : 349 MiB for 43mn 29s 448ms\n\nCodec             : XviD\nSource            : PDTV\nLanguage          : English UK\nSubtitles         : None\nGenre             : Nature/Science\n\nVideo #0          : MPEG-4 Visual at 977 Kbps\nAspect            : 592 x 336 (1.762) at 29.970 fps\n\nAudio #0          : MPEG Audio at 130 Kbps\nInfos             : 2 channels, 48.0 KHz\n\nEnjoy!\nEkolb","torrent":{"xt":"urn:btih:eac9cd8072273be1cba05aadea09d829aa26d402","amp;dn":"Discovery.The+Hottest+Place+on+Earth+%282009%29.WS.PDTV.XviD.Ekolb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eac9cd8072273be1cba05aadea09d829aa26d402","infoHashBuffer":{"type":"Buffer","data":[234,201,205,128,114,39,59,225,203,160,90,173,234,9,216,41,170,38,212,2]},"announce":[],"urlList":[]}}