{"title":"[DvdRip-Xvid-Ita-Mp3]Interceptor[survivalofmisa]","uid":5265147,"size":729747456,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:eaf8eb7692a50f2b6b54124bea8871af3af9e885&amp;dn=%5BDvdRip-Xvid-Ita-Mp3%5DInterceptor%5Bsurvivalofmisa%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"misafor","files":1,"time":1262825309,"description":"\n\n\nAustralia. In un futuro non troppo lontano (&quot;a few years from now...&quot; indica all'inizio) la societÃƒÂ  com'ÃƒÂ¨ oggi costituita non esiste piÃƒÂ¹. Le strade sono in balia di criminali psicopatici che guerreggiano contro gli ormai pochi tutori dell'ordine. Max Rockatanksy (Mel Gibson) ÃƒÂ¨ la punta di diamante della Main Force Patrol, ed ÃƒÂ¨ tra i piÃƒÂ¹ abili agenti in automobile nella sfida contro le gang che dominano le autostrade. Dopo un inseguimento, nel quale perde la vita il Nightrider, leader di una banda di psicopatici in motocicletta, Max si ritrova nel centro del mirino di questi personaggi che vogliono vendicare la morte del loro leader. Toecutter (Hugh Keays-Byrne), nuovo capo della gang, comincia uccidendo il suo migliore amico e collega Jim Goose (Steve Bisley), colpevole di aver arrestato Johnny The Boy (Tim Burns) e di aver minacciato la banda stessa. In seguito a questo, Max, sconvolto, decide di abbandonare la Main Force, per ritirarsi in campagna con l'amata moglie Jessie (Joanne Samuel) e il figlioletto Sprog. Dopo un inizio positivo, la famiglia si ritrova per disgrazia ad incontrare la gang di Toecutter, e nonostante una fuga verso il nord e un'apparente rinnovata tranquillitÃƒÂ , vengono raggiunti e perseguitati, fino alla tragedia finale nella quale Jessie e Sprog, attaccati dalla banda di criminali, vengono brutalmente uccisi investiti dalle motociclette, senza che Max possa fare niente. A seguito della morte della famiglia, Max decide per la vendetta piÃƒÂ¹ spietata; reindossa il completo di pelle nera della Main Force Patrol, prende senza permesso il veicolo piÃƒÂ¹ potente del parco macchine, la V8 Interceptor (detta anche Pursuit Special) dotata di compressore volumetrico su testata e 600 cavalli di potenza, e si mette alla caccia della gang. Dopo aver ucciso alcuni dei membri (tra i quali Cundalini e Mudguts) sfidandoli con la propria auto, si mette alla ricerca di Toecutter, Bubba Zanetti e Johnny The Boy. Dopo averli inseguiti, ma senza essere riuscito a raggiungerli, si ferma davanti alla moto abbandonata di Johnny The Boy. In realtÃƒÂ  ÃƒÂ¨ un tranello, e Max viene ferito alla gamba sinistra con un colpo di pistola e successivamente con le moto gli passano sopra il braccio destro, lasciandolo a terra incapace di muoversi. Mentre Bubba sta per finirlo, Max accecato dalla rabbia e con le poche forze, raccoglie il suo fucile a canne mozze e uccide il biker.\n","torrent":{"xt":"urn:btih:eaf8eb7692a50f2b6b54124bea8871af3af9e885","amp;dn":"%5BDvdRip-Xvid-Ita-Mp3%5DInterceptor%5Bsurvivalofmisa%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eaf8eb7692a50f2b6b54124bea8871af3af9e885","infoHashBuffer":{"type":"Buffer","data":[234,248,235,118,146,165,15,43,107,84,18,75,234,136,113,175,58,249,232,133]},"announce":[],"urlList":[]}}