{"title":"Darwin's Dangerous Idea (BBC, 2009), Complete DVDRip","uid":5235872,"size":2346902724,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:eb22e4648a2453e931ed88c73904f861ad9b2b7e&amp;dn=Darwin%5C%27s+Dangerous+Idea+%28BBC%2C+2009%29%2C+Complete+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Blodhosta","files":4,"time":1261528529,"description":"(Note that this is NOT the 7 part series produced by PBS under the same title! And BTW, it's not related to Daniel Dennett's 1995 book by the same name either.)\n\nIn three 60 minute long episodes Andrew Marr takes an unflinching look into the many aspects of Charles Darwin's discovery of evolution, and the many influences - past and present, good and bad - it has had on the world.\n\n-----------------------------------\n\n  Episode 1: Body and Soul\nThe first episode takes it's start with the voyage of the H.M.S. Beagle, the delivery of three people back from England to their native country of Tierra del Fuego, and Darwin's thoughts about what he experienced on this journey, which he would come to call the most important event of his life. It then follows the early history of the theory, how the book was received when published, the &quot;monkey trials&quot;, and how - both then and now - conflict is caused by the friction of evolutionary understanding with traditional thinking and mythology still alive today. Just what is our understanding of evolution doing for our self-identity and our understanding of morality?\n\n  Episode 2: Born Equal?\nIn the second episode we take a look at the darkest ways in which the discovery has influenced social ideologies, from justifying genocide in Europe to eugenicist projects to &quot;weed out the unfit&quot; in the USA. But it ends on a lighter note, with the possibillities that our expanding understanding of biology presents us with to limit suffering and influence our own nature, while not neglecting the demanding ethical decisions that may lie ahead.\n\n  Episode 3: Life and Death\nFinally, we turn to the interconnectedness of all life on earth and our place, as the dominant species, in the myriad of life forms. Many species have come and gone, and when one goes away others have evolved to fill the gap, but what about extinction on the scale that we are now seeing, and the exploitation of habitats such as the rainforests? Now that we have the knowledge; what do we do with it?\n\n-----------------------------------\n\n * Video Codec: XviD\n * Video Bitrate: 1617 KB/s\n * Video Aspect Ratio: 1:76\n * Video Resolution: 704 x 400\n * Audio Codec: (Dolby AC3)\n * Audio Bitrate: 192 kb/s 48000Hz\n * Run-Time: 58mins\n * Framerate: 25FPS\n * Number of Parts: 3\n * Part Size: 746mb/s\n * Ripped by artistharry\n * Subtitles: English (only when other languages are spoken)\n * Source: DVD\n\n-----------------------------------\n\nMy connection isn't that good so any help seeding will be greatly appreciated! And anyone leaving a &quot;thank you!&quot; gets a gold star in my book. ^^\n\nTake care!\n\n/Blodhosta","torrent":{"xt":"urn:btih:eb22e4648a2453e931ed88c73904f861ad9b2b7e","amp;dn":"Darwin%5C%27s+Dangerous+Idea+%28BBC%2C+2009%29%2C+Complete+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb22e4648a2453e931ed88c73904f861ad9b2b7e","infoHashBuffer":{"type":"Buffer","data":[235,34,228,100,138,36,83,233,49,237,136,199,57,4,248,97,173,155,43,126]},"announce":[],"urlList":[]}}