{"title":"The Rescuers 2002  2Lions-Team","uid":5203758,"size":4598471538,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:eb9f19cda12d141c6fd0731e66b4873597d42176&amp;dn=The+Rescuers+2002++2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kellebel010","files":-1,"time":1260286095,"description":"The Rescuers 2002  \n\nDe Reddertjes - 2002 \n\n  \n\nDe 23ste tekenfilmklassieker van Disney, THE RESCUERS, is een avontuur in vliegende vaart vol oprechte emoties, waarin de moedige heldendaden van twee dappere muizen worden gevolgd als zij op weg gaan naar de zompige moerassen van Devil's Bayou om het vermiste weesmeisje Penny te redden! \nHet avontuur begint wanneer Penny's noodkreet in een fles in handen belandt van de schichtige maar slimme muis Bernard en zijn elegante partner juffrouw Bianca. De twee moedige helden doen hun belofte aan The Rescue Aid Service eer aan als zij Penny in allerijl redden uit de valse klauwen van de gemene Madame Medusa... die Penny nodig heeft om een juweel van onschatbare waarde te vinden. Maar eerst moeten Bernard en Bianca zien te ontsnappen aan de vlijmscherpe tanden van de twee krokodillen van Madame Medusa en moeten ze met behulp van het navigatietalent van een plaatselijke libel proberen de verscholen rivierboot van Madame Medusa te vinden! Boordevol actie, spanning en met onvergetelijke, hartveroverende moeraswezens is THE RESCUERS een tijdloos verhaal over heldhaftigheid en vriendschap, geheel in de stijl van Disney! \n\n\n\nEnglish\n\nFrom Walt Disney's original team of legendary master animators who brought you THE JUNGLE BOOK comes a thrilling adventure and timeless tale overflowing with action, suspense, and extraordinary little heroes you can't help but love! Join the shy but brave mouse Bernard and his glamorous partner Miss Bianca -- two tiny heroes on a great big mission to save a young girl named Penny who has sent an urgent call for help! Taking off on the wings of their trusted albatross friend Orville, Bernard and Bianca soar to the marshy swamp of Devil's Bayou. There, they find themselves on the riverboat hideout of the hilariously evil Madame Medusa, who needs Penny to retrieve the world's largest diamond! With Oscar(R)-nominated music (1977 Best Song, &quot;Someone's Waiting For You&quot;), a snappy remastering, and bonus features with a multitude of surprises, THE RESCUERS is high-flying fun you'll want to share with your loved ones again and again! \n\n\n\n\n\nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail\nMenu : Yes\nExtra : Yes \nSubs : Dutch, English, French\nAudio : Dutch, English, French DD 5.1  Arabic 3.2\nCover : Yes\nCategory: Animation \nGenre: Animation \nRelease Date: 07-08-2002 \nYear: 1977 \nAspect Ratio: 1:66:1, 16:9 \nLength: 75 Minutes \n \nGenre : Animatie\nFamiliefilm\nKinderfilm\n \n\n\nWeblink : http://disneyinfo.nl/dvddetail.php?film=24\n\nWeblink : http://disneydvd.disney.go.com/the-rescuers.html\n    \n*****************************************\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan.!!\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n\n*****************************************\n\nBrought to you by\n\nKellebel\n\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n     \n   &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt;\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden. \nDon`t quit after you finished the download, but keep seeding.","torrent":{"xt":"urn:btih:eb9f19cda12d141c6fd0731e66b4873597d42176","amp;dn":"The+Rescuers+2002++2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb9f19cda12d141c6fd0731e66b4873597d42176","infoHashBuffer":{"type":"Buffer","data":[235,159,25,205,161,45,20,28,111,208,115,30,102,180,135,53,151,212,33,118]},"announce":[],"urlList":[]}}