{"title":"TNA Designation X 2010","uid":5453802,"size":1562363040,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:ec5276e4bbe6200faabd6175bb30d19ca3b5fc75&amp;dn=TNA+Designation+X+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"den1997","files":1,"time":1269266681,"description":"Current Card:\n\nContract Match - If &quot;The B4nd&quot; wins they get TNA contracts.\nKevin Nash &amp; Eric Young Vs. The B4nd (Hall &amp; Pac)\n\nPrediction: Hall pins Nash after a finger poke, and then they all gang assault Eric Young while we all die a little bit inside.\n\nKurt Angle Vs. Mr. Anderson\n\nPrediction: They're feuding over a slab of metal, and for some reason Mr. Anderson appears to be Anti-American. We all lose this match.\n\nTNA Knockouts Championship - First Blood Match\nTara Ã‚Â© Vs. Daffney\n\nPrediction: Daffney is the only girl on the roster crazy enough to take big bumps, so I assume she loses this match due to being the only person willing to blade in the entire Knockouts division.\n\nTNA X-Division Championship\nDoug Williams Ã‚Â© Vs. Shannon Moore\n\nPrediction: I don't even know how Shannon Moore got a title shot. No, fuck you. You don't either. TNA doesn't even know how he got a title shot and they book the cards. Doug Williams wins out of fear that Shannon will begin dry humping the belt upon winning it.\n\nTNA World Tag Team Championship\nMatt Morgan and Hernandez Ã‚Â© Vs. Beer Money\n\nPrediction: Who is the face in this match? Who are the heels? Why am I watching this? I predict Beer Money wins when Matt Morgan spends the entire match flexing rather than offering a tag. And then Hernandez shanks him.\n\nLadder Match - Winner Earns An X-Division Title Shot\nKazarian Vs. Daniels Vs. Amazing Red Vs. Brian Kendrick\n\nPrediction: Wouldn't it make more sense for the other match to be the ladder match, and for this match to be the Ultimate X match? I mean they're fighting for a X-DIVISION title shot. Kazarian wins because TNA is very determined to push a guy who resembles Stephen Seagal.\n\nUltimate X Match - Winner Earns A Tag Team Title Shot\nThe Motor City Machine Guns Vs. Generation Me\n\nPrediction: Good thing the Ultimate X match just consists of two teams, rather than being the intense every man for himself match it was designed to be. Motor City Machine Guns win specifically just because I have to assume TNA is bound to push them eventually.\n\nTNA Championship\nAJ Styles Ã‚Â© Vs. Abyss\n","torrent":{"xt":"urn:btih:ec5276e4bbe6200faabd6175bb30d19ca3b5fc75","amp;dn":"TNA+Designation+X+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec5276e4bbe6200faabd6175bb30d19ca3b5fc75","infoHashBuffer":{"type":"Buffer","data":[236,82,118,228,187,230,32,15,170,189,97,117,187,48,209,156,163,181,252,117]},"announce":[],"urlList":[]}}