{"title":"Belphegor - Der Geistertreiber  (2nafish)","uid":5270356,"size":141701124,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:ec5996465332c255dcd3b24514aceb8685ef5106&amp;dn=Belphegor+-+Der+Geistertreiber++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1263035542,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nBelphegor is an Austrian blackened death metal band from Salzburg, originally formed in 1991 under the name Betrayer before changing their name in 1993. They are named after the demon Belphegor.\n\nWalpurgis Rites - Hexenwahn is the eighth studio album by the Austrian blackened death metal band Belphegor.\n\nLike its predecessors, Pestapokalypse VI and Bondage Goat Zombie, the album was recorded and produced with German producer Andy Classen. On August 25 the band made the song &quot;Walpurgis Rites&quot; available for streaming on their myspace page along with the lyrics on their website. As of October 1 the video for 'Der Geisterstreiber' is now available.\n\nIn January 2009, an announcement was made stating the band was working on a new album, and Nefastus again would be responsible for the drums. It was reported recording had begun in February 2009, and Nefastus completed recording the drum parts. On February 23, 2009, Helmuth announced the rhythm guitar and bass lines had been recorded in the second studio session. Ostensibly, the new album was tentatively titled Hexenwahn - Totenkult:\n\n    As opposed to previous tales of the inquisition, this focuses upon the darker, more dismal of the mighty, powerful witches who conjure and worship demons. Those who have a pact with the forces of hell through the occult. The concept deals with demonology, witchcraft/ Hexenwahn, depraved suKKubi, blackest erotica, and as always, the grand devil, himself.\n\nOn 9 June 2009, the album's title was revealed to be Walpurgis Rites - Hexenwahn. On 3 July 2009, it was announced that the recording was completed and that the album would be released in October 2009. Furthermore, Brazilian artist Marcelo Hvc commenced work on the album cover and imagery.\n\nThe band embarked on another North American tour in April 2009, which was headlined by Kreator and Exodus, along with Warbringer and Epicurean.\n\nIn November 2009, the band joined the Heathenfest tour in North America, along with Eluveitie, Alestorm, KivimetsÃƒÂ¤n Druidi, and Vreid. In Dezember 2009, the band played in South America with Obituary.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:ec5996465332c255dcd3b24514aceb8685ef5106","amp;dn":"Belphegor+-+Der+Geistertreiber++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec5996465332c255dcd3b24514aceb8685ef5106","infoHashBuffer":{"type":"Buffer","data":[236,89,150,70,83,50,194,85,220,211,178,69,20,172,235,134,133,239,81,6]},"announce":[],"urlList":[]}}