{"title":"Corbin Fisher - - - Noah Fucks Kip ((MictrmbL))","uid":5401158,"size":205641459,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:ed9b93c247e71bdbbfafb3480b2709de07a31fde&amp;dn=Corbin+Fisher+-+-+-+Noah+Fucks+Kip+%28%28MictrmbL%29%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mictrmbl","files":47,"time":1267427432,"description":"From the vaults of Corbin Fisher:\n\n\nI have to confess that Noah's newfound willingness to get into all sorts of hardcore action with others guys has me practically behaving like a kid with a new toy - that toy being Noah's awesome dick, of course! Now before you draw any crazy conclusions, no! I do not get to play with it. Haha. But, I do get to see Noah use that hot dick on other CF studs! Virtually every time I look at or think about one of our guys I think to myself, &quot;Oh! It'd be hot seeing him get fucked by Noah!&quot;\n\nKip was the lucky guy about whom I thought such a thing just before this video was filmed! There was no denying just how much Kip enjoys being fucked, as made clear in his earlier sessions of doing just that, and I had a feeling he'd really, really enjoy taking on Noah's big dick. As hard as Kip's own cock is throughout their session together here, that apparently was indeed the case!\n\nHis awesome dick is far from the only thing Noah has going for him, though! Since he agreed to give things with guys a shot he's taken to it quite well and been one heck of a performer. He's quickly learned what feels good and, also, what makes another guy feel good. He's done a great job of overcoming those initial jitters and just learning to have fun and enjoy what's going on! So, not only does he have that great dick attached to a great body and topped off with a hot face, but he also knows how to put all of that to work!","torrent":{"xt":"urn:btih:ed9b93c247e71bdbbfafb3480b2709de07a31fde","amp;dn":"Corbin+Fisher+-+-+-+Noah+Fucks+Kip+%28%28MictrmbL%29%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed9b93c247e71bdbbfafb3480b2709de07a31fde","infoHashBuffer":{"type":"Buffer","data":[237,155,147,194,71,231,27,219,191,175,179,72,11,39,9,222,7,163,31,222]},"announce":[],"urlList":[]}}