{"title":"MTV TRENDSETTER REMIXES 2010","uid":5331252,"size":368973708,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:eda04efae3dc97e5f688f7f650a38ea48e2aea5b&amp;dn=MTV+TRENDSETTER+REMIXES+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"burciaga","files":38,"time":1265182666,"description":"REMIXES ON MTV HITS and GRAMMY NOMINEES of 2009, 2010:\n\n01 - Kanye West feat. Lupe Fiasco - Touch to Sky (Mark Holiday aka Trendsetter remix)\n02 - Lady Gaga - Paparazzi (Trendsetter aka Mark Holiday remix)\n03 - Kesha - Tik Tok (Trendsetter aka Mark Holiday remix)\n04 - Michael Jackson - Smooth Criminal (Mark Trendsetter Holiday remix)\n05 - Lady GaGa - Poker Face (Mark Holiday aka Trendsetter remix) essential mix\n06 - Missy Elliott - Best Best (Mark Holiday aka Trendsetter remix)\n07 - Tony Williams - Dreaming of Your Love (Mark Trendsetter Holiday remix)\n08 - Ciara feat. Justin Timberlake - Love, Sex, Magic (Mark Holiday aka Trendsetter remix)\n09 - Black Eyed Peas - Boom Boom Pow (Mark Holiday aka Trendsetter remix)\n10 - Flavia Prado - High (Mark Holiday aka Trendsetter remix)\n11 - Timbaland ft Keri Hilson, Nicole Shersinger- Scream (Mark Holiday aka Trendsetter remix)\n12 - Flavia Prado - On and On (produced by Trendsetter aka Mark Holiday)\n13 - Lady GaGa - Love Game (Mark Holiday aka Trendsetter remix) MTV video edit\n14 - Cassie - Me &amp; You (Mark Trendsetter Holiday remix)\n15 - Tokyo Diiva - Annihilation (produced by Trendsetter aka Mark Holiday)\n16 - Madonna - Miles Away (Mark Holiday aka Trendsetter remix)\n17 - Lovelise - Getaway (produced by Trendsetter aka Mark Holiday)\n18 - Keri Hilson feat. Timbaland - Return The Favor (Trendsetter aka Mark Holiday remix)\n19 - Kanye West - Love Lockdown (Trendsetter aka Mark Holiday remix)\n20 - Flavia Prado feat. Mark McLaughlin - Dance (produced by Trendsetter aka Mark Holiday)\n21 - Rihanna - Music (Mark Trendsetter Holiday remix)\n22 - The Pussycat Dolls featuring Snoop Dogg - Buttons (Mark Trendsetter Holiday remix)\n23 - M.I.A. - XR2 (Mark Trendsetter Holiday remix)\n24 - Lady GaGa - Love Game (Mark Holiday aka Trendsetter remix) Electro mix\n25 - Flavia Prado - Sorry Laura (produced by Trendsetter aka Mark Holiday)\n26 - Keri Hilson feat. Lil Wayne - Turn Me On (Trendsetter aka Mark Holiday remix)\n27 - Katy Perry - I Kissed a Girl (Trendsetter aka Mark Holiday remix)\n28 - M.I.A. - Boyz (Mark Holiday aka Trendsetter remix)\n29 - Indiggo - Loud (produced by Trendsetter aka Mark Holiday)\n30 - Kanye West - Love Lockdown (Mark Holiday aka Trendsetter remix) Miami edit\n31 - Lady GaGa - Love Game (Trendsetter aka Mark Holiday remix)\n32 - Flavia Prado ft Mark McLaughlin - Dance (Mark Holiday aka Trendsetter remix)\n33 - Milissa - Sunshine (produced by Trendsetter aka Mark Holiday)\n34 - Britney Spears - Give Me More (Trendsetter aka Mark Holiday remix)\n35 - Flavia Prado - High (produced by Trendsetter aka Mark Holiday)\n36 - Lady GaGa - Poker Face (Mark Holiday aka Trendsetter remix feat. Jessica Burciaga mix)\n37 - Red - Ha-Ha-Ha (produced by Trendsetter aka Mark Holiday)\n38 - Lady GaGa feat Colby O'Donis - Just Dance (Mark Trendsetter Holiday remix)\n","torrent":{"xt":"urn:btih:eda04efae3dc97e5f688f7f650a38ea48e2aea5b","amp;dn":"MTV+TRENDSETTER+REMIXES+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eda04efae3dc97e5f688f7f650a38ea48e2aea5b","infoHashBuffer":{"type":"Buffer","data":[237,160,78,250,227,220,151,229,246,136,247,246,80,163,142,164,142,42,234,91]},"announce":[],"urlList":[]}}