{"title":"Oasis - Casting Shadows - A Collection 2010","uid":5349844,"size":352417422,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ef4adb0d7420b3a7e55e22e22533d6305324b465&amp;dn=Oasis+-+Casting+Shadows+-+A+Collection+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Bruki","files":-1,"time":1265750677,"description":"Now Oasis have called it a day, I decided to put together this collection to help introduce people to the band and their music.\n\nThis collection spans the bands whole history from some of their biggest hits to lesser known B-Sides.\n\nBIO:\n\nOasis were an English rock band that formed in Manchester in 1991. Originally known as The Rain, the group was formed by Liam Gallagher (vocals and tambourine, who is also referred to as &quot;Our Kid&quot;), Paul Arthurs (guitar), Paul McGuigan (bass guitar) and Tony McCarroll (drums, percussion), who were soon joined by Liam's older brother Noel Gallagher (lead guitar and vocals). As of June 2009, Oasis had sold over 70 million records worldwide.[1] They have had eight UK number-one singles, seven UK number-one albums, fifteen NME Awards, nine Q Awards, four MTV Europe Music Awards and five BRIT Awards, including one in 2007 for outstanding contribution to music, as well as being nominated for three Grammy awards.\n\nIts members were signed to independent record label Creation Records and afterwards released their record-setting debut album Definitely Maybe in 1994. The following year, the band recorded the critically acclaimed (What's the Story) Morning Glory? (1995) with their new drummer Alan White in the midst of rivalry with Britpop peers Blur in the charts. The Gallagher brothers featured regularly in tabloid newspapers for their sibling disputes and wild lifestyles. Oasis released their third album, Be Here Now, in 1997, which became the fastest-selling album in UK chart history. The band lost members Paul McGuigan and Paul Arthurs as they went on to record and release Standing on the Shoulder of Giants in 2000 and were replaced by Gem Archer and Andy Bell who joined the group for the recording of Heathen Chemistry in 2002. The band found renewed success and popularity with their albums Don't Believe the Truth and Dig Out Your Soul and their supporting tours.\n\nIn August 2009, Noel Gallagher announced his departure from the band. Liam Gallagher initially stated that Oasis were &quot;done&quot;, but later announced that the remaining members of the band would continue to record music, and did not rule out the possibility of retaining the Oasis name. In February 2010, Liam confirmed that his new band will not be called Oasis, thereby ending Oasis.\n\nCASTING SHADOWS - A COLLECTION.\n\n 1. The Hindu Times\n 2. The Importance of Being Idle\n 3. Songbird\n 4. It's Gettin' Better\n 5. Aquiesce\n 6. Rock'n'Roll Star\n 7. Listen Up\n 8. Live Forever\n 9. Little By Little\n10. The Shock of the Lightening\n11. Don't Go Away\n12. Talk Tonight\n13. Columbia\n14. Gas Panic\n15. Wonderwall\n16. Let there Be Love\n17. Sunday Morning Call\n18. Don't Look Back In Anger\n19. The Masterplan\n20. Rockin' Chair\n21. Falling Down\n22. Go Let It Out\n23. Fade In-Out\n24. Slide Away\n25. Stop Crying Your Heart Out\n26. Champagne Supernova\n27. Cast No Shadow.\n\nEnjoy.","torrent":{"xt":"urn:btih:ef4adb0d7420b3a7e55e22e22533d6305324b465","amp;dn":"Oasis+-+Casting+Shadows+-+A+Collection+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef4adb0d7420b3a7e55e22e22533d6305324b465","infoHashBuffer":{"type":"Buffer","data":[239,74,219,13,116,32,179,167,229,94,34,226,37,51,214,48,83,36,180,101]},"announce":[],"urlList":[]}}