{"title":"A-ha 1985 - Hunting High And Low [Japan] APE","uid":5331176,"size":323431144,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f0bac1b43a5ba26fee2a8b237244cbddcdd50077&amp;dn=A-ha+1985+-+Hunting+High+And+Low+%5BJapan%5D+APE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dima-fencing","files":15,"time":1265179599,"description":"Anyone who dismissed a-ha as a one-hit wonder must have missed out on the band's fine debut, Hunting High and Low. Though the band spawned many further hits across the rest of the world, &quot;Take on Me&quot; exploded in the States and the group never cracked the top of the charts again. It's a shame, because the album contains a handful of songs that nearly match the manic energy and emotional crack of its big hit. Further, it's a cohesive album with smart pace changeups, and it rarely fails to delight or satisfy a listener's need for a synth pop fix. The opening kick is a huge one: &quot;Take on Me&quot; is a new wave classic laced with rushing keyboards, made emotionally resonant thanks to Morten Harket's touching vocal delicacy. It didn't hurt in the era of MTV that the song's video was a hyperkinetic blend of mind-warping animation and filmed footage with a romantic thriller's heart. Harket's hunky physique and cheekbones also didn't hurt the video's chances at heavy rotation. Getting past that video, &quot;The Sun Always Shines on T.V.&quot; is just as thrilling. Starting as a sad ballad, it explodes into something much more, as chugging guitars and operatic synths keep pace with Harket's evocative vocal stylings. If ever a 1980s song qualified as Wall of Sound, &quot;The Sun Always Shines on T.V.&quot; would be it. The remainder of the album sees a-ha switching deftly back and forth between dramatic overtures and classic new wave keyboard motifs. &quot;Train of Thought&quot; and &quot;Love Is Reason&quot; are reminiscent of early Depeche Mode or Camouflage, but Harket's rich voice and flair make them purely a-ha. The band explores decidedly European terrain in the theatrical &quot;Hunting High and Low&quot; and dances a pop waltz with the sweet &quot;Living a Boy's Adventure Tale,&quot; coming across like a marriage between the Blue Nile and Alphaville. Delightful song snippets &quot;The Blue Sky&quot; and &quot;And You Tell Me&quot; act as frosting on the cake or as glue between the theater and the dancefloor. One can't escape the feeling that Hunting High and Low is a product of the 1980s, but with highs like &quot;Take on Me&quot; and &quot;The Sun Always Shines on T.V.,&quot; and no lows in sight, a-ha's debut is a treat worth relishing. ","torrent":{"xt":"urn:btih:f0bac1b43a5ba26fee2a8b237244cbddcdd50077","amp;dn":"A-ha+1985+-+Hunting+High+And+Low+%5BJapan%5D+APE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0bac1b43a5ba26fee2a8b237244cbddcdd50077","infoHashBuffer":{"type":"Buffer","data":[240,186,193,180,58,91,162,111,238,42,139,35,114,68,203,221,205,213,0,119]},"announce":[],"urlList":[]}}