{"title":"U2 - 3 MFSL CD's ALAC","uid":5251782,"size":879958071,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f18180adf738eced58a19eefe9828c91db43928b&amp;dn=U2+-+3+MFSL+CD%5C%27s+ALAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"WhoAreU2","files":40,"time":1262387046,"description":"U2  War, The Unforgettable Fire &amp; The Joshua Tree MFSL  Lossless ALAC\n\n\nFORMAT: ALAC\n \nCOUNTRY: U.S.A.\n \nLABEL: Mobile Fidelity Sound Lab under license from Island Records\n\nEach CD was pressed directly from the original studio master session tapes ; the purest source of musical information and engineered to produce the finest CD sound quality available.\n\nEvery compact disc delivers the music to you with all the depth, dynamics, and richness of the live recording session.  We invite you to hear the three-dimensional quality of the music just as the artist intended for it to sound.\n\nThe proprietary mastering technology extracts and transparently stores more musical information from the original master tapes than any other method in existence.\n\nFor the discriminating listener, the results include: a wider range of frequencies, increased depth and room dimension cues, clarity, and separation of instruments.\n\nThe technology substantially decreases characteristics such as hardness and glare bringing the sound of CD even closer to the warmth and openess of analog.\n\nWhy Buy 24K Gold CDs? Aluminum particles are rough, resulting in pits and irregularities on the playing surface. Gold particles are uniform and have a constant rate of reflection giving an even, reproductive sound quality. Also, 24K Gold CDs will not oxidize or tarnish and will last for years longer than traditional aluminum CDs","torrent":{"xt":"urn:btih:f18180adf738eced58a19eefe9828c91db43928b","amp;dn":"U2+-+3+MFSL+CD%5C%27s+ALAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f18180adf738eced58a19eefe9828c91db43928b","infoHashBuffer":{"type":"Buffer","data":[241,129,128,173,247,56,236,237,88,161,158,239,233,130,140,145,219,67,146,139]},"announce":[],"urlList":[]}}