{"title":"The-Invention-Of-Lying.2009.BDrip[vice]","uid":5241550,"size":482084962,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f213d81d2e1676b2ea8d4db24972e27550859065&amp;dn=The-Invention-Of-Lying.2009.BDrip%5Bvice%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"vicerock","files":-1,"time":1261782051,"description":"THE INVENTION OF LYING 2009 BDrip\n\nVIDEO CODEC Xvid\nformat Avi\nsize/res 480x272[wide screen]\nrun-time 01:39:42\nvideo bitrate 512\nvideo framerate 25\nXvid profile asp5\n\nAUDIO CODEC mp3\naudio bitrate 128\nsample rate 44100\na/v sync basic\n\nCast\n\n* Ricky Gervais as Mark Bellison\n* Jennifer Garner as Anna McDoogles\n* Rob Lowe as Brad Kessler\n* Louis C.K. as Greg\n* Jonah Hill as Frank\n* Christopher Guest as Nathan Goldfrappe\n* Tina Fey as Shelley\n* Roz Ryan as Nurse Barbara\n* Jeffrey Tambor as Anthony James\n* John Hodgman as Priest\n* Jimmi Simpson as Bob\n* Fionnula Flanagan as Martha Bellison\n* Stephanie March as Woman on the Street\n* Jason Bateman as Doctor (cameo)\n* Stephen Merchant as Home Owner (cameo)\n* Philip Seymour Hoffman as Bartender (cameo)\n* Edward Norton as Traffic Cop (cameo)\n* Martin Starr as Waiter\n* Shaun Williamson as Richard Bellison\n* Donald Foley as Yelling Man\nPlot\n\nThe film is set in an alternate reality in which no one has ever lied. Not only does no one tell a lie, but people often tell the entire truth, or blurt out very blunt remarks and opinions that people in the real world would normally keep to themselves. Organized religion does not exist, nor are there any forms of fiction, in both film and literature and advertisements are not very flattering of their products.\n\nMark Bellison (Ricky Gervais) is an unsuccessful lecture-film writer (non-fiction films that are nothing more than an on-screen narrator lecturing about history), who is told by everyone that he is a fat loser. He goes out on a date with Anna McDoogles (Jennifer Garner), who bluntly states to Mark that she is not attracted to him due to his looks and his unsuccessful financial situation, but is going out on a date with him to satisfy her mother and that she doesn't want to be alone for the rest of her life. After the date, she admits that she had a better time than she thought she would.\n\nThe next day, Mark is fired from his job due to a lack of viewership interest in his films about the Black Plague. He is also $500 short of his rent which is $800. Depressed, he goes to the bank in order to close his account and use the money to have his stuff moved out of his house. The computer records system is not working, so Mark is required to specify how much money he has. Suddenly, without knowing why, he tells a bank teller that he has $800. The teller gives him the money, assuming that the computer made a mistake. Mark is now able to pay his landlord. Excited by what has occurred he believes his ability will astound people. He demonstrates lying to his friends but without any comprehension of the concept they believe everything he says such as &quot;I'm a pirate&quot; Mark realises they are unable to comprehend lying so he thinks of ways to use it to his advantage. He decides to give his lies a big test, first by telling a random woman on the street that the world will end unless she had sex with him that very moment. Before he has sex with her, Mark, feeling what he did was wrong, pretends to receive information that the world won't actually end and that they didn't have to have sex. He also saves his friend, who was driving quite drunk, from being arrested, by simply telling the officer that he wasn't drunk. He begins lying to others and helping people feel better about themselves and help others with their relationships, and even helps a homeless man get money. He goes out on another date with Anna, who appears to show a little more respect for Mark but still bluntly states that she is not attracted to him.\n\nThat night however, his mother is dying of a heart attack. His mother is upset because she believes that when she dies, she will go into a state of nothingness. In the final moments before her death, Mark makes up a comforting story about &quot;a kind of place you go to after you die&quot;, where she will be young and happy and be with the people she loves, and this makes her happy, right before she dies. With other people in the room, word of what he told his mother spreads, and millions around the world believe he is a kind of Messiah, or Prophet. In order to satisfy their curiosity, he tells them there is a man in the sky, who controls everything, and that they are allowed to do 3 bad things in life, or they won't be allowed into the eternal afterlife, where everyone will have a mansion, be young, be with the people they love, and have whatever they want.\n\nMark uses his ability to lie to make up interesting stories for his lecture film company, resulting in fame and fortune. He also wins Time Magazine's &quot;Man of the Year Award&quot;. He buys a mansion, and he lets his friends, including Anna, live with him. Mark and Anna also become much closer. She appears to love him, telling him that he is very smart, and that he is the sweetest guy she has ever met, but she bluntly states that she is afraid to be with him because she does not want her kids to have his genetic make up of being &quot;chubby and snub-nosed&quot;. Mark teaches her to look beyond people's appearances and try to see deeper. Anna asks him if being rich and successful can change people's genetic make-up. Mark tells her the truth and says &quot;No&quot;. One day, on Mark's birthday, Anna gives him a birthday coupon for sex. Before he opens his present, she also reveals that she is going on a date with Brad Kessler (Rob Lowe), Mark's enemy and rival in Lecture Films. Mark tries to persuade her not have sex with him unless she is married to him because &quot;that's the rule&quot;, but this is before he opens Anna's present, making her present useless. &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1058017/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1058017/&lt;/a&gt;\n\nPLEASE SEED AND ENJOY THANKS\n\nSCREEN SHOTS &lt;a href=&quot;\nhttp://img96.imageshack.us/img96/1973/theinventionoflying2009.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img96.imageshack.us/img96/1973/theinventionoflying2009.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:f213d81d2e1676b2ea8d4db24972e27550859065","amp;dn":"The-Invention-Of-Lying.2009.BDrip%5Bvice%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f213d81d2e1676b2ea8d4db24972e27550859065","infoHashBuffer":{"type":"Buffer","data":[242,19,216,29,46,22,118,178,234,141,77,178,73,114,226,117,80,133,144,101]},"announce":[],"urlList":[]}}