{"title":"50 Cent - Do You Think About Me  (2nafish)","uid":5322787,"size":147363844,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f4aff598430f76083c23f7e1cec252b5baff7b21&amp;dn=50+Cent+-+Do+You+Think+About+Me++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1264919255,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nBefore I Self Destruct is the fourth studio album by American rapper 50 Cent, released November 9, 2009 on Interscope Records in the United States and achieved certified gold status on January 21, 2010 by the RIAA. It is his final solo release for his current contract with Interscope Records, excluding a &quot;greatest hits&quot; album. A feature film, also titled Before I Self Destruct was also made, and is available within the album packaging.\n\nInitially, Before I Self Destruct was planned to be 50 Cent's 2007 album, for which he confirmed he had already completed twelve songs. However, he decided to release Curtis instead, and thus Before I Self Destruct's release date was originally pushed back to 2008.\n\nIn a red carpet interview 50 Cent stated that while he was working on the album, he wrote, produced, and directed his first film saying that the release of the film would coincide with the release of the album.\n\nIn early October 2008, the first promo single titled &quot;Get Up&quot;, (which peaked at number 44 on the billboard hot 100), with production credited to Scott Storch, was released via 50 Cent's official Internet community ThisIs50.com, then hisaccount, though it was later removed fromThe second promo single, &quot;I Get It In&quot;, (which peaked at number 53 on the billboard hot 100), was released in early January 2009, with production credited to Dr. Dre. It was confirmed that both tracks didn't make the album, due to album delays. The first album promo single has been confirmed and released titled &quot;Ok, You're Right&quot; with production again coming from Dr. Dre. The official first single, featuring Ne-Yo, was released in early September 2009, titled &quot;Baby by Me&quot;, which features a sample from an earlier 50 Cent song, &quot;I Get Money&quot;. Another track stated to be on the album, though not officially confirmed as a single, entitled &quot;Crime Wave&quot;, was released in late October 2009. The official second single, &quot;Do You Think About Me&quot; and the third single, &quot;So Disrespectful&quot; were confirmed by 50 Cent and are going to be released together sometime in 2010. Psycho and Could've Been You were to be released together on April 20, 2010 as the 4th and 5th official singles but both were shelved in favor of the then 3rd single, Get It Hot. However, &quot;So Disrespectful&quot; got selected instead with a video coming out soon.\n\nThough a tracklist appeared in early January 2009, 50 Cent later stated he reworked much of the album.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:f4aff598430f76083c23f7e1cec252b5baff7b21","amp;dn":"50+Cent+-+Do+You+Think+About+Me++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4aff598430f76083c23f7e1cec252b5baff7b21","infoHashBuffer":{"type":"Buffer","data":[244,175,245,152,67,15,118,8,60,35,247,225,206,194,82,181,186,255,123,33]},"announce":[],"urlList":[]}}