{"title":"Eckhart Tolle - Even The Sun Will Die","uid":5333436,"size":87901775,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:f4da540fffd522abcdd2475f62204522c85c99ef&amp;dn=Eckhart+Tolle+-+Even+The+Sun+Will+Die&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"thrice23","files":2,"time":1265242481,"description":"An interview with Eckhart Tolle,  a so-called spiritual teacher (in the eyes of the world).\n\n\nTitle: Even the Sun Will Die\nRunning time : 2 hours, 26 minutes, 29 seconds\n\n\nWhen Eckhart Tolle agreed to be interviewed on September 11, 2001, he could not foresee the historic nature of this date or the suffering that would follow. As the day's events unfolded, in real time, he responded with a calm and clear voice, helping to make sense out of the fear and chaos that will forever define this date.\n\nEven the Sun Will Die documents this historic meeting with Eckhart Tolle and the comforting wisdom he revealed that day.\n\nWe live in a time, he says, when we define ourselves through our enemies; and science and technology are in the service of human madness. Yet even in the face of disaster, a miracle happens when we say &quot;yes&quot; to living in this moment and no other. This &quot;great opening,&quot; he teaches, can serve as nothing less than the beginning of a revolution in human consciousness with the potential to transform our world and everyone in it. Also for the first time on audio, Eckhart Tolle comments on his own awakening, and what he sees as the next step in human evolution. From insights into the way out of suffering, to evidence that a new consciousness is already rising, Even the Sun Will Die confirms Eckhart Tolle's place among the most important and accessible spiritual teachers of our time.","torrent":{"xt":"urn:btih:f4da540fffd522abcdd2475f62204522c85c99ef","amp;dn":"Eckhart+Tolle+-+Even+The+Sun+Will+Die","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4da540fffd522abcdd2475f62204522c85c99ef","infoHashBuffer":{"type":"Buffer","data":[244,218,84,15,255,213,34,171,205,210,71,95,98,32,69,34,200,92,153,239]},"announce":[],"urlList":[]}}