{"title":"How_Weed_Won_The_West [DVDrip NTSB VOB complete w/extras]","uid":5405000,"size":4561702779,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f4e963603eabaa2db936b4114164245696c5252e&amp;dn=How_Weed_Won_The_West+%5BDVDrip+NTSB+VOB+complete+w%2Fextras%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"gipons","files":33,"time":1267560380,"description":"The Creators of AMERICAN DRUG WAR - are prepared to take you HIGHER...\n\nSACRED COW PRODUCTIONS presents a film by Kevin Booth\n\nFrom the creators of American Drug War the long awaited sequel:\n\n-How Weed Won the West-\n\nHow Weed Won The West delves deeply into the culture and commerce of cannabis featuring California's ganja growers,medicinal marijuana patients and law reform advocates. Kevin Booth's vivid document from behind the front lines of the &quot;war on pot&quot; blows the lid off a multi-billion dollar industry on the verge. - Danny Danko HIGH TIMES Magazine\n\nWith California and the rest of the country going bankrupt, one business is booming. How Weed Won the West is the story of the growing Medical Marijuana industry, focusing on Los Angeles with over 700 legal dispensaries doling out the buds. Following the story of Organica, a southland dispensary which was raided by state and federal agencies in August of 2009, the film shows that although much has changed with Obama in office, the drug war is nowhere near over. Kevin Booth, producer/director of American Drug War, picks up where the last film left off and continues his fight against the hypocrisy of the War on Drugs. Intended to inform and entertain, this fast paced and even sometimes funny film features Texas conspiracy guru Alex Jones, Ethan Nadelmann head of Drug Policy Alliance, and a host of amazing characters including a former LAPD narcotics officer who now thinks all drugs should be legal.\n\nWhile the U.S. Economy goes up in Smoke...\nOne Fledling industry is booming\n\nTake a rare journey through the world of the California Marijuana industry as the rest of the country watches the inevitable end of the Marijuana prohibition.\n\nCover Art: http://bayimg.com/PakCNaaCp\nDisc Art: http://bayimg.com/aaKDEaaCp\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1498784/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1498784/&lt;/a&gt;\n\nwww.howweedwonthewest.com\n\nwww.sacredcow.com\n\nwww.americandrugwar.com\n","torrent":{"xt":"urn:btih:f4e963603eabaa2db936b4114164245696c5252e","amp;dn":"How_Weed_Won_The_West+%5BDVDrip+NTSB+VOB+complete+w%2Fextras%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4e963603eabaa2db936b4114164245696c5252e","infoHashBuffer":{"type":"Buffer","data":[244,233,99,96,62,171,170,45,185,54,180,17,65,100,36,86,150,197,37,46]},"announce":[],"urlList":[]}}