{"title":"A1 Website Download v2.0.4 Multilingual","uid":5222187,"size":6026772,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:f5013b3fa2377256b75d37a6aa4d4ee25e602976&amp;dn=A1+Website+Download+v2.0.4+Multilingual&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"halo2suger","files":5,"time":1260977219,"description":"Unlike most website download tools, our website downloader program will copy websites to your disk, and not store websites using a proprietary database format. As all links get corrected to relative file paths, you can copy and take the downloaded websites with you anywhere, and later view them offline in any browser. Our website copier software can download large websites with many thousands of pages, and includes options for configuring download speed, e.g. through usage of simultaneous connections. Control which files to crawl and which to download using include and exclude filters. Website download and login through most post form user/password systems is also supported. The website downloader understands all kinds of references including redirects, frames, javascripts and images. It is also able to correctly convert links in CSS and most javascript files. You can even scan and download websites from multiple start paths, useful if content in a website is not crosslinked.\n\nFeatures:\n Archive websites with forums, image galleries, online books and articles\n Download your favourite websites and read them later while on the move\n Automate download of websites at times convenient to you, e.g. at night\n Show websites to clients in offices with no internet access\n Copy websites to portable media such as CD/DVD and USB sticks\n Have database driven websites downloaded and converted into static\n You can develop your website using PHP, ASP etc\n The downloaded website contains the output HTML\n All links in the website can be converted to relative\n Upload the downloaded website to mirrors and servers\n Save webserver resources by not using server side code\n Get started downloading websites in just a few minutes\n View downloaded websites offline in any internet browser","torrent":{"xt":"urn:btih:f5013b3fa2377256b75d37a6aa4d4ee25e602976","amp;dn":"A1+Website+Download+v2.0.4+Multilingual","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5013b3fa2377256b75d37a6aa4d4ee25e602976","infoHashBuffer":{"type":"Buffer","data":[245,1,59,63,162,55,114,86,183,93,55,166,170,77,78,226,94,96,41,118]},"announce":[],"urlList":[]}}