{"title":"(2005) Land of the Dead - Road to Fiddler's Green","uid":6309514,"size":1070051398,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f5ef6c20cc04a04b60f8738258cd6342e8043f24&amp;dn=%282005%29+Land+of+the+Dead+-+Road+to+Fiddler%5C%27s+Green+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"VampireCss","files":266,"time":1302483131,"description":"Land of the Dead: Road to Fiddler's Green is a first-person shooter licensed video game based on the George A. Romero zombie horror movie Land of the Dead. Like many licensed games, Land of the Dead: Road to Fiddler's Green was made with budget-game production values. \n\nLand of the Dead: Road to Fiddler's Green utilizes traditional first-person shooter gameplay. Players can use a variety of either melee weapons or firearms to fight through the zombie hordes. Some weapons are capable of dismembering the zombies, while other weapons are not. The zombies' jaws, heads, arms, forearms, and legs can be shot or chopped off by the player. This can very effectively save the player so as to make an escape. The zombies themselves appear in many varieties (regular, ones armed with a melee weapon, crawlers, puking ones, screamers that summon other zombies, and poisonous, exploding ones) and each takes a different amount of hits to kill, which varies upon the difficulty setting of the game. The player cannot become a zombie, but it is stated that people who die for any reason become zombies, like in the movie.\n\nThe multiplayer component of the game consists of many online game types. These consist of deathmatch, team deathmatch, and &quot;Capture the Flag&quot; modes. There is also an &quot;Invasion&quot; (co-op survival) mode, in which players are trapped in a small map where they must survive for a chosen amount of time. In this mode, the weapons and ammunition regenerate in the same spots each time, allowing the players to dodge the burden of ammunition shortages. Players can pick up melee weapons from recently killed melee weapon wielding zombies as well. In some variants of Invasion maps, players who die or are bitten by zombies become zombies themselves, and try to kill their former teammates.\n\n\n*Note this is my first torrent upload*\n\nReMeMbEr To SeEd!","torrent":{"xt":"urn:btih:f5ef6c20cc04a04b60f8738258cd6342e8043f24","amp;dn":"%282005%29+Land+of+the+Dead+-+Road+to+Fiddler%5C%27s+Green+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5ef6c20cc04a04b60f8738258cd6342e8043f24","infoHashBuffer":{"type":"Buffer","data":[245,239,108,32,204,4,160,75,96,248,115,130,88,205,99,66,232,4,63,36]},"announce":[],"urlList":[]}}