{"title":"Mahakaal: The monster (RUS)","uid":5444972,"size":1115203584,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f65b14b6bdf74d3a7f522ec6f507c58f3b993306&amp;dn=Mahakaal%3A+The+monster+%28RUS%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Gross_P","files":1,"time":1268992614,"description":"Mondo Macabro has returned with another installment in their Bollywood Horror Collection. Like the previous DVD collections, volume three maintains a focus on Tulsi and Shyam Ramsay, who are sibling purveyors of horror films that merge Western genre tropes with Indian sensibilities. Mahakaal (The Monster) and Tahkhana (The Dungeon)  display the elements that made the Ramsay brothers innovators in Indian cinema.\n\nMahakaal (The Monster) is a thorough Nightmare on Elm Street knock-off from 1993. It isn't necessary to recount the story as it will be familiar to many viewers: a putty-faced, blade-wearing child killer invades the dreams of young college students. There is little attempt to disguise the origins of the material as whole scenes and musical cues are directly lifted from the original movie. Mahakaal places more emphasis on atmosphere, which is created through heavy use of Argento-style gel lighting and smoke effects, than coherence. Multiple shaggy musical numbers, innocuous sexual content, the broad comedy of Johnny Lever, pervasive jump cuts, and visual non-sequiturs keep the energy level high but at 145 minutes, this loosely structured movie heavily lags in spots.\n\nLanguage: russian","torrent":{"xt":"urn:btih:f65b14b6bdf74d3a7f522ec6f507c58f3b993306","amp;dn":"Mahakaal%3A+The+monster+%28RUS%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f65b14b6bdf74d3a7f522ec6f507c58f3b993306","infoHashBuffer":{"type":"Buffer","data":[246,91,20,182,189,247,77,58,127,82,46,198,245,7,197,143,59,153,51,6]},"announce":[],"urlList":[]}}