{"title":"Alice Cooper - Lost In America  (2nafish)","uid":5397024,"size":164995076,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f6a0fec9fbeeb3af6fecb23a004e6bcfb0f1a375&amp;dn=Alice+Cooper+-+Lost+In+America++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1267271230,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Lost in America&quot; is a single by musician Alice Cooper taken from his 1994 album The Last Temptation. It was the most popular single off the album.\n\nA music video was made for the song, but it received almost no airplay at all. The music video features a young boy (supposedly Steven) reading the Marvel comics adaptation of the album, written by Neil Gaiman. The comic book comes to life as Alice Cooper and his band playing the song with several video clips referencing the song's lyrics.\n\nThe single featured a B-Side, a live version of &quot;Hey Stoopid&quot;.\n\nThe Last Temptation is a concept album by rock singer, Alice Cooper, released in July 1994 via Epic Records. It centres around a boy named Steven (also the name of the protagonist in Cooper's earlier work, Welcome to My Nightmare), and a mysterious showman. The showman, with apparent supernatural abilities, attempted with the use of twisted versions of morality plays to persuade Steven to join his travelling show, &quot;The Theatre Of The Real - The Grand-est Guignol!&quot;, where he would &quot;never grow up&quot;.\n\nThe full story was given in a 3-part comic book written by Neil Gaiman, the first part of which accompanied the recording. In the comic, the showman (referred to only ever as such) was depicted as Cooper himself. Pages from the comic are seen in the Lost in America music video, while it is being read by Steven.\n\nIt was originally published by Marvel Comics and later reprinted by Dark Horse Comics, collected as trade paperback.\n\nAlice Cooper (born Vincent Damon Furnier; February 4, 1948) is an American rock singer, songwriter and broadcaster whose career spans more than four decades. With a stage show that features guillotines, electric chairs, fake blood, boa constrictors and baby dolls, Cooper has drawn equally from horror movies, vaudeville, and garage rock to pioneer a grandly theatrical and violent brand of heavy metal that was designed to shock.\n\nAlice Cooper was originally a band consisting of Furnier on vocals and harmonica, lead guitarist Glen Buxton, Michael Bruce on rhythm guitar, Dennis Dunaway on bass guitar, and drummer Neal Smith. The original Alice Cooper band broke into the international music mainstream with the 1971 hit &quot;I'm Eighteen&quot; from the album Love it to Death, which was followed by the even bigger single &quot;School's Out&quot; in 1972. The band reached their commercial peak with the 1973 album Billion Dollar Babies.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:f6a0fec9fbeeb3af6fecb23a004e6bcfb0f1a375","amp;dn":"Alice+Cooper+-+Lost+In+America++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6a0fec9fbeeb3af6fecb23a004e6bcfb0f1a375","infoHashBuffer":{"type":"Buffer","data":[246,160,254,201,251,238,179,175,111,236,178,58,0,78,107,207,176,241,163,117]},"announce":[],"urlList":[]}}