{"title":"Shirley Bassey - Goldfinger  (Soundtrack: Goldfinger) (2nafish)","uid":5378350,"size":120647684,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f78f4fd398297f4701bb74ca186cd713999c04c7&amp;dn=Shirley+Bassey+-+Goldfinger++%28Soundtrack%3A+Goldfinger%29+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1266652825,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nNote: This video is a &quot;Movies &amp; Music&quot; video so it has 2 logos.\n\n\n&quot;Goldfinger&quot; was the title song from the 1964 James Bond film Goldfinger. Composed by John Barry and with lyrics by Leslie Bricusse and Anthony Newley, the song was performed by Shirley Bassey for the film's opening and closing title sequences, as well as the soundtrack album release. The single release of the song gave Bassey her only Billboard Hot 100 top ten hit, peaking at number eight; in the United Kingdom, the single reached #21. In 2008, the single was inducted into the Grammy Hall of Fame.\n\nThe release on vinyl of Bassey's version sold more than a million copies in the United States (Guinness Book of Records), and it also reached number one on the Japanese charts and the top ten of many european countries. The song has become Bassey's theme song and she has performed it in most of her concerts since the 1960's, often as an opening number.\n\nGoldfinger (1964) is the third spy film in the James Bond series, and the third to star Sean Connery as the fictional MI6 agent James Bond. It is based on the novel of the same name by Ian Fleming. The film stars Honor Blackman as Bond girl Pussy Galore and Gert FrÃƒÂ¶be as the title character along with Shirley Eaton as Jill Masterson. The film was produced by Albert R. Broccoli and Harry Saltzman, and was the first of four Bond films directed by Guy Hamilton. The story has Bond following gold smuggler Auric Goldfinger, who plans a nuclear detonation inside the Fort Knox gold depository.\n\nThe film was the first official Bond blockbuster and made cinematic history by recouping its production costs in record-setting time, despite a budget equal to that of the two preceding films combined. Goldfinger was also the first Bond film to use a pop star to sing the theme song during the titles, a hallmark that would follow for every Bond film since except On Her Majesty's Secret Service.\n\nShirley Bassey sang the theme song Goldfinger, and she would go on to sing the theme songs for two other Bond films, Diamonds are Forever and Moonraker. The song was composed by John Barry, with lyrics by Anthony Newley and Leslie Bricusse. Newley originally sang the song, but Bassey's recording was used in the film and was featured on the soundtrack. Newley's version was released in the 30th anniversary compilation album The Best of Bond...James Bond. The theme was an international hit single, achieving a spot in the Billboard Hot 100 Top Ten. The musical tracks, in keeping with the film's theme of gold and metal, make heavy use of brass, and also metallic chimes. The album went to No. 1 in the U.S., spending 70 weeks on the Billboard 200, and reached #14 in the U.K. The film score was composed by John Barry with the U.K. soundtrack featuring 4 tracks that didn't appear on the US soundtrack.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:f78f4fd398297f4701bb74ca186cd713999c04c7","amp;dn":"Shirley+Bassey+-+Goldfinger++%28Soundtrack%3A+Goldfinger%29+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f78f4fd398297f4701bb74ca186cd713999c04c7","infoHashBuffer":{"type":"Buffer","data":[247,143,79,211,152,41,127,71,1,187,116,202,24,108,215,19,153,156,4,199]},"announce":[],"urlList":[]}}