{"title":"Windows 7 Ultimate x86/x64  Full Activated Final 7600","uid":5243698,"size":3735056384,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f818f23f0be6a179f50d480777e592e6c30aae64&amp;dn=Windows+7+Ultimate+x86%2Fx64++Full+Activated+Final+7600&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"shigueo","files":1,"time":1261901786,"description":"Windows 7 is the latest public release version of Microsoft Windows, a series of operating systems produced by Microsoft for use on personal computers, including home and business desktops, laptops, netbooks, tablet PCs, and media center PCs.[3] Windows 7 was released to manufacturing on July 22, 2009,[4] and reached general retail availability on October 22, 2009,[5] less than three years after the release of its predecessor, Windows Vista. Windows 7's server counterpart, Windows Server 2008 R2, was released at the same time.\n\nUnlike its predecessor, which introduced a large number of new features, Windows 7 was intended to be a more focused, incremental upgrade to the Windows line, with the goal of being fully compatible with applications and hardware with which Windows Vista is already compatible.[6] Presentations given by Microsoft in 2008 focused on multi-touch support, a redesigned Windows Shell with a new taskbar, referred to as the Superbar, a home networking system called HomeGroup,[7] and performance improvements. Some applications that have been included with prior releases of Microsoft Windows, including Windows Calendar, Windows Mail, Windows Movie Maker, and Windows Photo Gallery, are not included in Windows 7;[8][9] most are instead offered separately as part of the free Windows Live Essentials suite.[10]\n","torrent":{"xt":"urn:btih:f818f23f0be6a179f50d480777e592e6c30aae64","amp;dn":"Windows+7+Ultimate+x86%2Fx64++Full+Activated+Final+7600","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f818f23f0be6a179f50d480777e592e6c30aae64","infoHashBuffer":{"type":"Buffer","data":[248,24,242,63,11,230,161,121,245,13,72,7,119,229,146,230,195,10,174,100]},"announce":[],"urlList":[]}}