{"title":"StarCraft II Beta enGB 13891 Installer","uid":5374453,"size":1759538337,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f8918db4581b16422cd48a9a02f7b171556a6675&amp;dn=StarCraft+II+Beta+enGB+13891+Installer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"KeiKun83","files":-1,"time":1266527427,"description":"The Koprulu sector rings once more with the sounds of battle, for the public beta test of StarCraft II: Wings of Liberty has officially begun! Invitations to participate in the beta test are now being delivered. As with previous Blizzard Entertainment titles, the beta-test process for StarCraft II will occur in phases. In each phase, we will be selecting players who meet specific criteria and who have opted in via their Battle.net accounts.\n\nPlayers who have been invited to participate in the beta test will need to have a Battle.net account. For more information on the StarCraft II: Wings of Liberty beta test, please read the FAQ and our recent media alert.\n\nIf you didn't receive a beta test invite, don't worry -- it's possible that you'll be added in a later phase. Keep an eye on the email address associated with your Battle.net account, and stay tuned to www.StarCraft2.com for further updates.\n\n\n\nSet in the 26th century in a distant part of the Milky Way galaxy, the game is built around three species: the Terrans, human exiles from Earth; the Zerg, a race of insectoids; and the Protoss, a species with vast psionic power. Wings of Liberty specifically focuses on the Terrans, while the expansions Heart of the Swarm and Legacy of the Void focus on the Zerg and Protoss, respectively. The game is set four years after the events of StarCraft: Brood War, and follows the exploits of Jim Raynor as he leads an insurgent group against the autocratic Terran Dominion. However, unable to inflict major damage against the Dominion, Raynor's forces are relegated to the roles of mercenaries, recovering artifacts of an ancient species thought extinct, the Xel'Naga, for their enigmatic employers. The game reunites old characters from the original game, as well as introducing new characters and locations to the franchise.","torrent":{"xt":"urn:btih:f8918db4581b16422cd48a9a02f7b171556a6675","amp;dn":"StarCraft+II+Beta+enGB+13891+Installer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8918db4581b16422cd48a9a02f7b171556a6675","infoHashBuffer":{"type":"Buffer","data":[248,145,141,180,88,27,22,66,44,212,138,154,2,247,177,113,85,106,102,117]},"announce":[],"urlList":[]}}