{"title":"Davilex Webbouwer","uid":5330510,"size":19150848,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f925c4a466b966831542e2e2584f72bfdb07b9e7&amp;dn=Davilex+Webbouwer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Refinha","files":-1,"time":1265154664,"description":"Davilex Webbouwer\n\nDavilex Webbouwer stelt de gebruiker in staat om op eenvoudige wijze een zakelijke internetsite te ontwerpen,op te maken en te publiceren. Binnen enkele minuten kan uw eigen bedrijfsinternetsite al op het World Wide Web staan.\nOok Davilex Webbouwer van Davilex Business blinkt uit in eenvoud en overzichtelijkheid en bevat geen onnodige functionaliteit. U kunt direct aan de slag.\n\nOntwerp:\nDankzij de vele meegeleverde zakelijke sjablonen heeft u binnen enkele minuten een complete website opgezet. Vormen, knoppen, titels en tekstlogo's kunt u direct in Davilex Webbouwer maken. Professionele effecten zoals schaduw, vuleffecten, gloed en 3D-effecten maken het mogelijk om op een zeer simpele manier een professionele uitstraling te creÃƒÂ«ren.\n* Onbeperkt aantal pagina's toevoegen aan uw internetsite\n* Teksten, vormen en afbeeldingen invoegen en bewerken.\n* Krachtige vulpatronen zoals vaste kleur, vulpatronen en gegradueerd.\n* Speciale effecten zoals schaduw, 3D en gloed.\n* Vormen zoals cirkels, vierkanten etc.\n* Knoppen mat knopteksten.\n* Links toevoegen naar andere pagina's, e0mail, andere internetsites of documenten.\n\nLay-out:\nAlle elementen in Davilex Webbouwer zijn makkelijk te plaatsen en kunnen met de muis snel worden gewijzigd: draaien, rondslepen, vergroten en verkleinen is allemaal mogelijk. Dankzij de grote precisie en de intuÃƒÂ¯tieve gereedschappen die ter beschikking staan, wordt het maken van een internetsite simpel. Met behulp van hulplijnen en de vele mogelijkheden voor het uitlijnen en groeperen van elementen worden geavanceerde ontwerpen en lay-outs in een handomdraai gemaakt.\n* Uitgebreide stijl- en opmaakmogelijkheden.\n* Verplaatsen, roteren en vergroten en verkleinen van elementen.\n* Toevoegen van hulplijnen voor opmaak (horizontaal en vertikaal).\n* Maken van roll-over effecten.\n* Uitlijnen van elementen met uitlijngereedschappen.\n* Ordenen van elementen in niveau.\n* Groeperen van elementen.\n* Kleur bepalen met behulp van pipetgereedschap.\n* HTML-gereedschap voor het eenvoudig toevoegen van o.a. tellers.\n* Toevoegen van tool-tip teksten bij elementen.\n\nPubliceren:\nMet een enkele klik op de Verzenden-knop wordt de internetsite gepubliceerd op het Wereld Wijde Web. Er hoeft geen rekening gehouden te worden met HTML-bestanden, CGI, mappenstructuren etc. Davilex Webbouwer bouwt geheel automatisch de totale internetsite en publiceert deze voor u. Het instellingenvenster laat direct zien wat de mogelijkheden bij het desbetreffende element zijn. De eigenschappen zijn ter plekke aan te passen en het resultaat is direct zichtbaar.\n* Makkleijk publiceren door middel van ÃƒÂ©ÃƒÂ©n druk op de knop.\n* Geen zorgen over HTML-bestanden, CGI, mappenstructuren etc.\n* Gehele internetsite of alleen wijzigingen publiceren.\n\nOndersteuning:\n* Stap voor stap begeleidign bij maken internetsite.\n* Duidelijke helpbestanden\n* Tips &amp; trucs\n\nSysteemeisen:\nWindows 98/2000/NT4/ME/XP \nPc met Pentium processor 166 \n32 Mb intern geheugen \nHarde schijf met 16 Mb vrije ruimte \nCd-romspeler (double-speed) \n16-bits SVGA (800 x 600) \nInternet Explorer 4.01 of hoger\n\nUpload By: Refinha\n \n","torrent":{"xt":"urn:btih:f925c4a466b966831542e2e2584f72bfdb07b9e7","amp;dn":"Davilex+Webbouwer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f925c4a466b966831542e2e2584f72bfdb07b9e7","infoHashBuffer":{"type":"Buffer","data":[249,37,196,164,102,185,102,131,21,66,226,226,88,79,114,191,219,7,185,231]},"announce":[],"urlList":[]}}