{"title":"Neverwinter Nights (NWN) Mac Tech Demo","uid":5410492,"size":251655580,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:f95766eadb863384b8f6a174cce31efa664926c2&amp;dn=Neverwinter+Nights+%28NWN%29+Mac+Tech+Demo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":2,"time":1267738880,"description":"This is the hard-to-find Neverwinter Nights Mac Tech Demo. It is no longer available on the original site, and the current host makes you jump through hoops to download it (read: heavy javascript).\n\nAlso included are the _instructions_ for installing a full version and expansion packs. This will require having the files from the original PC version and expansion packs (either individually or combined in the gold/platinum/diamond versions).\n\nElsewhere on TPB you can download the full mac osx client disks, however this is not necessary if you have valid CD-keys and the PC version.\n\n===== Overview =====\nA mac compatible version of NWN can be installed from the PC disks + expansion packs of the game. The basic idea was laid out by jamincollins on the nun.bioware.com forums:\nhttp://nwn.bioware.com/forums/viewtopic.html?topic=406447&amp;forum=71&amp;sp=0\n\nThe premise is that between either the MacTech Demo or the original Mac Client disks a full working install can be achieved. \n\n===== High Level Instructions =====\nTo build a working install, the idea is that you either install or extract the MacTechDemo or Mac Client Disks. Then you (optionally) extract the content from the NWN Expansion CD/DVDs. Next you expand the most recent patch for your combination of expansion packs (NWN, SoU and/or HotU).\nhttp://nwn.bioware.com/support/patch.html\n\nCopy the files from the expansion DVD over the Mac install folder. Don't use the mac drag &amp; drop as that will replace folder contents. You'll have to drop to the console to copy the files.\n\nFollow the expansion pack instructions for deleting the overrides folder and the other bits.\n\nCopy the files from the expansion pack over the Mac install folder. Again you can't drag and drop, do it from the command line.\n\nThat's it, you're done. You should now be able to run NWN on your mac. \n\nClean up: You can remove a lot of the PC specific files from the folder (.exe, .dll and such) but it isn't necessary.\n\n\n==== Questions? ====\nI will continue to monitor and seed this torrent as long as it has value to people. There is also a fully installed Mac NWN install elsewhere on TPB. Once I found that I wasn't expecting to see any downloaders. If anyone has any questions feel free to ask in the comments area (english and un petit peu de francais only).","torrent":{"xt":"urn:btih:f95766eadb863384b8f6a174cce31efa664926c2","amp;dn":"Neverwinter+Nights+%28NWN%29+Mac+Tech+Demo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f95766eadb863384b8f6a174cce31efa664926c2","infoHashBuffer":{"type":"Buffer","data":[249,87,102,234,219,134,51,132,184,246,161,116,204,227,30,250,102,73,38,194]},"announce":[],"urlList":[]}}