{"title":"The Sims 3 - 1.8.25 noDVD CRACK - by wvss","uid":5253837,"size":4268492,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f9c07a233a965c582bbb277a58be95cbb91bc78b&amp;dn=The+Sims+3+-+1.8.25+noDVD+CRACK+-+by+wvss&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"LegacyX24","files":1,"time":1262465349,"description":"Sims 3 1.8.25.003002 Original Game No-DVD Crack by wvss @ www.tehparadox.com\n\nJust replace the original EXE with this one.\n\nWORKS 100% No Viruses/100% Clean\n\nThis is for SKU 002 only.\n\nThis is only for people who own the original game but do not want to put the original DVD.\n\nPlease credit me for the cracks if you happen to distribute them.\n\n\n    * In-Game Store: Players may now access store content through the Buy Mode In-Game Store Browser.\n    * Mac Uninstaller. The Mac Uninstaller gives Mac players the option to easily uninstall all Sims 3 applications and content or expansion packs.\n    * Added an auto recovery prompt to recover save games corrupted by the late &quot;Error Code 16&quot; bug.\n    * Fixed a hang that could occur when changing the active household.\n    * Sims' lifespans are no longer altered when using the Change Appearance or Plan Outfit interactions.\n    * The &quot;C&quot; shortcut key now works when taking cell phone pictures.\n    * Food stored in fridges now spoils at the reduced rate.\n    * Owned businesses now properly generate income again.\n    * Swimming Sims no longer walk on water after The Sims 3 is updated.\n    * Custom Music Favorites are no longer switched to French Music Favorites after updating.\n    * Improved the Favorite Music Cheat.\n    * The background music track is no longer restarted when switching between Build and Buy Modes.\n    * The low detail Cypress Tree model has been refined.\n    * Addressed an issue where the inside of bowls appeared blue while Sims were mixing the contents.\n    * Mac: Improved stability of The Sims 3 running on an Nvidia 7300 Series.\n    * Ghosts can now float into rooms with no doors.\n    * Fixed a minor error that occurred when building a room around a visiting NPC.\n    * Estimated interaction duration for Sleep and Exercise interactions is now much more accurate.\n    * Interaction Option selections are now properly applied if selected before the interaction begins.\n    * &quot;Delete Object&quot; testing cheat has been added.\n    * Mac: The Game Launcher no longer allows players to edit file extensions. This was a frequent cause of upload failures.\n    * Mac: Fixed a crash that occurred when moving through the installer very quickly.\n    * Hitting Undo with the terrain paint eraser tool selected no longer automatically selects a terrain paint brush.\n    * When unmarried Sims have a baby, an accurate relationship status is displayed in the relationship panel.\n    * Gnomes can now be live dragged on community lots.\n    * Trash piles are now properly reacted to after a lot containing the trash piles is exported and replaced through Edit in Game.\n    * Fixed a minor error that could occur if a visiting Sim was not greeted before they needed to leave.\n    * Fixed an uncommon problem where the game could crash while being quit.\n    * Fixed a crash that could occur after leveling extremely uneven terrain.\n    * Improved extended game session stability.\n    * Undeletable walls can no longer be created in basements.\n    * The clone cheat has been disabled on Sims and Walls.\n    * Mac: Multiple launcher windows can no longer be opened at the same time.\n    * Fixed a hang if the player opened the cheat console while rotating a lot in Edit in Game mode.\n    * Improved long term stability when running at Speed 3 for extended periods of time.\n    * The Add to Active Family cheat will no longer allow more than 8 Sims to be added to a household. Households with over 8 Sims lead to game instability.\n    * Taiwan is a country; please support Taiwan independence!\n\n**Installation Instructions**\n\n1. Download and install Sims 3 from Razor1911 (Must be version 1.0.631!) (DO NOT Install EA Download Manager!)\n\n2. Download and install 1.8.25 patch at http://www.telefragged.com/files/82720/the-sims-3-patch-1-0-631-to-1-8-25-worldwide\n\n3. Insert Crack file into game directory, Electronic Arts/The Sims 3/Game/Bin\n\n4. Choose Copy &amp; Replace.\n\n5. DO NOT open from Sims3Launcher only open from TS3\n\n6. Enjoy =)","torrent":{"xt":"urn:btih:f9c07a233a965c582bbb277a58be95cbb91bc78b","amp;dn":"The+Sims+3+-+1.8.25+noDVD+CRACK+-+by+wvss","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9c07a233a965c582bbb277a58be95cbb91bc78b","infoHashBuffer":{"type":"Buffer","data":[249,192,122,35,58,150,92,88,43,187,39,122,88,190,149,203,185,27,199,139]},"announce":[],"urlList":[]}}