{"title":"Crazy Rulers of the World, Jon Ronson Documentaries","uid":5330394,"size":1028313670,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:fa7a2f35eb80bc44a13d5a02776d6018f7665a72&amp;dn=Crazy+Rulers+of+the+World%2C+Jon+Ronson+Documentaries&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Big-Biggington-The-Third","files":3,"time":1265150263,"description":"The Crazy Rulers of the World is the extraordinary, never before told story of what happened when chiefs of US intelligence, the army, and the government began believing in very strange things.\n \nThree years in the making, Jon Ronson's Crazy Rulers of the World explores the apparent madness at the heart of US military intelligence.\n \nWith first-hand access to the leading players in the story, Jon Ronson examines the extraordinary - and plain bizarre - national secrets at the core of George W Bush's war on terror.\n \nPsy OpsThe three-part series begins with The Men Who Stare at Goats, which charts the history of a secret US Army unit founded in 1979 - the First Earth Battalion.\n \nThe programme uncovers the startling truth about this unit's involvement with paranormal activities that defy all known accepted military practice, including mind reading, out of body experiences and 'thought-death' experiments carried out on goats at Fort Bragg.\n \nIn programme two, Jon Ronson reveals how the New Age movement of the 1980s has influenced interrogation at Guantanamo Bay and in post-war Iraq.\n \nThe final episode looks into the military's involvement with remote viewing and mind control experiments.\n \nEPISODES:\nThe Men Who Stare At Goats\nFunny Torture\nPsychic Footsoldiers \n\nI will seed until a decent amount of people are seeding also =)","torrent":{"xt":"urn:btih:fa7a2f35eb80bc44a13d5a02776d6018f7665a72","amp;dn":"Crazy+Rulers+of+the+World%2C+Jon+Ronson+Documentaries","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa7a2f35eb80bc44a13d5a02776d6018f7665a72","infoHashBuffer":{"type":"Buffer","data":[250,122,47,53,235,128,188,68,161,61,90,2,119,109,96,24,247,102,90,114]},"announce":[],"urlList":[]}}