{"title":"Dead Rising Chop Til You Drop [PAL] [WiiTorrentZ]","uid":5358544,"size":3598153429,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:fa7f0b962131f306a15bd1e8219791133d5a21e8&amp;dn=Dead+Rising+Chop+Til+You+Drop+%5BPAL%5D+%5BWiiTorrentZ%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ecabuk","files":-1,"time":1266025013,"description":"NAME: Dead Rising: Chop Till You Drop\nREGI: PAL\nLANG: MULTI-5\nGENR: Action\nSIZE: 3.35GB\n    \nProduct Description:\nDead Rising: Chop Till You Drop follows the harrowing tale of Frank West, an overly zealous freelance journalist on a hunt for the scoop of a lifetime. In pursuit of a juicy lead, he makes his way to the small suburban town of Willamette only to find that it has become overrun by zombies. Frank escapes to the local shopping mall, thinking it will be a bastion of safety but it turns out to be anything but. It will be a true struggle to survive the endless stream of enemies, but players will have full reign of a realistic shopping centre and its varied stores offering an endless supply of real and makeshift weapons to fight off the flesh-hungry mob. If Frank is running low on health he can pay a visit to one of the many restaurants or cafes for a meal in order to restore his energy and continue the fight. The game is split into a series of individual cases, all of which Frank must complete in order to gain vital information that will allow him to piece together the truth behind the horrendous epidemic. In addition to the cases, players will be faced with the dilemma of deciding the rescue priority of the residents of Wilamette who also sought sanctuary in the mall. Depending on the playerÃ‚Â¿s skill, some may not be so fortunate as each rescue needs to be undertaken in a set time period, therefore players may need to delay completion of a case in order to save a fellow human. Dead Rising: Chop Till You DropÃ‚Â¿s infectious humor delivers some welcome relief from the incessant tide of zombies with players able to dress Frank up in a variety of comedic costumes and take on the undead hordes with a selection of improvised and sometimes highly ineffective weapons such as a toy sword or a football.","torrent":{"xt":"urn:btih:fa7f0b962131f306a15bd1e8219791133d5a21e8","amp;dn":"Dead+Rising+Chop+Til+You+Drop+%5BPAL%5D+%5BWiiTorrentZ%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa7f0b962131f306a15bd1e8219791133d5a21e8","infoHashBuffer":{"type":"Buffer","data":[250,127,11,150,33,49,243,6,161,91,209,232,33,151,145,19,61,90,33,232]},"announce":[],"urlList":[]}}