{"title":"AV Video Morpher 3.0.26","uid":5360565,"size":12173865,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:fc36f7438c217b396a3878c27231a6bda4791cc0&amp;dn=AV+Video+Morpher+3.0.26&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"lewarsqx4bh","files":2,"time":1266086080,"description":"Program AV Video Morpher - a great tool for editing home videos and movies for sale. In this video tool, you can play, and play audio and video streams in real time, add effects to movies, convert video files to AVI and WMV, edit subtitles, capture images, record DVD audio, burn VCD, create DVD / CD envelope and do film editing.\n\nThe program supports almost all video formats (AVI, MPG, MPEG, MOV, QT, M1V, etc.). The program differs from other movie player and software for editing movies, software AV Video Morpher makes installation easy, thanks to the voice recording with a single click, programs and settings for voice removal assembly.\nTo make editing movies, this tool lets you record voices from microphones then miksovat them with the originals and combine them into video files. Available voices called &quot;nickvoices&quot; will help you with this.\nAnother great feature of the program - the opportunity to change the audio in real time - video streams with audio and video effects, which makes the characters sound sexier movie, more frightening or more romantic.\nNow you can create video clips as easy as pie. The program also allows you to convert fixed films in AVI or WMV for private use. Recording function as drawings, and DVD audio capturing, allows you to save your favorite moments of all time.","torrent":{"xt":"urn:btih:fc36f7438c217b396a3878c27231a6bda4791cc0","amp;dn":"AV+Video+Morpher+3.0.26","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc36f7438c217b396a3878c27231a6bda4791cc0","infoHashBuffer":{"type":"Buffer","data":[252,54,247,67,140,33,123,57,106,56,120,194,114,49,166,189,164,121,28,192]},"announce":[],"urlList":[]}}