{"title":"Looking For a Thrill: An Anthology of Inspiration","uid":5268928,"size":1821745152,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fd07a94cd057cc4e3a79f47ea37d1e99179dd2eb&amp;dn=Looking+For+a+Thrill%3A+An+Anthology+of+Inspiration&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"bnuh","files":7,"time":1262981766,"description":"Looking For a Thrill: An Anthology of Inspiration is a collection of personal stories about defining moments of musical inspiration (a record, a show, a musician, etc.) for 112 musicians who themselves have inspired so many. The interviews on the DVD include recollections by Mike Watt, Thurston Moore, Hamid Drake, Bjork, Yo La Tengo, Tortoise, the Butchies, Jon Spencer, Vic Chesnutt, Kurt Wagner, Fred Anderson and Giant Sand - as well as members of the Urinals, Califone, Jesus Lizard, the Boredoms, Mekons, Slint, the Sea and Cake, and Calexico (to name just a few). Over five hours of inspiration in total! Although all were asked one simple question - to tell a story about a musical moment that inspired - the responses are as varied as the people interviewed. The film is a great resource for all those interested in the independent musical mind. As a collection, it reveals much about the moments that inspire so many to pick up a guitar or a microphone, to start a label or a band.","torrent":{"xt":"urn:btih:fd07a94cd057cc4e3a79f47ea37d1e99179dd2eb","amp;dn":"Looking+For+a+Thrill%3A+An+Anthology+of+Inspiration","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd07a94cd057cc4e3a79f47ea37d1e99179dd2eb","infoHashBuffer":{"type":"Buffer","data":[253,7,169,76,208,87,204,78,58,121,244,126,163,125,30,153,23,157,210,235]},"announce":[],"urlList":[]}}