{"title":"Zane Grey Theater - 1 season (complete)","uid":5273379,"size":6703126189,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:fe46eb1a1179e27c52856ab2646992021ea3d2ed&amp;dn=Zane+Grey+Theater+-+1+season+%28complete%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"matreshka4u","files":-1,"time":1263304929,"description":"People, stay after downloading for a while, pls, let the others have it, too.\n\n\n&quot;From out of the West...Dick Powell's Zane Grey Theatre!&quot;\n                   \n                  Another necessary library addition for lovers of vintage TV \n                  Westerns and dramas. VCI Entertainment has released Dick \n                  Powell's Zane Grey Theatre: Complete Season One, a four-disc, \n                  29-episode collection of the first 1956-1957 season of this \n                  well-remembered CBS hit. Jumping right in when the Western \n                  &quot;grew up&quot; on television, Dick Powell's Zane Grey Theatre \n                  offered a weekly dramatic anthology format set in the Old West \n                  that featured a cornucopia of established stars and promising \n                  up-and-comers enacting these trim, tight little \n                  black-and-white morality tales. VCI has done a great job \n                  restoring this series (as best it could, I would imagine), \n                  while offering a few interesting extras, as well.\n                  The format of Dick Powell's Zane Grey Theatre was not at all \n                  unlike other dramatic anthology series on television at that \n                  time - it only differed in that the settings for the various \n                  stories were set about seventy years back in time. Actor and \n                  producer-powerhouse Dick Powell would introduce each episode, \n                  usually offering up some interesting Western folklore or \n                  demonstrating the uses of various Old West tools and firearms \n                  - along with some marvelously loose jokes and kids about that \n                  era - before the individual episode would begin. Powell would \n                  also show up occasionally as the star of an episode (as did \n                  Four Star Production partner David Niven, as well as frequent \n                  star and director, Ida Lupino), but mainly he served as host \n                  for these speedy, concise little playlettes, featuring at the \n                  very least one name actor (or an actor soon to be a name on \n                  television or the movies) in the episode's lead role.\n\nDISC # ONE\n\n01) You Only Run Once (aka: The Hangin' Tree) (10/5/1956) \n                  Cast: Robert Ryan, Cloris Leachman, John Hoyt, Howard Petrie, \n                  Stuart Randall, Parley Baer.\n\n02) Fearful Courage (10/12/1956) \n                  Cast: Ida Lupino, James Whitmore, Michael Pate, Paul Hahn, \n                  Robert Karnes.\n\n03) Long Road Home (11/23/1956) \n                  Cast: Dick Powell, Ray Collins, Ainslie Pryor, Jean Willies, \n                  Robert Armstrong, Francis J. McDonald, Alan Wells, Conrad \n                  Janis.\n\n04) The Unrelenting Sky (10/26/1956) \n                  Cast: Lew Ayres, Phyllis Avery, Walter Sande, Steven Geray, \n                  Willis Bouchey.\n\n05) Lariat (11/2/1956) \n                  Cast: Jack Palance, Constance Ford, Addison Richards, Robert \n                  Anderson, Michael Garrett, Guy Teague, Buff Brady.\n\n06) Death Watch (11/9//1956 \n                  Cast: Lee J. Cobb, Bobby Driscoll, John Larch, John Alderson, \n                  Abel Fernandez.\n\n07) Stage for Tucson (11/16/1956) \n                  Cast: Eddie Albert, Mona Freeman, John Ericson, Rusty Lane, \n                  Ian MacDonald, Jaclynne Greene, DeForest Kelley, Bing Russell, \n                  Ray Baxter, Tyler McVey.\n\n08) A Quiet Sunday in San Ardo (11/23/1956) \n                  Cast: Wendell Corey, Gerald Mohr, Peggie Castle, Harry Lauter, \n                  Morgan Woodward, Robert Burton, Tim Graham, Sam Flint.\n\nDISC # TWO\n\n09) Vengeance Canyon (11/301956) \n                  Cast: Walter Brennan, Ben Cooper, Sheb Wooley, Robert Griffen.\n\n10) Return to Nowhere (12/7/1956) \n                  Cast: Stephen McNally, John Ireland, Audrey Totter, Jimmy \n                  Baird, Ralph Moody, Dan Riss, Chris Alcaide.\n\n11) Courage is a Gun (12/14/1956) \n                  Cast: Dick Powell, Beverly Garland, Robert Vaughn, James \n                  Westerfield, Claude Akins, Leonard Penn, Robert Bice.\n\n12) Muletown Gold Strike (12/21/1956) \n                  Cast: Rory Calhoun, Barbara Eiler, Bobby Clark, Parley Baer, \n                  Dabbs Greer, Denver Pyle, Arthur Space.\n\n13) Star Over Texas (12/28/1956) \n                  Cast: Ralph Bellamy, Gloria Talbot, James Garner, Beverly \n                  Washburn, Guy Teague, Dick Farnsworth, Max Wagner.\n\n14) Three Graves (1/4/1957) \n                  Cast: Jack Lemmon, Nan Leslie, Frank Ferguson, James Best, \n                  Terry Frost, Dan Kennedy, Richard Cutting, Pat Collins, \n                  Michael Galloway.\n\n15) No Man Living (1/11/1957) \n                  Cast: Frank Lovejoy, Margaret Hayes, Judson Pratt, Russ \n                  Conway, Peter Whitney, James Anderson, William Newell, \n                  Stafford Repp.\n\n16) Time of Decision (1/18/1957) \n                  Cast: Lloyd Bridges, Diane Brewster, Walter Sande, Bill Erwin, \n                  Tommy Cook, Jean Howell, Mort Mills, Regis Toomey, Trevor \n                  Bardette, Mimi Gibson.\n\n\n                  DISC # THREE\n\n17) Until the Man Dies (1/25/1957) \n                  Cast: Stuart Whitman, John Payne, Carolyn Jones, Steve \n                  Darrell, Dick Rich, Stuart Randall, Gregg Barton, James Seay, \n                  Richard Newton.\n\n18) Backtrail (2/1/1957) \n                  Cast: Dick Powell, Catherine McLeod, James Anderson, Raymond \n                  Bailey, Robert Crosson, Emile Meyer, John Pickard, Kim \n                  Charney, Arthur Q. Bryan, Theodore Marcuse.\n\n19) Dangerous Orders (2/8/1957) \n                  Cast: Mark Stevens, Jack Elam, Willis Bouchey, Robert \n                  Cornthwaite, William Leicester, Thomas B. Henry, John \n                  Eldredge, Simon Scott.\n\n20) The Necessary Breed (2/15/1957) \n                  Cast: Sterling Hayden, Jean Willies, James Griffith, Carlyle \n                  Mitchell, Strother Martin, Gregory Walcott, Bill Henry, Roy \n                  Barcroft, Frank Scanneli, Bill Fawcett, Fred Sherman.\n\n21) Village of Fear (3/1/1957) \n                  Cast: David Niven, George D. Wallace, Ross Elliott, Peter \n                  Hansen, DeForest Kelley, Don Diamond, Harry Lauter, Dan \n                  Barton, Anne Barton, Bill Catching, Troy Melton, Gary Hunley.\n\n22) Black Creek Encounter (3/8/1957) \n                  Cast: Ernest Borgnine, Jan Merlin, Norma Crane, Billy Chapin, \n                  Lou Krugman, Howard Negley.\n\n23) There Were Four (3/15/1957) \n                  Cast: John Derek, Dean Jagger, David Janssen, James Gavin, \n                  Dick Rich, Grant Withers, Jimmie Komack, Kenneth MacDonald.\n\n24) Fugitive (3/22/1957) \n                  Cast: Eddie Albert, Celeste Holm, Peter Votrian, Richard \n                  Shannon, Denver Pyle.\n\n\n                  DISC # FOUR\n\n25) A Time to Love (4/5/1957) \n                  Cast: Ralph Meeker, Julie London, Forrest Lewis, Ken Lynch, \n                  John Larch, Walter Barnes, Alan Wells.\n\n26) Black is for Grief (4/12/1957) \n                  Cast: Mary Astor, Beulah Bondi, Skip Homeier, Chester Morris, \n                  Mala Powers, Tom Tyron, Tom Tully, Richard Anderson.\n\n27) Badge of Honor (5/3/1957) \n                  Cast: Gary Merrill, Tom Tully, Robert Culp, Peggy Webber, Dick \n                  Gardner, Mike Ragan, Walter Coy, Bill Henry, Bill Leicester, \n                  Richard Devon.\n\n28) Decision at Wilson's Creek (5/17/1957) \n                  Cast: John Forsythe, John Dehner, Bart Burns, Willis Bouchey, \n                  Harry Lauter, Joe Di Reda, John Wilder, William Swan, Don \n                  House, Bill Boyett, Marjorie Lord.\n\n29) Man on the Run (6/21/1957) \n                  Cast: Scott Brady, Nancy Hale, Eve Miller, Hugh Sanders, Mort \n                  Hall, Adam Kennedy.\n","torrent":{"xt":"urn:btih:fe46eb1a1179e27c52856ab2646992021ea3d2ed","amp;dn":"Zane+Grey+Theater+-+1+season+%28complete%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe46eb1a1179e27c52856ab2646992021ea3d2ed","infoHashBuffer":{"type":"Buffer","data":[254,70,235,26,17,121,226,124,82,133,106,178,100,105,146,2,30,163,210,237]},"announce":[],"urlList":[]}}