{"title":"Twisted Sister - I Saw Mommy Kissing Santa Claus  (2nafish)","uid":5226055,"size":142735364,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:fee1ef483f80fc6b25485b34e791a95294bef380&amp;dn=Twisted+Sister+-+I+Saw+Mommy+Kissing+Santa+Claus++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1261131302,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;I Saw Mommy Kissing Santa Claus&quot; is a Christmas song with music and lyrics by Tommie Connor.\n\nThe original recording by Jimmy Boyd reached number one on the Billboard charts in 1952, and on the Cash Box magazine chart at the beginning of the following year. The song was commissioned by Neiman Marcus to promote the store's Christmas card for the year, which featured an original sketch by artist Perry Barlow, who drew for The New Yorker for many decades.\n\nJimmy Boyd's record was condemned by the Roman Catholic Church in Boston when it was released on the grounds it mixed kissing with Christmas. Boyd, age thirteen, was photographed meeting with the Archdiocese to explain the song. After the meeting, the ban was lifted.\n\nThe song describes a scene where a child creeps down from his bedroom to see his mother kissing &quot;Santa Claus&quot; (his father) underneath the mistletoe.\n\nA Twisted Christmas is a Christmas album from US heavy metal group Twisted Sister, released on October 17, 2006. The album features classic Christmas songs performed in Heavy metal versions.\n\nTwisted Sister is an American heavy metal band from New York City. Their work fuses the shock tactics of Alice Cooper, the rebellious mood of the New Wave of British Heavy Metal, and the extravagant image of glam rock bands such as New York Dolls notably for the makeup. Musically, the band implements elements of traditional heavy metal bands such as Judas Priest, along with a style that is similar to early glam metal bands. The band is generally categorized as glam metal for their earlier work, although the band does not consider themselves to be so.\n\nAlthough the band was formed by guitarist Jay Jay French in December 1972, all of their songs were written by Dee Snider from 1976 onward. Snider remarked to Johnny Carson that the proposed name for the band was &quot;This&quot; but was rejected for fear of fans saying &quot;this sucks&quot;. He describes Twisted Sister as &quot;Slade meets Sex Pistols&quot;. Twisted Sister's most well-known hits include &quot;We're Not Gonna Take It&quot; and &quot;I Wanna Rock&quot;, both popularized in the USA by regular airplay on MTV tv channel in the 1980s. Many of the band's songs explore themes of parent vs. child conflicts and criticisms of the educational system.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:fee1ef483f80fc6b25485b34e791a95294bef380","amp;dn":"Twisted+Sister+-+I+Saw+Mommy+Kissing+Santa+Claus++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fee1ef483f80fc6b25485b34e791a95294bef380","infoHashBuffer":{"type":"Buffer","data":[254,225,239,72,63,128,252,107,37,72,91,52,231,145,169,82,148,190,243,128]},"announce":[],"urlList":[]}}